["GUESS (CURRENCY:GUESS) traded down 4.8% against the U.S. dollar during the 24-hour period ending at 22:00 PM ET on February 24th. In the last week, GUESS has traded flat against the U.S. dollar. One GUESS token can now be purchased for $0.18 or 0.00001598 BTC on cryptocurrency exchanges including YoBit and Stocks.Exchange. GUESS has a total market capitalization of $0.00 and approximately $21,179.00 worth of GUESS was traded on exchanges in the last 24 hours.\n\nHere is how other cryptocurrencies have performed in the last 24 hours:\n\nGet GUESS alerts: Ripple (XRP) traded down 6.4% against the dollar and now trades at $0.94 or 0.00009829 BTC. NEO (NEO) traded down 6.9% against the dollar and now trades at $116.86 or 0.01215650 BTC. Stellar (XLM) traded 8.5% lower against the dollar and now trades at $0.35 or 0.00003664 BTC. IOTA (MIOTA) traded 7.3% higher against the dollar and now trades at $1.92 or 0.00019945 BTC. TRON (TRX) traded 9.8% lower against the dollar and now trades at $0.0403 or 0.00000419 BTC. VeChain (VEN) traded 9.1% lower against the dollar and now trades at $5.53 or 0.00057569 BTC. Tether (USDT) traded 0% higher against the dollar and now trades at $1.00 or 0.00010423 BTC. Binance Coin (BNB) traded 6.5% lower against the dollar and now trades at $9.11 or 0.00094820 BTC. Populous (PPT) traded down 10.1% against the dollar and now trades at $21.08 or 0.00219340 BTC. RChain (RHOC) traded 7.6% lower against the dollar and now trades at $1.86 or 0.00019316 BTC.\n\nGUESS Profile\n\nGUESS was first traded on October 28th, 2017. GUESS's total supply is 200,000,000 tokens. GUESS's official message board is medium.com/@peerguess. GUESS's official website is peerguess.com. GUESS's official Twitter account is @peerguess.\n\nAccording to CryptoCompare, \"Peerguess is a cryptocurrency price ticker app designed to predict price movements in Bitcoin in the next 24h. It allows users to guess future prices to earn gems, learn about community tendencies and have access to the sophisticated data to improve their intuition. The aforementioned Gems can be converted to GUESS, an Ethereum-based token that acts the main currency in the platform allowing users to access aditional features. \"\n\nGUESS Token Trading\n\nGUESS can be traded on these cryptocurrency exchanges: Stocks.Exchange and YoBit. It is not presently possible to buy GUESS directly using U.S. dollars. Investors seeking to trade GUESS must first buy Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as GDAX, Gemini or Coinbase. Investors can then use their newly-acquired Bitcoin or Ethereum to buy GUESS using one of the exchanges listed above.\n\nReceive News & Updates for GUESS Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for GUESS and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "Bitcoin prices today and the prices of 96 other cryptocurrencies rebounded, and Bitcoin prices alone surged as much as $2,000 over the last 24 hours.\n\nThe global cryptocurrency market recovered roughly $89 billion thanks to positive sentiment shared Tuesday by J. Christopher Giancarlo, the chair of the CFTC.\n\nThe markets had expected a much harsher stance from government agencies looking to expand their influence on the cryptocurrency markets.\n\nGiancarlo, though, said yesterday that Bitcoin had an important function in the global markets.\n\n\"It's important to remember that if there was no Bitcoin, there would be no blockchain,\" he said during a hearing before the Senate Banking Committee.\n\nIn addition, the head of the U.S. Securities and Exchange Commission (SEC) said that the agency would reconsider Bitcoin ETFs if other industry rules are satisfied.\n\nBelow is a recap of the top cryptocurrency prices at 2:00 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nThe best performers from the top 50 largest cryptocurrencies by market capitalization today included Electroneum (up 42.155), Aeternity (up 35.22%), Nano (up 32.01%), 0x (up 26.79%), Lisk (up 26.41%), NEO (up 25.71%), Gas (up 24.55%), Bytecoin (up 23.35%), and Monero (up 22.69%).\n\nOnly one cryptocurrency from the top 50 was in the red today. It was Populous (down -1.21%).\n\nThomas Glucksmann, an executive at the token exchange Gatecoin, predicted that the global cryptocurrency industry could soon top $1 trillion thanks to an influx of institutional money.\n\n\"Increasing regulatory recognition of cryptocurrency exchanges, the entrance of institutional capital, and major technology developments will contribute to the market's rebound and push cryptocurrency prices to all new highs this year,\" he told CCN.\n\nGlucksmann predicts that Bitcoin could top $50,000 by the end of the year thanks to the highly anticipated Lightning Network.\n\nAnd Glucksmann wasn't the only prominent voice sharing high hopes for Bitcoin...\n\nTyler Winklevoss said that he welcomed regulatory oversight during an interview with Bloomberg.\n\n\"Our whole thesis is that these technologies can't flourish and grow without thoughtful regulations connecting them to traditional finance,\" Winklevoss said.\n\nHe added in another interview with CNBC that he expects Bitcoin to be worth as much as 40 times its current valuation in the future.\n\nMarkets are still trying to determine when the United Kingdom may take action on Bitcoin.\n\nMust Read: 5 Cryptocurrencies to Watch in 2018 Under $10\n\nIn late January, UK Prime Minister Theresa May said that the United Kingdom could move soon \"precisely because of the way they are used, particularly by criminals.\"\n\nDespite the surge in prices today, the rally could be short-lived.\n\nAt least, that's what Goldman Sachs Group Inc. (NYSE: GS) is telling its clients...\n\nIn a research note from Feb. 5, Goldman analyst Steve Strongin said he believes that the value of many cryptocurrencies will crater to zero in the future.\n\nHe argues that current crypto projects are \"too primitive\" to remain viable over the long term. In addition to high costs and long-term viability questions, he also raised concerns about hackers and other cybersecurity threats plaguing the global industry.\n\nIt's a stunning breakthrough that's set to spark the most monumental life-changing transformation you'll ever see.\n\nThe Washington Times says the technology behind this revolutionary innovation \"will change the world on a scale hardly seen in human history.\"\n\nAnd now that it's approved by the FCC, the floodgates are set to open - and could reward early investors with astronomical gains.\n\nWith one tiny company at the heart of this massive shift, even a small investment could create staggering wealth for years to come.", "Dynamic Trading Rights (CURRENCY:DTR) traded down 12.6% against the dollar during the 1-day period ending at 14:00 PM Eastern on February 24th. Dynamic Trading Rights has a market capitalization of $93.74 million and $56,167.00 worth of Dynamic Trading Rights was traded on exchanges in the last day. One Dynamic Trading Rights token can currently be purchased for approximately $0.0790 or 0.00000823 BTC on major cryptocurrency exchanges. In the last seven days, Dynamic Trading Rights has traded down 22% against the dollar.\n\nHere's how other cryptocurrencies have performed in the last day:\n\nGet Dynamic Trading Rights alerts: Ripple (XRP) traded 5.4% lower against the dollar and now trades at $0.94 or 0.00009761 BTC. NEO (NEO) traded down 2.3% against the dollar and now trades at $117.28 or 0.01217440 BTC. Stellar (XLM) traded down 5.9% against the dollar and now trades at $0.36 or 0.00003689 BTC. IOTA (MIOTA) traded down 0.7% against the dollar and now trades at $1.73 or 0.00018001 BTC. VeChain (VEN) traded down 5.5% against the dollar and now trades at $5.62 or 0.00058369 BTC. TRON (TRX) traded down 3.8% against the dollar and now trades at $0.0406 or 0.00000421 BTC. Tether (USDT) traded flat against the dollar and now trades at $1.00 or 0.00010404 BTC. Binance Coin (BNB) traded down 4.6% against the dollar and now trades at $8.96 or 0.00093036 BTC. Populous (PPT) traded down 10.3% against the dollar and now trades at $21.24 or 0.00220435 BTC. RChain (RHOC) traded 6.1% lower against the dollar and now trades at $1.86 or 0.00019268 BTC.\n\nDynamic Trading Rights Token Profile\n\nDynamic Trading Rights was first traded on November 30th, 2017. Dynamic Trading Rights' total supply is 3,750,000,000 tokens and its circulating supply is 1,186,310,945 tokens. The official website for Dynamic Trading Rights is www.tokens.net. Dynamic Trading Rights' official Twitter account is @TokensNet and its Facebook page is accessible here.\n\nAccording to CryptoCompare, \"Tokens.net is a cryptocurrency trading platform that allows users to exchange ERC20 tokens and other cryptocurrencies. Trading fees within the platform are paid in Dynamic Trading Rights (DTR), an ERC20 token on the Ethereum blockchain. DTR is charged as trading fees based on the market price of DTR at the moment of the trade. A transaction for a DTR holder will be charged at the best ask price, ignoring the market depth. Users that do not hold DTR will be charged a fee in the currency they are trading in. Conversion of the fee cost into DTR will be executed automatically and clients owning DTR will have their DTR subtracted from their balance, based on the DTR's market value.\"\n\nDynamic Trading Rights Token Trading\n\nDynamic Trading Rights can be bought or sold on the following cryptocurrency exchanges: Livecoin. It is not possible to buy Dynamic Trading Rights directly using U.S. dollars. Investors seeking to trade Dynamic Trading Rights must first buy Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as Changelly, Coinbase or GDAX. Investors can then use their newly-acquired Bitcoin or Ethereum to buy Dynamic Trading Rights using one of the exchanges listed above.\n\nReceive News & Updates for Dynamic Trading Rights Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Dynamic Trading Rights and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "Bitcoin prices are falling today thanks to concerns and some misunderstandings of cryptocurrency regulations in India.\n\nIndia's Finance Minister, Arun Jaitley, made a budget speech today in which he said his country does not recognize cryptocurrencies as legal tender.\n\nHowever, some mainstream media journalists claimed that a ban on cryptocurrencies in India was imminent, according to CoinTelegraph.com.\n\nIn addition, Coinbase, the top U.S. cryptocurrency marketplace, experienced serious errors around its SMS two-factor authentication.\n\nAnd on top of all that, The New York Times reported yesterday that the exchange Bitfinix has inflated digital currency values.\n\nThe report indicates that the exchange has a \"checkered history of hacks and opaque business practices.\"\n\nIn December, the U.S. Commodity Futures and Trading Commissions (CFTC) sent the exchange a subpoena to discuss a virtual currency called Tether.\n\nDevelopers of Tether have claimed that the cryptocurrency is backed by the U.S. dollar. However, investors have worried that hundreds of millions of dollars in new Tether coins were created and injected into the market.\n\nAs a result, these coins were likely used to purchase other cryptocurrencies, which may have fueled a rally in prices in November and December.\n\nShould Tether be found to be insolvent, it's unclear just how devastating of an impact it would have on the global cryptocurrency markets.\n\nBelow is a recap of the top cryptocurrency prices at 3:30 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Thursday, the market capitalization of the global cryptocurrency sector plunged to $448.99 billion. That figure is down sharply from more than $800 billion just 30 days ago.\n\nBitcoin represented 34.0% of the total cryptocurrency market, with a market capitalization of $152.16 billion.\n\nOnly one cryptocurrency in the top 100 by market capitalization saw gains on the day. DigixDao, which gained 23.49%, is \"a new form of cryptographic asset in that it is a Decentralized Autonomous Organization or DAO for short,\" according to its website.\n\nThe worst performers from the top 50 largest cryptocurrencies by market capitalization included ICON (down -23.94%), Ardor (down -21.87%), Populous (down -21.44%), Nano (down -21.41%), Lisk (down -18.52%), Siacoin (down -18.36%), Stratis (down -18.23%), and Walton (down -17.69%).\n\nBitcoin is now off more than 55% from its December peak of $19,500.\n\nBut that hasn't stopped one of Wall Street's biggest bulls from calling today's price a top opportunity to get into the cryptocurrency.\n\nMust Read: 5 Cryptocurrencies to Watch in 2018 Under $10\n\nFundstrat's Tom Lee said in mid-January that $9,000 would be a \"major low\" for Bitcoin.\n\nAt these levels, he sees \"the biggest buying opportunity in 2018\" for Bitcoin and has maintained a year-end price target for Bitcoin of $25,000.\n\nLee has also suggested that Bitcoin will hit $125,000 by 2022.\n\nAs noted above, the CFTC is moving quickly to examine the cryptocurrency's operations. This week, Bloomberg reported that Tether and Bitfinix both share the same CEO, Jan Ludovicus van der Velde.\n\nBloomberg also reported that neither firm had previously disclosed its management or headquarters on its sites. The report came after many people began asking questions about whether Tether had been used to prop up Bitcoin prices in December.\n\nThe story got much more confusing after Tether stopped working with its only auditor, Friedman LLP, last week.\n\nAn audit had begun after many people accused the development team of creating lots of crypto tokens \"out of thin air.\" The charges from many people in the community suggest that Tether was used to purchase Bitcoin and help sustain prices.\n\nThe auditor had said back in September that the firm had enough U.S. dollar reserves.\n\nHowever, Friedman had said it hasn't been able to authenticate all of the firm's records.\n\nTether had previously refused to name the banks where it houses roughly $400 million in reserves. Bloomberg journalists have said the company offered to reveal those names only if the media firm signed an NDA.\n\nThe editorial team turned down the offer.\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "Welcome to Lifehacker's weekly round up of all things Bitcoin, altcoin and cryptocurrency. Bitcoin Mania has certainly died down, two months into the year, but there's still plenty of news about regulation, new technology and rival cryptocurrencies to sort through.\n\nHere's the big news in Bitcoin this week.\n\nFirst up, Bitcoin made some solid ground over the last week, cresting at around $11,800USD before falling back under the $10,000USD mark today. Nearly all cryptocurrencies are currently sitting in the red, besides Nano, which used to be known as RaiBlocks. Nano is sitting in the green by 21% as of writing, likely due to the announcement that a Nano Wallet is now in Beta on Google Play. Some good news for Bitcoin is the launch of SegWit on exchanges such as Coinbase and Bitfinex. SegWit, short for Segregated Witness, is a change in the transaction format for Bitcoin that has been implemented in other altcoins and can drive down transaction fees - one of the major stumbling blocks when Bitcoin's price soared at the end of last year. On the flipside - BTC is 'on trial' today in the US. A Bitcoin investor was recently arrested for exchanging Bitcoin for cash in the state and has faced court in San Diego today. It's hard to get a good read on what's what in this case, but much of the BTC community is worried that this is an attack by the US Government to more carefully regulate the cryptocurrency. A Singaporean man by the name of 'Robert' (or Bob, to his mates) has travelled to Australia with no bank or credit cards - only using cryptocurrency to fund his holiday. It seems like the company TravelbyBit made it all possible. Not sure how much truth there is to this one, but an interesting thought - is it currently possible to travel on crypto alone? It feels like there's not enough support in Australia yet. Do you use crypto to buy anything? In my first Bitcoin Hacker, I linked to the excellent Motherboard piece about Jackson Palmer, creator of Dogecoin. Here's another story about Dogecoin's inception, creation and ultimately how a joke became a legitimate cryptocurrency. Are you on board with the Doge? Besides me, your friendly neighbourhood cryptBro, there's not a lot of people you should trust in the space. Here's a complete list:\n\nThe DEFINITIVE List of People You Should Trust in Crypto from CryptoCurrency\n\nPewDiePie takes on the Bitconnect scam and no matter what you feel about Bitconnect and PewDiePie, it's actually great because of how many times you hear the words BITCONNNNNNNNNNEEEEEEEEEEEEEEEEEECT screamed.\n\nSee you next week, LifeHodlers.\n\nBitcoin Hacker is our weekly roundup of the big news in Bitcoin and cryptocurrency. If there's anything you particularly want to hear about this week, let us know in the comments.", "It's the Holy Grail of cryptocurrencies - an asset with all the benefits of decentralisation but none of the volatility.\n\nTether, which claims to be pegged one-to-one to the dollar, is the most prominent among so-called stable coins. It's also the most controversial, with US regulators and investors trying to sort out whether it's a scam. Even with Tether under a cloud, demand is rising for tokens seeking to dull price swings and increase the use of virtual money.\n\nMore BusinessDay Videos Previous slide Next slide US regulators warn of cryptocurrency risks US regulators warn of cryptocurrency risks\n\n\"If you're going to give them money, you'd better be prepared to lose it,\" top US financial regulators have warned a Senate panel unregulated exchanges pose significant risks to investors.\n\nUp Next ASX winners and losers - a snapshot ASX winners and losers - a snapshot ASX winners and losers - a snapshot\n\nThe stand out listings traded on the ASX captured at key moments through the day, as indicated by the time stamp in the video.\n\nUp Next Sydney Airport profits soar Sydney Airport profits soar Sydney Airport profits soar\n\nAn increase of global travellers has lifted the profits of Sydney Airport.\n\nUp Next Tesla sticks by Model 3 target Tesla sticks by Model 3 target Tesla sticks by Model 3 target\n\nTesla says it's sticking with Chief Executive Elon Musk's revised production targets for its Model 3 sedan, cheering investors who have put up with two delays.\n\nUp Next Wesfarmers first-half profit plunge Wesfarmers first-half profit plunge Wesfarmers first-half profit plunge\n\nRetail conglomerate Wesfarmers has seen its profit drop 86 per cent, driven by a $1 billion writedown to the value of its Bunnings UK and Ireland business.\n\nUp Next Chicken shortage forces KFC to close many UK stores Chicken shortage forces KFC to close many ... Chicken shortage forces KFC to close many UK stores\n\nFast-food chain KFC said on Monday it had been forced to close hundreds of its British stores because of a shortage of chicken.\n\nUp Next India closes bank branch at heart of fraud, shares slide India closes bank branch at heart of ... India closes bank branch at heart of fraud, shares slide\n\nIndian investigators have closed down a branch of a state-run bank that is at the heart of a $1.77 billion fraud and questioned more of its employees as they probed the biggest scam in the country's banking history.\n\nUp Next Latvian PM says central bank chief should resign Latvian PM says central bank chief should ... Latvian PM says central bank chief should resign\n\nThe head of Latviaâ\u0080\u0099s central bank should resign following his detention by the anti-corruption agency, Prime Minister Maris Kucinskis said on Monday.\n\nMore videos US regulators warn of cryptocurrency risks\n\n\"If you're going to give them money, you'd better be prepared to lose it,\" top US financial regulators have warned a Senate panel unregulated exchanges pose significant risks to investors.\n\n\"Stable coins are potentially the key to unlocking widespread adoption of cryptos,\" said Rafael Cosman, the 24-year-old co-founder of San Francisco-based TrustToken, which issued a token named TrueUSD last month.\n\nTheir creators say stable coins can be used by merchants to price goods, send remittances abroad and serve as a reliable store of wealth. They can also act as a haven from the wild price swings that often accompany Bitcoin and other popular tokens.\n\nRelated Articles Bitcoin thieves threaten real violence for virtual currencies 'It was a piss take': the Aussie behind 'joke' cryptocurrency dogecoin and how it reached $2.4b\n\nTether has become a popular substitute for dollars on crypto exchanges worldwide, with about $US2.2 billion ($2.8 billion) of the tokens outstanding. While Tether has said all of its coins are backed by dollars held in reserve, the company has yet to provide conclusive evidence or have its accounts audited. The US Commodity Futures Trading Commission sent subpoenas on December 6 to Tether and related virtual-currency exchange Bitfinex, Bloomberg News reported.\n\nNuBits, launched in 2014 by what's known as a decentralised autonomous organisation, also said its coins are pegged at one-to-one with the dollar and are meant to be redeemable, though the platform doesn't guarantee the coins are fully backed. Instead, the funds are stored in a \"trustless liquidity pool,\" a blockchain-based system that claims to not rely on third parties, in which users are in control of their own funds.\n\nNuBits mints new coins to respond to demand from users, if current users vote to do so. The network controls the supply of coins in circulation to maintain price stability, and has mostly been able to maintain the price at $US1 since its inception, according to CoinMarketCap.\n\nMaker's Dai coins, which are pegged to the dollar, also depend on an automatic mechanism that controls supply and demand. Coins are backed by each user's own Ethereum-based digital assets, which are held as collateral in so-called smart contracts. Dai coins were listed in December and have been able to roughly maintain the peg.\n\nTokens issued by Maker have soared by almost five times this year to about $US15 million, and those issued by NuBits soared by 14 times to almost $US14 million, according to CoinMarketCap. That compares with bitcoin's market cap of about $US200 billion. The coins' trading volume also increased almost seven-fold, though at a high of 1.3 per cent of total volume, according to Brave New Coin, the sector is still a speck in the cryptocurrency market.\n\n'It's an illusion'\n\nCritics of stable coins say decentraliSed currencies and stable prices simply don't mesh, as the process needs to be centralized at at least one stage. The projects will need to rely on banks to hold funds, auditors for verification and centralized price feeds, said Tone Vays, a New York-based analyst known for his skepticism of most cryptocurrencies other than bitcoin.\n\n\"They will only function under an initial set of assumptions and if that's not properly calculated, and it can't be because reality isn't a test lab, the only way to fix it in the future is by having full control of the project,\" said Vays.\n\n\"It's an illusion.\"\n\nEven so, the pipeline of stable coins is growing. Some propose to back their coins one-to-one with an asset, fiat currency or a basket of those assets kept on reserve. Instead of a traditional currency, other coins would be pegged to cryptocurrencies. In a third type, an algorithm automatically controls the supply of coins so that the price doesn't fluctuate relative to the peg.\n\n\"More people coming into crypto want to hedge into something less volatile, especially when the market is falling,\" said Fran Strajnar, head of cryptocurrency technical analysis firm Brave New Coin.\n\n\"Stable coins are set to climb the ladder as some of the most in-demand crypto assets as the industry matures and more institutional participants enter the marketplace.\"\n\nTrueCoin, whose tokens haven't been listed yet, is a dollar-backed model, like Tether, but they make it clear they don't have much else in common with their biggest rival, with a section in their website dedicated to answer the question \"How is TrueCoin different from Tether?\"\n\nWhile Tether is responsible for its reserve funds, TrueCoin keeps funds in custodial accounts only investors can access. Investors are also legally entitled to redeem TrueUSD tokens for dollars kept in their custodial accounts, which will be audited by third parties. The team aims to have accounts with multiple banking partners. Alliance Trust Co. of Nevada is one of their partners and they are in talks with others, Cosman said. Tether had declined to name which banks are holding its funds.\n\n\"We're learning from other projects to try to be the best coin that we can be. Tether has done several things well, and they have maintained a stable price, but they've broken trust and that's hard to repair,\" Cosman said.\n\nStill in progress is Basecoin, which is backed by some of the most well-recognized cryptocurrency investors, including Andreessen Horowitz, Polychain Capital, Pantera Capital and MetaStable Capital. Basecoin wants to peg its coin to an exchange rate or basket of goods which will be automatically uploaded to the blockchain, either from a single feed of prices, from the median price of many feeds, or from the price agreed in a decentralised voting system. The Basecoin protocol will then expand or contract the coin supply with algorithm to keep the price peg.\n\nWaiting for the tide to change\n\nThe first attempt to create a stable cryptocurrency dates back to at least 2014, with BitShares. Like most stable coins after it, it tried to back its coins with assets but the peg hasn't worked well enough to curb price movements.\n\nThe non-crypto world has plenty of examples where pegged currencies don't work, such as Argentina, Zimbabwe and Switzerland, where economies that were too fundamentally strong or weak relative to the peg caused the system to unravel.\n\nOf course, cryptocurrencies work differently, but just like national economies, all it takes is the loss of trust for the currencies to collapse.\n\n\"These stability coins have found their natural base in the ecosystem mainly from the trust that you get cash in exchange for cryptos,\" said Charles Hayter, head of research firm CryptoCompare. \"The risk is if the tide goes the other way and you lose that trust. All you need is for the tide to change.\"\n\nThe Washington Post", "Litecoin prices today climbed to $215 per coin and remained in the top five cryptocurrencies by market capitalization.\n\nLitecoin prices are surging on news that LitePay will launch later this month, and some crypto investors may be adding more LTC ahead of the Litecoin Cash hard fork.\n\nIn other cryptocurrency news today, the price of Bitcoin climbed more than 8% and pressed above $10,000 for the first time in weeks. The uptick came after Fundstrat Global Advisors Tom Lee predicted that Bitcoin could hit $20,000 by midyear.\n\nLee also projects that Bitcoin will hit $25,000 by the end of the year.\n\nMarkets have largely recovered from concerns about South Korean efforts to regulate the sector. Traders no longer anticipate that the South Korean financial ministry will aim to ban cryptocurrency trading.\n\nBelow is a recap of the top cryptocurrency prices at 4:00 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Thursday, the market capitalization of the global cryptocurrency sector hit $474.5 billion.\n\nBitcoin represented 35.8% of the total cryptocurrency market, with a market capitalization of $170.0 billion.\n\nThe best performers from the top 50 largest cryptocurrencies by market capitalization included Waves (up 28.41%), VeChain (up 24.91%), Komodo (up 19.84%), Waltonchain (up 18.25%), Dogecoin (up 13.96%), Ark (up 12.12%), Lisk (up 11.24%), and Decred (up 10.74%).\n\nThe worst performers from the top 50 largest cryptocurrencies by market capitalization included Populous (down -6.86%), Nano (down -5.91%), RChain (down -5.69%), 0x (down -4.49%), Aeternity (down -2.11%), OmiseGO (down -1.40%), NEM (down -1.18%), and Kin (down -1.02%).\n\nThe push back above $10,000 came despite news that Berkshire Hathaway Vice Chair Charles Munger called Bitcoin \"totally asinine.\"\n\nMust Read: 5 Cryptocurrencies to Watch in 2018 Under $10\n\nMunger told The Daily Journal that he \"never considered for one second having anything to do with it. I detested it the moment it was raised. It's just disgusting. Bitcoin is noxious poison.\"\n\nThe price of U.CASH fell another 47% after the great weekly pump ended in disaster for some investors.\n\nU.CASH surged more than 100% in a day earlier this week thanks to a third-party pump.\n\nBut the price has now declined by more than 40% for three straight days.\n\nU.CASH represents an important reminder to remain cautious about investing in a cryptocurrency that surges without a reasonable catalyst.\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "Reality TV star and socialite Kylie Jenner wiped $1.3bn (£900m) off the stock market value of Snap, the software company behind Snapchat, with a single tweet last night.\n\nThe social messaging app, already reeling from the negative reaction to a recent update to its interface, now finds itself struggling to regain momentum after the star's criticism was retweeted more than 60,000 times (and counting).\n\nBut Jenner is only one of several celebrities whose interventions have shaken the markets.\n\nKylie Jenner\n\nThe Kardashian sibling's tweet, which reached 24.5m followers and caused a 7 per cent drop in Snapchat's value, \"underlines the fragility of social networking platforms from a corporate finance perspective\", according to John Illsley, director at accountancy firm Moore Stephens.\n\nNew platforms like Snapchat are more vulnerable to challenges from influential opposition voices as they lack the loyalty cultivated over time enjoyed by more established brands, according to Illsley.\n\nWhether Jenner's tweet represents a temporary blip for Snapchat or has done more lasting damage to its value remains to be seen.\n\nDonald Trump\n\nThe US President has often exploited his social media influence to rattle corporations.\n\nOne of the most notable examples was an attack on Boeing in December 2016, arguing that \"costs are out of control\" on the aircraft manufacturer's proposed new Air Force One commission, a 747 being built for $4bn (£2.9bn). \"Cancel order!\" he typed, sending stock tumbling by almost $2 (£1.43) a share.\n\nTrump followed this by attacking Lockheed Martin over the expense of its F-35 fighter jet programme for the US Air Force.\n\nThis in turn caused shares to fall by more than five per cent and shaved $3.5bn (£2.5bn) from the aerospace giant's market value before it recovered.\n\nIn January 2017, he did the same to Toyota, wiping $1.2bn (£859m) from the Japanese carmarker's value after he expressed his opposition to the company's proposed relocation of its manufacturing operations from the US to Mexico.\n\nTrump also used his account to criticise luxury department store Nordstrom in February 2017 for declining to carry his daughter Ivanka's clothing line - an \"outrageous\" abuse of his office for business purposes, according to former Barack Obama ethics adviser Norm Eisen.\n\nNordstrom's stock dropped a full 1 per cent in value - 23p a share - within a minute of Trump's tweet before recovering moments later.\n\nOprah Winfrey Oprah Winfrey accepts the 2018 Cecil B. DeMille Award during the 75th Annual Golden Globe Awards (Paul Drinkwater/NBC Universal/Getty)\n\nThe beloved chat show host and actress sent Weight Watchers stock soaring 14 per cent last month after she gave an inspirational speech at the Golden Globes that went viral.\n\nShares in the weight loss company - in which Oprah owns a 10 per cent stake - achieved a top price of $53.60 (£38.30) apiece as a result of the address, which was so impressive it led many to speculate on whether a future presidential run might be in the pipeline.\n\nMichelle Obama\n\nThe former US First Lady also benefited a major brand when she went viral. Mrs Obama wore an £8,575 Versace rose gold gown to a White House State Dinner in October 2016 with then-Italian PM Matteo Renzi.\n\nWall Street saw an immediate rise in the company's share value and dubbed her \"mark-up Michelle\" in tribute.\n\nJohn McAfee\n\nThe eccentric anti-virus software mogul has recently taken to addressing his Twitter followers on the benefits of \"altcoins\" - minor cryptocurrencies smaller than Bitcoin traded on wildly volatile markets.\n\nOn 15 December, McAfee tweeted that a new altcoin called SAFEX constituted \"the majority of my holdings\", implying it was a sound investment for others to follow.\n\nMoments later the price of SAFEX shot up by 92 per cent, according to CoinMarketCap, before settling down.\n\nBusiness picture of the day 7 show all Business picture of the day 1/7\n\nTrinity Mirror, which owns the Daily Mirror, is set to incorporate the parent company of the Daily Express, Sunday Express and the Daily Star. Trinity Mirror stated on Friday that it was buying all of Richard Desmond's Northern & Shell's publishing assets for £126.7m.\n\nGetty Images\n\n2/7\n\nAmazon's new Seattle headquarters mimics a greenhouse, with 40,000 different plants aimed at boosting workers productivity\n\nREUTERS\n\n3/7\n\nSamsung heir Jay Y Lee was freed from jail on Monday. He was convicted for corruption and embezzlement with South Korea's former president in 2017.\n\n4/7\n\nThe total number of electric buses in service is forecast to more than triple, from 386,000 last year to about 1.2 million in 2025, equal to about 47 per cent of the worldwide city bus fleet, according to a report from Bloomberg New Energy Finance\n\n5/7\n\nAldi has removed thousands of kilos of vegetables after a customer complained that she had found part of a rat in one bag of frozen mixed greens. It came after Aldi customer Pat Batemen complained to the budget supermarket chain and was offered £30 compensation, a figure she said was later increased to £500.\n\n6/7\n\nCoronation Street is set to get its own Co-op supermarket and Costa Coffee branch in a landmark deal that will see shop fronts appearing on a show as product placements. Viewers of the ITV soap will see both stores open on the street this spring. Co-op's and Costa Coffee's facades will be seen on the show, alongside branded posters, bags and cups used by Coronation Street characters.\n\n7/7\n\nJohn Lewis, M&S, Next, Debenhams and Sainsbury's are all yet to add their names to a list of brands binding themselves to Bangladesh's latest laws on fire and building safety. The renewed agreement will see greater investment in health and safety checks come into effect this year as the original 2013 agreement is due to expire in May.\n\nREUTERS\n\nHe repeated the trick a week later promoting a different altcoin named Electroneum, its price spiking 57 per cent, and has since done the same for BURST, Digibyte and others.\n\nInterestingly, only two - Humaniq and Factom - have failed to climb back up to their McAfee-inspired peak following the inevitable post-recommendation slump, according to Motherboard.\n\nPerhaps getting in on the act, pop star Katy Perry recently posted pictures of her fingernails painted with cryptocurrency logos on Instagram.\n\nWhether this is a precursor to a McAfee-style promotional onslaught remains unclear, but Perry is the most followed person on Twitter and could certainly be an altcoin influencer if she chose to weaponise her fan base.\n\nMore about: Kylie Jenner Snapchat Stock Markets Donald Trump Oprah Winfrey Michelle Obama John McAfee Reuse content", "Cryptocurrency enthusiasts are reacting to news that Bank of America Corp. (NYSE: BAC) now sees the digital currency space as a threat to its business.\n\nIn its annual 10-K filing, released yesterday, the nation's largest bank by deposits listed cryptocurrencies as a risk factor.\n\nThe bank said crypto could affect its profitability and revenue levels in the future.\n\nWhile this isn't seen as a panic signal, it is a notable event for a company of its size. It shows that Bitcoin and other cryptocurrencies are being taken more seriously.\n\nBelow is a recap of the top cryptocurrency prices at 2:30 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Friday, the market capitalization of the global cryptocurrency sector hit $451.14 billion.\n\nBitcoin represented 38.6% of the total cryptocurrency market, with a market capitalization of $174.4 billion.\n\nThe best performers from the top 50 largest cryptocurrencies by market capitalization included Nano (up 44.34%), Ethereum Classic (up 13.91%), IOTA (up 10.35%), VeChain (up 10.32%), 0x (up 8.11%), Litecoin (up 7.61%), and Ripple (up 7.50%).\n\nThe worst performers from the top 100 largest cryptocurrencies by market capitalization were Emercoin (down -4.01%), Dentacoin (down -2.94%), Kin (down -0.60%), and Veritaseum (down -0.60%).\n\nTwo U.S. senators have spoken out against Venezuela's latest efforts to skirt economic sanctions.\n\nSen. Bob Menendez (D-NJ) and Sen. Marco Rubio (R-FL) co-wrote a letter to the U.S. Treasury Department asking the agency to monitor cryptocurrency developments in the country.\n\nYesterday, Venezuelan President Nicolas Maduro said his government raised more than $1 billion over two days. However, those claims have gone largely unconfirmed.\n\nThe Petro is allegedly backed by the nation's large oil reserves.\n\nMust Read: What's the Best Cryptocurrency to Buy in 2018?\n\nHowever, it's hard to take the leadership at their word, given the fact that Venezuela is suffering from hyperinflation, and its energy sector remains in disarray.\n\nDespite the controversy, Maduro wants to add another virtual currency into the mix...\n\nHe wants to create a new currency backed by the nation's gold reserves (do they even exist?) called \"Petro Gold.\"\n\nThe news has both Iran and Turkey considering their own cryptocurrencies.\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "Nick Szabo, Zooko Wilcox and Paul Frazee talk about the goals and challenges of the next generation of the internet.\n\nAllowing the internet to be controlled by a few mammoth businesses is anathema to its original vision. We may one day look back on this as a period of great centralisation of the web; the advent of revolutionary technologies like BitTorrent and Bitcoin have really kickstarted the restructuring process.\n\nThe next generation of the internet is sometimes referred to as \"Web 3.0\". Given the current obsession with cryptocurrency price movements and bubbles, we are starting to see more discerning commentators in the mainstream media shift their focus on to the progress of this new decentralised web architecture.\n\nTo make a decentralised architecture function well involves solving a group of extremely tough computer science problems. The computer scientist and legal scholar Nick Szabo reminds us that just about all IT these days is very insecure, therefore we should be careful about buzzwords which relate back to something that's fundamentally flawed.\n\nSzabo told IBTimes UK: \"The label 'web 3' suggests bringing over the careless, security-poor programming habits of the web. When crypto or smart contracts are programmed like a web page they are doomed. An economy with crypto and smart contracts in it has to be based on more secure, more careful programming.\"\n\nSzabo designed a mechanism for a decentralised digital currency called \"bit gold\", back in 1998. The design featured proof of work in the form of cryptographic puzzles and a Byzantine-replicated chain of transactions. Many of these ideas were later tested in the field by Satoshi Nakamoto's Bitcoin plan with its powerful incentive to market scheme.\n\nHe added: \"A crypto-enabled future has to happen on a secure base, and the web doesn't provide such a secure platform, as we've seen with the hacking of many web-based exchanges.\n\n\"So the crypto future has to start with public blockchains, and, for holding keys to the assets and smart contracts on those blockchains, hardware wallets and similar techniques.\n\n\"In addition 'layer 2s' on top of blockchains such as Lightning, Sprite, or Raiden will be important for enabling smaller value transactions: as public blockchains grow in use they will transition to high-fee, high-value transactions (as we've seen already happen with Bitcoin) and layer 2 (or as I call them, peripheral networks) will be needed to pay for the coffee and pizza,\" said Szabo.\n\nAnother pioneer of decentralisation technology is the co-founder of the Zcash cryptocurrency, Zooko Wilcox-O'Hearn. His work on the Tahoe-LAFS cryptographic, distributed file store is credited as an influence on Beaker Browser (through the Dat protocol), IPFS, and Ethereum.\n\nAsked what he thinks is most broken about the web today, Zooko said: \"So much is wrong, I could go on for hours. The lack of encryption around our personal information, communications, businesses, finances, and systems tied to critical infrastructure is unacceptable.\n\n\"Zcash is a blockchain, a currency for exchange of value, but at our core we are a science driven organisation that works on very hard, very advanced encryption that could do the world a lot of good - we hope more people, businesses and governments take note of what we have accomplished thus far and how they could use it to protect people better.\"\n\nRegarding \"Web 3.0\", Wilcox-O'Hearn says he doesn't a consistent vision yet. There are too many new ideas sprouting up it's hard to tell which ones are really going to produce useful results. Unpacking the term itself, he said Web 3.0 contains at least two separable concepts, and it would be helpful to consider them separately:\n\nFirst, a World Wide Web with decentralised storage, computation, and communication. \"This is an interesting technology, and worth exploring, but it is by no means guaranteed to be successful. Also, it might have little use for blockchain. One particularly promising project in this area is Beaker Browser, which doesn't use a blockchain for anything.\n\n\"Beaker Browser is probably not as well-known within the cryptocurrency/blockchain industry for the simple reason that, not using a blockchain, it misses out on some opportunities for hype and funding. But, perhaps a future, viable decentralised Web architecture uses blockchain for nothing but payments and domain names.\"\n\nThe second concept, said Zooko, is a World Wide Web built on new economics. \"The problems of today's Web aren't accidents, and they aren't caused by the limitations of insufficient technology. They're the way they are because that's the most profitable way to be. To fix it, we have to provide a more profitable way to be.\n\n\"Cryptocurrencies, smart contracts, and tokens might help, or they might be just the first pass idea which fails but which shows the way to the real answer. In light of this, one of the project that interests me the most is Brave / Basic Attention Token. Notice that fixing the economics of the web might not require decentralising the storage, computation, and communication,\" he said.\n\nBeaker Browser's founder Paul Frazee uses the term \"peer-to-peer web\" which he defines as \"an experimental technology that runs websites and applications on people's computers instead of relying on servers. The goal of that technology is to give people control over the web instead of relying on large businesses to run their services\".\n\nFrazee, who has been known to call himself an \"Unblockchain consultant\", said: \"The original vision of the web was that anybody could create and own their website. It was creative and diverse. Now, all that power to create is on other people's servers.\"\n\n\"So we want to try to invert that relationship - to one where the source code and the data live on people's own computers. Then folks can just transact with each other directly, as opposed to having to go through these third parties.\"\n\nIn terms of new technology to look out for, Frazee said he was quite surprised how much interesting stuff coming is coming out of standards bodies right now. \"There's the Solid project, which is headed by Tim Berners-Lee; there's the WC3 social working group had been working on something called Activity Pub, and I think they're doing good work there.\n\n\"And the Secure Scuttlebut community is still a really great and thriving underground community; a lot of really good ideas come out of there.\"\n\nA newer set of decentralisation problems to form around blockchains is how their consensus algorithms operate. Bitcoin's Proof-of-Work system requires an army of specially optimised computers to burn through a ton of electricity to ensure the system is secure. Many people think this is unsustainable, and another system, Proof-of-Stake, is being developed. This is really a crypto-economic system with participants holding deposits, or a stake in the network, which means they can be punished as well as rewarded.\n\nZcash uses Proof-of-Work mining and like Ethereum's current PoW mining, this algorithm involves the use of memory on the chips, which means it's resistant to the sort of ASIC chip optimisation that has happened in Bitcoin.\n\nZooko said: \"We're watching carefully to see how Ethereum fares in their attempt to switch to Proof-of-Stake, for one thing, as well as researching other mining algorithms.\n\n\"However, any change to Zcash's mining algorithm would require group decision-making and a whole lot of coordination, because the Zcash network is so widespread and integrated into so many diverse use cases and cultures.\n\n\"If a subset of the use cases chose to switch to the new mining algorithm and another subset chose not to, then it would result in a cryptocurrency fork, unless one of the two use-case-groups was too small to be self-sustaining, in which case it would result in just a normal, hard-forking network upgrade.\n\nThe Zcash Foundation wants to be a conduit through which the community can collectively decide and coordinate such things.\n\nZooko added: \"However, I don't accept the common statements about Proof-of-Work mining such as that it is bad for the environment.\n\n\"Most of the public conversations I've seen about the social costs of Proof-of-Work mining are confused because they assume that all energy usage is a negative externality i.e. when someone uses electricity, then that makes us all a little worse off.\n\n\"In fact that's not true in general, and in particular Proof-of-Work mining may be a good fit for solar and wind energy, which is (as of last year) cheaper than coal and natural gas to supply when available (i.e. when the sun shines or the wind blows), but more expensive than coal or natural gas to supply on demand (i.e. when a consumer turns on their microwave).\n\n\"Since Proof-of-Work mining can be a profitable energy sink for those times that the sun is shining but the consumers aren't microwaving their meals, it may cause it to become profitable to build large-scale solar and wind farms which otherwise would never have been built,\" he said.\n\nSzabo was unequivocal about mining algorithms: \"I think Proof-of-Stake is fundamentally less secure than Proof-of-Work, and not suitable as a global store of wealth or for settlement of high-value transactions.\"\n\nAs far as interesting new technologies that might have an impact in the future, he added: \"I think DAGchains have some good potential, although the implementations I've seen so far have been very underwhelming.\"", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nLisk, which jumped 65% after listing on bitFlyer on Wednesday, posted a 20% boost yesterday after Huobi.pro also listed the altcoin. Lisk has clearly benefited after securing two exchange listings in one week.\n\nWhile Wednesday, Jan. 31, was brutal for the cryptocurrency markets, as bitcoin's price fell below $10,000 and the cryptocurrency market cap entered sub-$500 million territory for the first time since Jan. 17, Lisk soared. Shortly before 6:00 UTC Wednesday, the Lisk price was trading at roughly $21.50 on Bittrex. Within the span of 25 minutes, the Lisk price was valued at $36.27, which represented an increase of more than 65%.\n\nThe price soon dropped back below $30, but it continued to trade well above its previous level.\n\nYesterday, Feb. 2, Lisk announced its listing on the Huobi.pro exchange, allowing LSK token holders to trade against BTC and ETH. Shortly after the Huobi listing was announced, the price shot back up from $16.08 to $23.42, according to coinmarketcap.com.\n\n\"Today's announcement caps a very successful week for Lisk, following Wednesday's debut of our LSK token on the bitFlyer exchange,\" said Max Kordek, Lisk founder and CEO, in a prepared statement. \"The addition of LSK to the Huobi.pro exchange elevates the status of our platform as we approach our relaunch event on Feb. 20 in Berlin, and strengthens our ambition to be the enablers of innovation, making blockchain technology more accessible to everyone.\"\n\n\"This move underscores the strong confidence and belief in our platform and we are excited to extend our reach to millions of global traders through the Huobi.pro exchange,\" Kordek added. \"We look forward to growing our community, allowing developers and entrepreneurs to tap into the tremendous power of blockchain technology, ushering in a new era of innovation.\"\n\nThe listing on bitFlyer was notable -- and unexpected -- since the exchange previously only supported five altcoins: Ethereum, Ethereum Classic, Bitcoin Cash, Litecoin, and Monacoin.\n\nAlso read: Lisk price spikes 65% on bitFlyer listing\n\nLisk's price first emerged from the low single-digit range in August and has been progressing into the high teens and $20-plus range.\n\nLisk is a blockchain application platform that stores decentralized applications in sidechains, as opposed to a main blockchain like Ethereum, allowing users to develop applications from scratch using the mainstream language of JavaScript.\n\nThe decentralized platform allows for the deployment, distribution, and monetization of sidechains on the Lisk blockchain. The Lisk network is operated using a delegated Proof-of-Stake consensus model, secured by democratically-elected delegates.", "Scott Weiss bought bitcoin when it peaked at over $19,000 in December. Just days later the cryptocurrency began a lurch lower that left it languishing below $6,000 at the start of this month and many declaring the bubble had burst. The 48-year-old lawyer from Arizona insists he is unfazed.\n\n\"I feel the exact same about my crypto investments at a $20k price as I did about it at a $6,500 price,\" he says. \"I am a long-term holder and believe bitcoin will survive this turbulence.\"\n\nBitcoin's surge from less than $1,000 at the start of last year to almost $20,000 by its end drew a chorus of warnings from regulators, saw attempts by Wall Street institutions to muscle in on the financial frenzy and prompted publicly traded companies to shamelessly ride the wave to quick riches by incorporating crypto or blockchain into their names.\n\nAlmost two months since the bitcoin price touched a record high, the return of volatility to the US stock market has overshadowed the fact that the controversial cryptocurrency has hauled itself off the floor and is now trading at $10,000.\n\nFor Mr Weiss, who has attended cryptocurrency legal seminars, read books, and annoyed his wife with night-time YouTube binges about trading, its bounce offers something of a vindication. \"This recent rise in price is validating for sure,\" he says, \"and I am confident it will continue (with intermittent crashes along the way).\"\n\nThe bitcoin price has raced up only to crash before, notably in 2013 when it soared from $12 to $1,000, before losing more than half that gain. Mr Weiss's apparent serenity comes, he says, from his confidence that blockchain, the distributed ledger technology underlying bitcoin, represents an important innovation. Companies in industries from finance to shipping say they are testing out blockchain.\n\nThe connection between a sweeping technological change and financial speculation is common, explains Christian Catalini, founder of MIT's Cryptoeconomics Lab. \"It's not unusual for periods of speculation to be driven by technological change,\" he says, pointing to the dotcom boom.\n\nWhile conviction that blockchain will ultimately deserve a chapter in the history of technological innovation stiffens the resolve of some who have put money into bitcoin, the mania of the last two months has also provided painful lessons.\n\nFor example Coinbase, America's biggest and best-known cryptocurrency exchange, has infuriated scores of customers because of system issues that have affected the speed at which money is withdrawn from the exchange, according to interviews with users and complaints made to regulators in Washington and Texas seen by the Financial Times.\n\nIn June, a Seattle photographer wrote to the attorney-general in Washington to claim \"I've effectively been robbed\" by Coinbase, because he had some $40,000 locked up in his account that he could not access. Coinbase's dispute resolution team responded to the Washington AG, saying that the volume of orders in his account meant an identity verification was required, and that once it was complete, the restrictions on his account were removed.\n\nCoinbase has vowed to improve its customer services and last month hired an ex-Twitter executive to bolster its efforts.\n\nAlthough the wild swings in bitcoin have enticed established high-frequency trading firms starved, until recently, of volatility in financial markets, they have been exacerbated by a lack of trading infrastructure that experts say makes crypto trading more dangerous for retail investors.\n\n\"There is by definition very little transparency in this market,\" cautions Luigi Zingales, finance professor at Chicago Booth School of Business, \"and a very small volume can change and affect the prices.\"\n\nIn contrast to retail investors who speculate on stocks -- and have fundamental reference points such as cash flows and earnings -- the trading of bitcoin and cryptocurrencies happens in something close to an information vacuum. Mr Weiss admits that information is scarce. \"To get the most cutting-edge information you have to be on a Reddit page or listen in to the conversation of people who are involved.\"\n\nOnline chat forums have become echo chambers where coin evangelists cheer each other on and deride rival tokens. That dearth of information leads people to \"look for social proof\" and encourages \"herding behaviour\", says Marina Niessner, assistant professor of finance at the Yale School of Management.\n\n\"If these people, even if it's a bot, reflects back what you've been thinking, then people will follow,\" she says.\n\nAnd an explosion in the issuance of alternative coins, driven by entrepreneurs using a barely regulated crowdfunding fundraising mechanism called initial coin offerings to fund their projects, has given those who are tempted a large crypto universe to pick from.\n\nThe alternative-coin markets are prone to misinformation and market manipulation, with news circulating online, true or fake, affecting prices. A viral hoax on messaging board 4Chan for example, falsely reporting the death of the ethereum cryptocurrency's inventor, wiped some $4bn off ethereum's market value last June.\n\nCryptocurrency markets were so febrile by late last year that some longer-term investors backed off. Spencer Bogart, a partner at San Francisco-based Blockchain Capital, a venture capital firm founded in 2013, described the market conditions as \"alarming\". Mr Bogart spotted a \"unit bias\" -- coins priced below $1 were proving popular with buyers, regardless of their investment potential.\n\nTake Dentacoin, a token planned to help provide dental services on a blockchain. Dentacoins are worth a fraction of a cent, but on January 8 the market capitalisation of their circulating supply was briefly over $2bn (it's now $288m). Such Dentacoin buyers were an \"indication that the investment sophistication in broader crypto markets had reached dangerously low levels\", says Mr Bogart.\n\nBut despite a fresh blitz of regulatory warnings this year, including from France's financial watchdog this week, there are indications that it may soon be easier to buy and sell bitcoin. Robinhood, a brokerage start-up which allows retail investors to trade stocks cheaply, announced in January that it would allow its customers to trade bitcoin and ethereum.\n\nThat is likely to only add to the speculation, raising the prospect of further wild swings in crypto land. None of which matters for those retail investors who say they are in bitcoin for the long term.\n\n\"I tend to invest in fundamentals rather than price,\" says Arianna Simpson, who has worked in sales and marketing at tech companies including Facebook and first bought cryptocurrencies five years ago. \"I'm relatively unfazed by the price fluctuations, and I still think bitcoin has a lot of room to grow from where we are now.\"", "Bitcoin prices today slumped more than 10% on Wednesday as traders appear to be taking some profits off the table after the price of Bitcoin has surged more than 100% from its recent lows.\n\nMarkets have roared in recent days thanks to more crypto-friendly policies across the globe. In addition to Wyoming's decision on Monday to relax securities laws in the crypto space, it also appears that South Korea won't ban Bitcoin anytime soon.\n\nMeanwhile, Litecoin prices pulled back nearly 14%. The fifth-largest cryptocurrency by market capitalization has enjoyed a significant amount of attention due to the spin-off of Litecoin Cash and LitePay, but that wasn't enough today to help prices climb today.\n\nBelow is a recap of the top cryptocurrency prices at 3:30 p.m. EST...\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Wednesday, the market capitalization of the global cryptocurrency sector hit $454.4 billion.\n\nBitcoin represented 35.8% of the total cryptocurrency market with a market capitalization of $178.4 billion.\n\nThe best performers from the top 100 largest cryptocurrencies by market capitalization included DigitDAO (up 14.58%) and Dent (up 14.48%).\n\nThese were the only two cryptocurrencies that had positive gains on the day.\n\nThe worst performers from the top 100 largest cryptocurrencies by market capitalization included ZClassic (down -24.13%), Lisk (down -22.13%), Byteball Bytes (down -21.06%), RChain (down -18.29%), ZCoin (down -17.72%), IOSToken (down -17.60%), Golem (down -16.89%), Bitcore (down -16.89%), and FunFair (down -16.64%).\n\nIn positive Bitcoin news, two large cryptocurrency exchanges announced they have implemented SegWit for transactions.\n\nCoinbase announced on Tuesday that it will start rolling out SegWit this week. Meanwhile, Bitfinex said it has also implemented the update.\n\n\"By supporting SegWit addresses, Bitfinex is tackling three of the biggest crypto-enthusiast concerns: transaction fees, transaction speed, and total network capacity,\" said Bitfinex CTO Paolo Ardoino in a post on Medium.com.\n\nRipple may have declined by more than 10% today, but its client base continues to expand at an impressive level.\n\nAccording to CoinDesk.com, the company added two international banks and three international remittance firms as clients.\n\nMust Read: This Litecoin Price Prediction Shows a $280 Target by March 1, 2018\n\nThe new clients span four nations and will continue to provide Ripple with much needed publicity for its growing user base.\n\nOn a day that Bitcoin lost double digits, most of the cryptocurrency world was abuzz about Venezuela's new coin called the \"petro.\"\n\nThe nation's dictator, Nicolas Maduro, said that the nation received $735 million through the pre-sale of the petro in its first day. The goal of the energy-backed cryptocurrency is to bypass U.S. sanctions as Venezuela's fiat currency continues to plunge.\n\nBacked by the nation's oil reserves (although who is really trusting this regime), the cryptocurrency will have 100 million petros in circulation.\n\nDespite Maduro's claim of $735 million raised, many journalists and cryptocurrency enthusiasts are doubting his estimate.\n\nIn fact, many native Venezuelans have taken to social media to express their concern about the viability of this new cryptocurrency.\n\nMarialbert Barrios, a National Assembly deputy and anti-Maduro advocate, wrote: \"Who in their right mind buys a [cryptocurrency] from a government that does not pay the foreign debt, with an economy in hyperinflation?\"\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "What was reported was that the Big Banks have crapped down on Bitcoin, 100% fake news. What really happened was banks stopped allowing people to buy the cryptocurrencies on Credit predominantly because of charge backs.\n\nWhat has been happening 1000s of times a day is people would buy Bitcoin, the price would fall and they would try to claim back the charge on their card. The other issue was rampant Credit Card Fraud. The move by the banks in no way represents a negative view on cryptocurrencies.\n\nBitcoin, Ethereum, Ripple are volatile but will remain part of the financial landscape for a long time to come. Regulation and management are the key factors.\n\nThe recent crash of bitcoin and other cryptocurrencies was caused by an absence of regulation, one expert told RT. Given digital money doesn't have intrinsic value, its price against fiat money doesn't bear logical explanation.\n\n\"For example, the price of shares is the actual value of the company and its profitability. The price of oil and gold cannot be physically lower than the cost of mining them as minerals,\" Teletrade financial consultant Mikhail Grachev said in an interview with RT.\n\nTransactions with bitcoin and other cryptocurrencies are no longer available for 8 million credit card users of Lloyds Banking Group, which unites Lloyds Bank, Bank of Scotland, Halifax and MBNA.\n\nThe ban will not apply to debit cards, only to credit cards issued by the group.\n\n\"Across Lloyds Bank, Bank of Scotland, Halifax and MBNA, we do not accept credit card transactions involving the purchase of cryptocurrencies,\" said a company spokeswoman. The decision was made to \"protect customers,\" Lloyds said.\n\nLloyds' move follows bans at the weekend from American banks JP Morgan Chase, Bank of America and Citigroup.\n\nThe ban comes as holders of bitcoin and other cryptocurrencies continue to suffer a steep plunge in the value of their holdings. Lloyds said it fears that credit card owners will buy cryptocurrencies in the hopes of making a profit, but will have to repay the debt when the price falls.\n\nBritish Prime Minister Theresa May has said the UK should look \"very seriously\" at digital currencies as they can be used by criminals.\n\nBitcoin has again fallen to a new low of $7,631, trading 12.5 percent lower on Monday. It is now 60 percent below its record high of $20,000 reached in December. All but two of the top 100 cryptocurrencies on Coinmarketcap's list were down at 10:30 GMT, with some losing as much as 24 percent of their value. The exceptions are #64 bitcore (4 percent growth) and #83 xplay (43 percent growth).\n\nTransparent Exchanges are the Future of Bitcoin\n\nTax evasion and money laundering are not going to be accepted by Governments around the world and the true future of Cryptocurrency is not dependent on criminals and money launderers, some crypto houses like G-BiT have seen the writing on the wall and build a system that is compliant with international Anti Money Laundering and Tax Laws.\n\nThere is no doubt some CryptoCurrencies with fail, some will be scams, and some will live on to change the very nature of money and wealth, no wonder the old dudes are scared.\n\nCryptoCurrencies is not about Tax Evasion or Money Laundering, real hardcore fundamental CryptoCurrency Exchanges like G-BiT have seriously tackled the Money Laundering and Tax issues, that's why they have such a bright future. While the Establishment still wants you to be hit with heavy fees and delays sending money around the world the reality is that is legalized theft built in to the Banking Sector and is not a product of cost or reality, CryptoCurrencies have proven that!\n\nDominant digital currency bitcoin should not be allowed to become the Swiss bank account of the modern era used to hide illicit activity, Treasury Secretary Steven Mnuchin said Friday.\n\nBenjamin Roberts, co-founder and CEO of Citizen Hex, an ethereum-focused start-up backed by three Canadian venture funds, attributed the sell-off to uncertainty around bitcoin's ability to improve transaction efficiency and the future development of ethereum.\n\nHe expects ethereum to become the dominant cryptocurrency this year. \"We'll continue to see volatility measured in dollars until [ethereum] has significantly topped the bitcoin platform in terms of market cap,\" Roberts was cited as saying by CNBC.", "There is another area on the market - less known, but not less profitable: emerging crypto assets that are not yet listed on major exchanges for some reason.\n\nFollowing a long-term autumn bearish trend on altcoins, cryptocurrency market was surging like crazy at the end of the last year. A good number of altcoins skyrocketed in just two to three weeks. For instance, Ripple (XRP), Stellar (XLM), Verge (XVG), Cardano (ADA) and many others grew in price by five to 10 times with the record-setters, such as Tron (TRX) and Verge - by 20-30 times respectively. Many altcoins proved to be growing pretty stable: such major players as Ethereum (ETH) with a huge capitalization also increased immensely. It should be noted that the increase in prices has been going with a relatively stable BTC price, which means that all the generated profits are nominated not only in US dollars but also in BTC.\n\nHence, by investing a minimum of one BTC in XVG at the price of 50 Satoshi in early December, an investor could sell it at the price of 1,500 Satoshis with the 30-times return on investment within just two weeks. To make a good investment in these coins, all you needed to do was to be registered at three major cryptocurrency exchanges, such as Bitfinex, Bittrex, Binance. There you can also monitor listings of new coins that might turn out to be generating substantial profit once the demand for them grows in the longer run.\n\nUnknown heroes\n\nHowever, there is another area on the market that is less known, but that could be not less profitable: emerging crypto assets that are not yet listed on major exchanges for some reason. And this is not surprising, as being listed on a major exchange is rather time and effort-consuming for any startup project. This mainly has to do with hundreds of applications that exchanges receive every day, but cannot process instantly, because first, they have to check all the technical specs of a new coin and its real demand on the market. Each new coin that is to be listed would either draw back the liquidity from other traded pairs or become a dead-weight and delude the traders damaging the exchange's reputation at the same time. A lot of instances of this can be observed at hitBTC listed pairs overview.\n\nThat is why a great number of really valuable up-and-coming crypto assets with good chances of growth are starting at minor exchanges, where the conditions to be listed are much less strict. It is there that these coins are making the first sparkles and then increase in price several times more once they get to a big exchange, like Bittrex. These are assets that - if managed correctly from the start - could make the investor very rich.\n\nLittle five\n\nLet's look into five new assets that, if invested in December 2017, would have generated an amazing profit for the investor and maybe can generate even more in the nearest future.\n\nOnly the assets with the trade volumes no less than $1 mln were taken into consideration. All the \"shit coins\" that are growing at pump and dump schemes were filtered. Assets that are traded at major exchanges as Bitfinex, Bittrex, Poloniex, Binance were not taken into consideration either.\n\nAll mentioned crypto assets (or \"coins\") have been selected by the following criteria:\n\nTechnology and demand from crypto or other industry (=probably high demand in future)Trading on a small exchange (=low price may be a result that not many people have access to trading these assets. Thus, demand is low at the moment, but can significantly increase after releasing partnership and listing at major exchange)Low initial price (=probable undervaluation, taking into account previous criteria)\n\nRaiBlocks (XRB) is a coin, built on DAG-technology along with well-known IOTA, focusing on fast microtransactions. One of the important points why coin was picked is demand for DAG technology in industry and a broad market for future implementation.\n\nDent (DENT) is used for sharing prepaid packages of mobile data. According to Cisco review, 15 percent of mobile data is unused and this is the market of 4.8 bln dollars. User cases are as follows: sharing unused data packages, avoid roaming, automated buying mobile data for IoT devices at best price. This concept is good for future demand on Dent token, so it was selected.\n\nIot Chain (ITC) is a coin of Chinese-based startup, providing high-scalable transactions for IoT industry. The project is based on high-scalable DAG version. IoT, in general, is a trend in the industry and a new high-qualified project is pretty interesting for an investment portfolio.\n\nDragonchain (DRGN) is a new Blockchain platform, designed by Disney. The platform is high-scalable, has huge functionality and can serve many fields of operation - smart contracts, identity, intellectual property, p2p financial instruments and many others. Also, the platform is building its own ecosystem with startup incubator. At the moment Look Lateral - an Italian project selling art with Blockchain rights fixation as well as LifeID (Blockchain-based identity) are making a product using Dragonchain. According to the top-tier company behind this project and technological functionality, this asset is surely a \"little coin, going big.\"\n\nXTRABYTES (XBY) is a platform for dApps, offering high-scalability and decentralization opportunities over current Blockchain technologies. The team created a new consensus method - Proof-of-Signature and algorithm Zolt. This project seems good and new-tech oriented, so possible high-demand for XBY coin may arise if XTRABYTES solution will be used widely.\n\nProfitability from holding these \"little coins\" was compared to buying and holding major crypto assets like ETH and XRP at the same time as demonstrated below. RaiBlocks demonstrated enormous price growth rate, giving 70 times increase on the investment; Dent provided 23 times capital growth. Other little, but promising coins that were selected have comparable to XRP and significantly higher profit of investment in comparison to ETH.\n\nIt seems that these coins with good fundament and technology were unknown in the major part of the community and their price greatly increased when more investors receive information and massively buy this asset. Besides fundamental reasons of investment, many of them probably keep in mind that after listing on major exchange price will be rising even more, when very large community and big money will have direct access to trade this coins.\n\nAssets in crypto industry grow rapidly if there is a large influx of funds coming in from new investors with the simultaneous holding by earlier investors. There is a special name for that- \"HODL\". The price increase, in this case, is due to the constantly increasing demand together with the shrinking amount in circulation. After listing on a bigger exchange, like Bittrex or Binance, the demand is growing massively, which increases the price even further. For this reason, investors would monitor new coins introduced to smaller exchanges, because these assets are seriously underestimated due to the lack of the audience and low trade volume. But constant monitoring can be rather tedious and requires having multiple accounts, which is time-consuming. On the other hand, potentially attractive coins don't get a decent audience, because investors would rather prefer to purchase a new asset once it is listed on some bigger exchange. That results in a huge price increase and high volatility: massive funds are injected to the coin instantly at its purchase.\n\nHow to facilitate access to new assets\n\nTherefore, one of the current issues of the market should be facilitating the access to new assets for investors. On the one hand, it will make easier for new users to start investing into crypto assets, and on the other hand, would bring the audience and liquidity to new coins. This is possible only by means of integrating all exchanges into one technical and visual interface that would allow trading multiple cryptocurrency pairs in one terminal at single-click ease. Once deployed, this would bring about another perk for both traders and new coins: traders would be able to start buying the coin from the date it was listed at any of the exchanges that are part of this integrated network, while the coin gets more extended and organic timeline growth.\n\nThe problem has already been tackled by several teams. One of them is B2BX that ran a successful ICO in late 2017. They plan to make first official B2B cryptocurrency exchange aggregator or marketplace to connect institutional clients, forex/DMA and stockbrokers with cryptocurrency exchanges. So, when the B2BX product is to be delivered on the market, cryptocurrency exchanges could receive more liquidity. The project is targeting brokerage houses, liquidity providers and institutional investors, the majority of the traders will have access to the market via their forex or stockbrokers.\n\nAnother startup that proved to be pretty successful is Arbidex- the platform that integrates crypto exchanges into one single interface with the built-in mechanism for automated arbitrage. The Arbidex team claims that integration of cryptocurrency exchanges together with the additional functionality as automated arbitrage system will provide more liquidity to trading pairs and eliminate borders between exchanges. Using only one Arbidex account customer can buy and sell crypto assets and coins at all exchanges connected. So, added new trading pairs on major exchanges like Binance or small like Livecoin automatically are in availability to trade for all Arbidex users. Actually, they offer a breakthrough high-end trading terminal for traders, integrating orderbooks and trading pairs from multiple exchanges with an opportunity to make some extra profit.\n\nThe third solution could be seen in a Japanese project Liquid, which is operating under Quinone Corporation (has an exchange license from Japan authority). One of the project goals is to provide liquidity for cryptocurrency exchange market and to create worldwide order book.\n\nWhat to expect?\n\nThis year seems to bring more maturity to cryptocurrency exchange market. Hopefully we will see the introduction of market brokerage platforms and services with trading tools such as professional trading terminals, analytics and possibility to buy and sell the majority of crypto assets in one window. What if 2018 is the year of little coins becoming big?\n\nDisclaimer: All information about coins is not investment advice.", "Unsplash is rethinking the way photography gets distributed and monetized, and today it's announcing a $7.25 million Series A to fund those efforts.\n\nThe site actually started as a side project for freelance marketplace Crew, but eventually the founders decided to focus on Unsplash and sold Crew to Dribbble.\n\nWhile the Unsplash photo library contains only 400,000 photos (compared to the 150 million on Shutterstock), CEO Mikael Cho explained that he's deliberately taken a more curated approach. Whenever someone tries to upload a photo, there's an automatic check to ensure that it's high resolution and not posted elsewhere online, plus, \"We have a curation team ... A person sees every photo that is coming through.\"\n\nCho also said that Unsplash puts a big emphasis on distribution, something that's boosted by integrations with products like Google Slides, InVision and Medium. As a photo gets used more often, it gets ranked more highly in the platform, so Cho said there can be a \"reverse effect,\" where photos actually become more rather than less prominent over time.\n\nAnd it's hard to argue with the price: All of the photos on Unsplash are available under the same standard license, making them free for both commercial and noncommercial usage.\n\nAs a result, the company says it's had more than 48 billion photo views and 310 million photo downloads since launching in 2013, and it's currently seeing 10 photo downloads per second.\n\nThe lead investor on the Series A wasn't a traditional venture firm. Instead, Unsplash raised money from OST, the company behind the Simple Token project for simplifying the process of issuing branded tokens. According to a blog post by OST's Jason Goldberg (who was best known previously for leading Fab), his company's $5 million investment was 80 percent cash, 20 percent tokens.\n\n\"Unsplash and OST intend to tokenize and empower the Unsplash community with blockchain technology, while retaining the open, free-to-use principles that have led to Unsplash's massive growth,\" Goldberg wrote.\n\nCho argued that the traditional stock photography model has been coming under increasing pressure, leading to falling prices, a trend that will only continue as \"everybody is able to be a photographer.\" Meanwhile, the value to photographers of using Unsplash isn't direct payments, but \"downloads, attention and distribution.\"\n\nSo the startup will be working with OST/Simple Token to explore new ways to make money from photos. He said it's too soon to know exactly what that model will be, but it will involve blockchain technology and cryptocurrency -- in his view, they have \"a similar ethos\" as Unsplash, namely a philosophy of openness and decentralization.\n\nAccomplice, betaworks and Real Ventures also participated in the new round. Cho said he's still talking to potential investors, so the round size could eventually increase to $10 million.", "Fed up of standing by watching while others make and lose fortunes on cryptocurrencies? Now you too can make and lose a fortune!\n\nThis columnist realised it was time to tackle this topic when a news report said more than 1,500 Bitcoin-like cryptocurrencies had been launched and a reader asked me for advice on starting his own.\n\nEasy, I said. Whose head would you like to be on it? He chose his own, which showed me that he had no idea what a cryptocurrency was. They are not physical coins, so don't have anyone's heads on them.\n\nNever mind. Most people don't understand these things. This is good.\n\nThings you can sell to unsuspecting friends as Bitcoins: 1) game arcade tokens; 2) foreign coins; 3) toy medals; and 4) chocolate money.\n\nBut one of my more serious colleagues is starting his own cryptocurrency; so I know the system.\n\n1. Download the main coin mining software from a website called Github, then hire a nerd, as you have to tweak the programme (with C++) to make it unique.\n\n2. Think of a theme. It is impossible to be too wacky. For example, one person made a cryptocoin called \"Offerings to Cthulhu\", named after an alien from a 1928 sci-fi story. You'd think that was too silly to work, but it is going strong after several years.\n\n3. When people start buying your currency, sell them all and run away as fast as you can.\n\nIf the last part of this process reminds you of anything, it should. It is the same technique used by people working for criminal gangs (\"banks\") for pushing evil scams such as sales of stocks and shares, unit trusts, investment bonds, Ponzi schemes, etc.\n\nIt's an exciting field. In January this year, the value of Bitcoins was going up and down so fast (in a $10,000 range) that you had to discuss it with a live price tracker in your hand. Here's a typical conversation:\n\nME: \"I'll buy your car for one Bitcoin.\" HIM: \"No way! This car's worth more than... $9,845.\" ME: \"More than... $11,245? No, it isn't. That's a good price.\" HIM: \"Okay, you got a deal.\" ME: \"I'm now transferring to you one Bitcoin.\" HIM: \"Wait. This is only worth... $7,231.\" ME: \"Too late, Byeee.\" [Drives off.]\n\nBitcoin analysts say the number of new coin issues is accelerating so we'll each have our own currency in \"the mid-to-long-term future\", meaning a week next Tuesday. Shopping will be challenging.\n\nSHOPPER: \"Do you accept Flurgles?\" SHOPKEEPER: \"Yes, but your change will be in Oogliewooglies.\"\n\nWhat to call your coin? All the cool names have already been taken, including Mysterium, Einsteinium and BitBean. Others are odd, like the Melon, or desperately unimaginative, like the Namecoin.\n\nI reckon it's time to stand out and get attention by using an ironically humorous name for your new Bitcoin. Four suggestions: 1) SweetLittleNothings; 2) Don'tBuyThese; 3) Moneypits; and 4) IdiotTokens.\n\nOkay, hands up who'll buy an IdiotToken from me? And no, you can't pay me in cryptocoins. I want hard cash. I may be an idiot but I'm not stupid.", "The price of Bitcoin temporarily slumped under $10,000 Tuesday amid a much broader downturn in cryptocurrency prices. The downturn coincided with news that Facebook Inc. (Nasdaq: FB) had banned advertising tied to Bitcoin, cryptocurrencies, and the ICO space.\n\nFacebook says it is trying to protect its users from \"financial products and services frequently associated with misleading or deceptive promotional practices.\"\n\nIn more cryptocurrency news, the CFTC has reportedly subpoenaed exchange Bitfinix over a digital token that is linked to its financial backers. The U.S. agency sent two subpoenas in early December to the exchange and to the operators of Tether, a cryptocurrency that claims to be pegged to the U.S. dollar.\n\nThe issue is that while the firm says Tether is pegged to the greenback, the company has yet to actually prove it has roughly $2.3 billion of assets or receive an audit.\n\nMany skeptics have long questioned whether that money actually exists.\n\nBelow is a recap of the top cryptocurrency prices at 2:30 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Tuesday, the market capitalization of the global cryptocurrency sector hit $510.84 billion.\n\nBitcoin represented 33.7% of the total cryptocurrency market, with a market capitalization of $171.97 billion.\n\nIt was a bad day across the board in the sector. Only five of the top 100 cryptocurrencies by market capitalization were in the green today. They were Ingis (up 22.43%), Revain (up 20.83%), SIRIN Labs Token (up 16.67%), DigixDAO (up 1.55%), and Populous (up 0.28%).\n\nThe worst performers from the top 50 largest cryptocurrencies by market capitalization included Komodo (down -19.06%), Verge (down -18.71%), KuCoin Shares (down -18.55%), Walton (down -18.47%), RChain (down -18.33%), Siacoin (down -17.60%), Steem (down -16.75%), and TRON (down -16.96%).\n\nThe price of NEM's XEM coin slumped more than 14.2% Tuesday.\n\nThe slump comes after a dramatic $500 million hacking event of Coincheck.\n\nJapanese authorities have opened an investigation into the cyberattack. According to Reuters, many of the XEM coins have been sold on other exchanges.\n\nLitecoin prices fell again in the wake of the Coincheck hack.\n\nBut as we noted yesterday, a rumor has been swirling about a mega-crypto merger that could reverse the slide.\n\nMust Read: 5 Cryptocurrencies to Watch in 2018 Under $10\n\nYesterday, we noted that Monero founder Riccardo Spagni made a joke about potentially merging with Litecoin. In response, LTC creator Charlie Lee dismissed the merger idea, but did say that they were working to develop a path toward cross-chain atomic swaps in the near future.\n\nThis isn't the first time that Lee has considered collaboration with other cryptocurrencies.\n\nEarlier this year, Lee contacted Dogecoin about the possibility of mining the two coins together.\n\nWith tax season approaching, there are plenty of questions about the IRS and cryptocurrencies.\n\nThe IRS treats cryptocurrencies like property, but there will be many different ways that they are taxed depending on the associated transactions.\n\nThese include the mining, spending, trading, exchanging, and air drops of cryptocurrencies like Bitcoin.\n\nThe IRS has provided very little guidance heading into tax season, so it's critical that anyone who has made gains ask their tax advisor on the best way to ensure compliance.\n\nTrading cryptocurrencies creates capital gains and losses, meaning that it's best to own the cryptocurrency for more than one year in order to get the biggest tax break.\n\nIn the week ahead, Money Morning will compile a useful guide for cryptocurrency traders on how to classify their cryptocurrency holdings.\n\nThe taxman is watching... we're here to help you get your taxes correct come April.\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "Bitcoin (CURRENCY:BTC) traded 5.4% lower against the US dollar during the twenty-four hour period ending at 8:00 AM ET on January 31st. Bitcoin has a market capitalization of $172.53 billion and $10.19 billion worth of Bitcoin was traded on exchanges in the last 24 hours. One Bitcoin coin can now be bought for about $10,246.80 on cryptocurrency exchanges including BitBay, BTCTurk, Zaif and Coinnest. Over the last week, Bitcoin has traded down 8.4% against the US dollar.\n\nHere is how related cryptocurrencies have performed over the last 24 hours:\n\nGet Bitcoin alerts: Bitcoin Cash (BCH) traded 7.1% lower against the dollar and now trades at $1,497.49 or 0.14719500 BTC. Steem (STEEM) traded 5.3% lower against the dollar and now trades at $5.04 or 0.00049544 BTC. PACcoin (PAC) traded 7.6% lower against the dollar and now trades at $0.0001 or 0.00000001 BTC. Counterparty (XCP) traded 19% lower against the dollar and now trades at $43.88 or 0.00431270 BTC. Namecoin (NMC) traded 8.3% lower against the dollar and now trades at $3.46 or 0.00034033 BTC. Crown (CRW) traded down 10.4% against the dollar and now trades at $2.84 or 0.00027897 BTC. Unobtanium (UNO) traded 2.4% lower against the dollar and now trades at $123.87 or 0.01211640 BTC. ATBCoin (ATB) traded down 7.1% against the dollar and now trades at $0.53 or 0.00005206 BTC. CHIPS (CHIPS) traded down 15.7% against the dollar and now trades at $0.30 or 0.00002972 BTC. Terracoin (TRC) traded 4.4% lower against the dollar and now trades at $0.26 or 0.00002580 BTC.\n\nAbout Bitcoin\n\nBitcoin is a proof-of-work (PoW) coin that uses the SHA-256 hashing algorithm. Its genesis date was January 3rd, 2009. Bitcoin's total supply is 16,837,062 coins. The Reddit community for Bitcoin is /r/bitcoin and the currency's Github account can be viewed here. Bitcoin's official message board is bitcointalk.org. Bitcoin's official Twitter account is @bitcoin and its Facebook page is accessible here. The official website for Bitcoin is bitcoin.org.\n\nAccording to CryptoCompare, \"Bitcoin uses peer-to-peer technology to operate with no central authority or banks; managing transactions and the issuing of bitcoins is carried out collectively by the network. Although other cryptocurrencies have come before, Bitcoin is the first decentralized cryptocurrency - Its reputation has spawned copies and evolution in the space.With the largest variety of markets and the biggest value - having reached a peak of 18 billion USD - Bitcoin is here to stay. As with any new invention, there can be improvements or flaws in the initial model however the community and a team of dedicated developers are pushing to overcome any obstacle they come across. It is also the most traded cryptocurrency and one of the main entry points for all the other cryptocurrencies. The price is as unstable as always and it can go up or down by 10%-20% in a single day.Bitcoin is an SHA-256 POW coin with 21,000,000 total minable coins. The block time is 10 minutes. \"\n\nBitcoin Coin Trading\n\nBitcoin can be purchased on these cryptocurrency exchanges: BitBay, Bitbank, Bitcoin Indonesia, GDAX, Negocie Coins, itBit, Korbit, Coinfloor, Gemini, CEX.IO, Bit-Z, CoinEgg, Coinnest, Coinroom, Allcoin, Quoine, Upbit, Coinrail, CoinExchange, Fisco, Liqui, Lbank, Kucoin, Paribu, BTC Markets, EXX, WEX, BTCTurk, Gatecoin, ACX, xBTCe, YoBit, Mr. Exchange, Coinone, Zaif, Livecoin, CoinsBank, Gate.io, BitMEX, HitBTC, Bitstamp, BX Thailand, OKEx, Tidex, Exmo, ZB.COM, Foxbit, Bitso, Huobi, Bleutrade, LakeBTC, RightBTC, Bittrex, Luno, Bibox, Bithumb, QuadrigaCX, bitFlyer, BitGrail, Bitonic, BTCC, BtcTrade.im, Kraken, GetBTC, Poloniex, Coinsquare, CoolCoin, Independent Reserve, Cryptopia, Binance, BL3P, BTCBOX and Bitfinex. Investors seeking to acquire Bitcoin using U.S. dollars directly can do so using Coinbase, Changelly or Gemini.\n\nReceive News & Updates for Bitcoin Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Bitcoin and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "Ethereum (CURRENCY:ETH) traded 5% higher against the US dollar during the 1 day period ending at 9:00 AM ET on February 14th. Ethereum has a total market capitalization of $86.86 billion and $2.33 billion worth of Ethereum was traded on exchanges in the last 24 hours. Over the last week, Ethereum has traded 8.3% higher against the US dollar. One Ethereum coin can now be bought for approximately $889.83 or 0.09662540 BTC on major cryptocurrency exchanges including CoinFalcon, CoinExchange, Kraken and Allcoin.\n\nHere's how similar cryptocurrencies have performed over the last 24 hours:\n\nGet Ethereum alerts: Bitcoin (BTC) traded 6.8% higher against the dollar and now trades at $9,230.62 or 1.00000000 BTC. Bitcoin Cash (BCH) traded up 4.1% against the dollar and now trades at $1,293.18 or 0.14042500 BTC. Litecoin (LTC) traded up 33.7% against the dollar and now trades at $211.27 or 0.02294180 BTC. Monero (XMR) traded up 14.8% against the dollar and now trades at $269.15 or 0.02922680 BTC. Ethereum Classic (ETC) traded up 3.2% against the dollar and now trades at $33.72 or 0.00366133 BTC. RaiBlocks (XRB) traded up 32.3% against the dollar and now trades at $18.58 or 0.00186028 BTC. Bitcoin Gold (BTG) traded 4.5% higher against the dollar and now trades at $124.88 or 0.01356040 BTC. Zcash (ZEC) traded up 5% against the dollar and now trades at $470.79 or 0.05112220 BTC. Nano (XRB) traded 2.4% higher against the dollar and now trades at $9.41 or 0.00102220 BTC. Steem (STEEM) traded 4.1% higher against the dollar and now trades at $4.34 or 0.00047088 BTC.\n\nAbout Ethereum\n\nEthereum (CURRENCY:ETH) is a proof-of-work (PoW) coin that uses the Ethash hashing algorithm. It launched on July 30th, 2015. Ethereum's total supply is 97,610,805 coins. The official website for Ethereum is www.ethereum.org. The Reddit community for Ethereum is /r/ethereum and the currency's Github account can be viewed here. Ethereum's official Twitter account is @ethereumproject and its Facebook page is accessible here. The official message board for Ethereum is forum.ethereum.org.\n\nAccording to CryptoCompare, \"Ethereum is a decentralized platform that runs smart contracts: applications that run exactly as programmed without any possibility of downtime, censorship, fraud or third party interference. In the Ethereum protocol and blockchain there is a price for each operation. The general idea is, in order to have things transferred or executed by the network, you have to consume or burn Gas. The cryptocurrency is called Ether and is used to pay for computation time and for transaction fees.If you want to earn block rewards from the network, you can join the network as a miner. Follow the link for a guide on how to mine Ethereum on a Windows Pc. The much easier but a bit more expensive way is to buy an Ethereum mining contract. Ethereum is how the Internet was supposed to work. As long as you have enough funds to pay for your code to be run by the network, your contacts will always be up and running.It was crowdfunded during August 2014 by fans all around the world. It is developed and maintained by ETHDEV with contributions from great minds across the globe. There is also an Ethereum foundation and there are multiple startups working with the Ethereum blockchain.Ethereum is currently on the \"Homestead\" stage and all its related software is still considered Beta until the release of the next stage \"Metropolis\". If you are looking for a GUI interface for your wallet, try the Ethereum Wallet DApp. It's still in beta so be careful when you use it.Our block explorer data bellow is freely provided by etherchain.org and etherscan.io. \"\n\nEthereum Coin Trading\n\nEthereum can be bought or sold on the following cryptocurrency exchanges: Coinbene, RightBTC, Coinut, Liqui, DSX, Gemini, CoinEgg, Bibox, Coinone, ZB.COM, OKEx, xBTCe, Cryptopia, WEX, BtcTrade.im, ChaoEX, Upbit, Tidebit, Coinrail, Bitbank, Bitso, Quoine, Bitcoin Indonesia, CoinFalcon, GDAX, Bithumb, Exmo, Livecoin, Gate.io, EXX, HitBTC, BX Thailand, Bittrex, CoolCoin, bitFlyer, Kraken, Tidex, Korbit, Allcoin, TOPBTC, Bit-Z, Koineks, BTC Markets, BitGrail, Coinnest, Koinex, ACX, Qryptos, CoinExchange, Mr. Exchange, Binance, EtherDelta, BitBay, Bancor Network, Bitfinex, YoBit, BigONE, BTCTurk, COSS, Kucoin, Mercatox, Gatecoin, Cobinhood, Independent Reserve, CEX.IO, Lbank, Bitinka, QuadrigaCX, Huobi, Bitstamp, Coinsquare, GOPAX, Gatehub and Poloniex. Investors seeking to trade Ethereum using U.S. dollars directly can do so using Changelly, Gemini or GDAX.\n\nReceive News & Updates for Ethereum Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Ethereum and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "MinexCoin (CURRENCY:MNX) traded 5.1% lower against the dollar during the one day period ending at 12:00 PM ET on February 22nd. During the last seven days, MinexCoin has traded 3.8% lower against the dollar. MinexCoin has a total market capitalization of $63.40 million and approximately $120,612.00 worth of MinexCoin was traded on exchanges in the last day. One MinexCoin coin can currently be purchased for $18.75 or 0.00190334 BTC on popular exchanges.\n\nHere is how related cryptocurrencies have performed during the last day:\n\nGet MinexCoin alerts: Ripple (XRP) traded down 8.8% against the dollar and now trades at $0.93 or 0.00009433 BTC. NEO (NEO) traded down 3.8% against the dollar and now trades at $115.44 or 0.01166890 BTC. Stellar (XLM) traded 5.8% lower against the dollar and now trades at $0.37 or 0.00003732 BTC. IOTA (MIOTA) traded down 8.5% against the dollar and now trades at $1.63 or 0.00016436 BTC. TRON (TRX) traded 7.6% lower against the dollar and now trades at $0.0404 or 0.00000409 BTC. VeChain (VEN) traded down 6.2% against the dollar and now trades at $5.43 or 0.00054869 BTC. Tether (USDT) traded up 0.1% against the dollar and now trades at $1.00 or 0.00010121 BTC. Binance Coin (BNB) traded down 4.8% against the dollar and now trades at $8.87 or 0.00089704 BTC. Populous (PPT) traded down 1.6% against the dollar and now trades at $21.90 or 0.00221382 BTC. RChain (RHOC) traded 6.8% lower against the dollar and now trades at $1.97 or 0.00019923 BTC.\n\nMinexCoin Profile\n\nMinexCoin (MNX) is a coin. Its launch date was March 29th, 2017. MinexCoin's total supply is 5,749,878 coins and its circulating supply is 3,381,389 coins. MinexCoin's official Twitter account is @minexcoin. The Reddit community for MinexCoin is /r/Minexcoin and the currency's Github account can be viewed here. MinexCoin's official website is minexcoin.com.\n\nAccording to CryptoCompare, \"MinexCoin is a low volatility cryptocurrency based on the Mars algorithm. MinexBank is an algorithm for controlling the volatility of Minexcoin price. Due to this algorithm, the price of Minexcoin is stabilized by reducing or increasing interest rates and interventions on the market. \"\n\nMinexCoin Coin Trading\n\nMinexCoin can be purchased on these cryptocurrency exchanges: Livecoin. It is not possible to buy MinexCoin directly using US dollars. Investors seeking to trade MinexCoin must first buy Ethereum or Bitcoin using an exchange that deals in US dollars such as Coinbase, GDAX or Changelly. Investors can then use their newly-acquired Ethereum or Bitcoin to buy MinexCoin using one of the exchanges listed above.\n\nReceive News & Updates for MinexCoin Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for MinexCoin and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "CoinDash (CURRENCY:CDT) traded down 8.7% against the dollar during the 1-day period ending at 11:00 AM Eastern on February 22nd. CoinDash has a total market cap of $53.07 million and approximately $2.68 million worth of CoinDash was traded on exchanges in the last 24 hours. One CoinDash token can now be bought for $0.0809 or 0.00000803 BTC on popular cryptocurrency exchanges including Gatecoin, Mercatox, BigONE and EtherDelta. During the last week, CoinDash has traded down 9% against the dollar.\n\nHere is how similar cryptocurrencies have performed during the last 24 hours:\n\nGet CoinDash alerts: Ripple (XRP) traded down 8.1% against the dollar and now trades at $0.94 or 0.00009360 BTC. NEO (NEO) traded 2.3% lower against the dollar and now trades at $117.17 or 0.01163720 BTC. Stellar (XLM) traded down 4.8% against the dollar and now trades at $0.37 or 0.00003709 BTC. IOTA (MIOTA) traded down 7.6% against the dollar and now trades at $1.64 or 0.00016294 BTC. TRON (TRX) traded down 5.9% against the dollar and now trades at $0.0411 or 0.00000408 BTC. VeChain (VEN) traded 4.4% lower against the dollar and now trades at $5.53 or 0.00054923 BTC. Tether (USDT) traded 0.6% higher against the dollar and now trades at $1.01 or 0.00010003 BTC. Binance Coin (BNB) traded down 3.5% against the dollar and now trades at $9.01 or 0.00089497 BTC. Populous (PPT) traded down 0.4% against the dollar and now trades at $22.25 or 0.00221007 BTC. RChain (RHOC) traded down 7.9% against the dollar and now trades at $1.96 or 0.00019427 BTC.\n\nCoinDash Profile\n\nCoinDash's launch date was July 16th, 2017. CoinDash's total supply is 1,000,000,000 tokens and its circulating supply is 656,173,039 tokens. CoinDash's official website is www.coindash.io. CoinDash's official Twitter account is @coindashio and its Facebook page is accessible here.\n\nAccording to CryptoCompare, \"Coindash is an operating system for blockchain-based assets, it has the goal of making handling and trading easy and accessible for both new and experienced users in the cryptoshpere. The CoinDash's ecosystem includes three synergistic components: Software-as-a-Service (Saas), Social Networking and the Marketplace. SaaS: CoinDash provides analytics that give users deep insight into the performance of their investments and help them make data driven decisions. Social Network: CoinDash provides social trading features that remove barriers for new and existing crypto users by letting them follow and copy-trade top investors. Marketplace: CoinDash's marketplace is built around opportunity discovery and streamlined trading UX with features like real-time social trading signals, an ICO dashboard, trending assets, real-time market price tables and 3rd party integration.  Every action within the CoinDash platform requires the user to pay a fee which is paid in the CoinDash (CDT), an Ethereum-based token Every user who facilitates the use of a feature which in turn gives financial value will be entitled to a payment, creating a creator-consumer relationship between users in the system. \"\n\nCoinDash Token Trading\n\nCoinDash can be purchased on these cryptocurrency exchanges: EtherDelta, Binance, Gate.io, Mercatox, HitBTC, BigONE and Gatecoin. It is not presently possible to buy CoinDash directly using US dollars. Investors seeking to acquire CoinDash must first buy Ethereum or Bitcoin using an exchange that deals in US dollars such as Changelly, GDAX or Gemini. Investors can then use their newly-acquired Ethereum or Bitcoin to buy CoinDash using one of the exchanges listed above.\n\nReceive News & Updates for CoinDash Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for CoinDash and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nThe mere fact that Bitcoin is decentralized concerns governments at global scale because only a centralized system can be in full control. Mark Zuckerberg argued in a recent statement that the people once believed in the decentralized nature of technology. Over the years, they've lost faith because governments are now using it to manipulate the masses.\n\n\"Cryptocurrency takes power from centralized systems and puts it back into the hands of its rightful owners - the people\", said Zuckerberg in a post on Facebook. Bitcoin is risky because it's difficult to keep under control, although at the core of the crypto world lies a purpose: the ability of cryptocurrency to reconstruct financial systems leveraging transparency and eliminating the dire need to trust; and when there's no reason to doubt there's no chance for deceit or fraud.\n\nHigh-level security, transparency and trust are three of the main benefits that Blockchain technology and Bitcoin can provide, and the democratization of money seems to be the greatest financial revolution of the century. Regardless, governments around the world are trying to make Bitcoin a pariah of society. Illegal trades, cybersecurity breaches, volatility, and ICO scams have persuaded countries like South Korea to regulate Bitcoin.\n\nAs cryptocurrency falls under government scrutiny in Asia, Europe seems to be on the verge of building a crypto-based empire. Countries like Germany, Switzerland, Denmark, Sweden, and UK see the good in cryptocurrency, the influence it holds, and, ultimately, the power it has to disrupt centralized governments and revolutionize financial systems.\n\nBig governments around the world are catching up with the cryptocurrency craze. Apparently, they're on a hunt for blood. After announcing the ICOs are greatly influencing financial and economic order in China, the government banned all forms of ICO funding. It happened in October 2017, with bitcoin losing nearly 10%, Litecoin 24.92% and Ethereum 21.74%. In Venezuela, the government has began locking up Bitcoin miners, although because of the severe financial crisis, cryptocurrency might actually help overcome a complete financial blockage.\n\nPreviously the head of the state Nicholas Maduro has said Venezuela would issue 100 million tokens, each backed by the equivalent of one barrel of Venezuelan oil. This will make the entire value of tokens a little over $6 billion. The pre-sale is about to start on February 20th, but critics strongly doubt that such measure could pull the country out of the economic crisis. Besides, some consider it illegal.\n\nAs far as South Korea is concerned, which is also one of the most popular Bitcoin markets in the world - the ban on anonymous cryptocurrency trading has just been enforced.\n\nThe overall crypto market is challenged by Asian regulations, and as of January 30 South Korea Financial Services Commission enabled a set of rules that allegedly are meant to reduce illegal cryptocurrency activities, such as \"money laundering, crimes, and tax evasion.\" The new terms and conditions imposed challenge the status quo of cryptocurrency, which is anonymity. All traders will have to link their crypto exchange accounts to their bank accounts using their real names.\n\nThe South Korean situation with the crypto market is, at the very least, complicated. At first, the government's intention was to ban crypto trading entirely. But the Korean people reacted and filed a petition to fight than. They called it a \"happy dream\", and its intention was to compel officials to declare their crypto assets. After dealing with several pain points related to privacy failure, several Korean crypto exchanges were penalized, influencing once more the price of Bitcoin.\n\nRather than befriend Bitcoin, big governments in Asia and the US claim their actions are meant to protect the people from market manipulation. However, they're actually attempting to kill a currency that poses a threat to government monopolies on seigniorage income and printing money. Somewhere somehow, innovators who understand the crypto world were joined by enthusiasts and early adopters that see the potential of an \"exotic\" currency - a better, more transparent hedge that's better than gold, can be used for cross-border payments, and has a limited supply of 21 million.\n\nThings could take a turn to the better in Europe, where a member of Germany's Bundesbank, Joachim Wuermeling, highlighted that an attempt to regulate Bitcoin and other cryptocurrencies would demand international cooperation, as \"the regulatory power of nation states is obviously limited.\"\n\nOn December 22, Belarus legalized cryptocurrency transactions, marking the beginning of a journey to attract foreign investment and foster growth in the private investing sector by freeing the people from Soviet-style stigma. In Russia, The Ministry of Finance recently presented a Digital Assets Regulation Bill meant to legalize and regulate cryptocurrency trading, mining, and ICOs. Given that the Central Bank of Russia is a centralized entity, the officials disagree on several grounds, emphasizing the cryptocurrency trading rule should apply to tokens with real potential to attract viable financial investments.\n\nThe creators of the bill argue that legalizing cryptocurrency would reduce financial fraud and provide better fiscal transparency. But approving the bill doesn't mean cryptocurrency will become a legal payment instrument in Russia, as trading would only be allowed through compliant exchanges.\n\nEven after China's ban on ICOs in Oct. 2017, Bitcoin didn't give up. It came up stronger than ever increasing in value from $4,000+ in October to nearly $20,000 in Dec. 2017. Because centralized governments will always hold monopoly on the value of money, Bitcoin enthusiasts will never get to see cryptocurrency replace national currencies. Regardless, just because South Korea, China, the US and other countries can crush Bitcoin by issuing new regulations and influencing cryptocurrency prices, it doesn't mean they can kill it.\n\nOn the bright side, blockchain technology is way too powerful to be put down by big governments, and Bitcoin will always remain a collectible digital currency for savvy enthusiasts that understand how technology works, and the potential it has. This 2018, we're looking at more and more companies eager to accept cryptocurrency as an official payment mode, including Microsoft, PwC, and online retailer Overstock.\n\nLate last year, CME (Chicago Mercantile Exchange) and CBOE (Chicago Board Options Exchange) launched Bitcoin futures, proving market confidence in Bitcoin, and strengthening the fact that cryptocurrency is here to stay. Cantor Fitzgerald and NASDAQ are also making plans to develop their Bitcoin derivatives contracts. Furthermore, Intercontinental Exchange Inc. (ICE) recently looked into the possibility of creating a data center in partnership with Blockstream Inc. The goal is to provide hedge fund investors with a crypto-based price data feed that will provide real-time information from 15+ exchanges.\n\nLast but not least, Goldman Sachs has plans to designate a Bitcoin trading desk, highlighting that more and more institutions are open to accepting and adapting in an already decentralized financial ecosystem.\n\nAuthor: Vladimir Smerkis is the co-founder and managing partner of Tokenbox, a unique ecosystem that combines cryptocurrency funds under the control of professional portfolio managers and traders on the one hand, and investors on the other.", "A cryptocurrency investment scheme that last month drew the ire of state regulators in Texas announced last week that it was closing its lending platform.\n\nDavorCoin, as previously reported, was likened to BitConnect by the Texas State Securities Board (TSSB) given that both involved the use of a lending site and had promised to pay steady interest income to those who invested. On Feb. 2, the board issued a cease-and-desist to Davorcoin, alleging at the time that those behind the scheme had intentionally hidden information from would-be stakeholders.\n\n\"The emergency order found that DavorCoin is telling investors they can earn lucrative profits by investing in a lending program based on a new cryptocurrency known as davorcoin. Investors allegedly purchase davorcoin and then lend it to DavorCoin,\" TSSB wrote at the time.\n\nLess than a week later, those behind DavorCoin announced that they were closing the associated lending platform because of a plunge in the value of the scheme's DAV token.\n\nAccording to data from CoinMarketCap, the price nearly hit $180 just over a month ago, but by the day of the announcement, the value of DAV was around $3. Press-time data indicates that DAV's value has plunged even further, coming in at roughly $0.03 at press time.\n\nThe team wrote in the Feb. 7 blog post:\n\n\"There is no doubt for us that the DAV value has been negatively affected by our lending program because the crypto-environment has dramatically changed recently. We did everything possible to protect our platform and our amazing community. However, DAV price still went from $180 to $0.5 in 20 days. As a result, we have decided to change our strategy and to end our lending program that has become the only reason why DavorCoin is decreasing in value.\"\n\nThe blog goes on to state that those behind DavorCoin will seek to resuscitate its price through \"transforming DAV into a strong cryptocurrency.\" Yet since that date, there have been no official posts on its Medium and Twitter accounts.\n\nImage via Shutterstock", "As cryptocurrencies dominate global headlines, China is consistently quashing the hype within its borders. But as Beijing ratchets up its pressure on bitcoin, this time targeting mining, Chinese investors are exploring the potential of the technology central to it all - blockchain.\n\nIn 2017, cryptocurrencies took the world by storm, led by their torchbearer, Bitcoin. Bitcoin took on manic appeal in a matter of months. Billionaire venture capitalists and your average tech-savvy private individuals all reached into their pockets to invest in Bitcoin and its kind - the likes of dreamily named Ethereum and Ripple.\n\nChinese investors are among those seduced, but for the Communist Party of China, this is a corner of modernity it doesn't seem to want to engage. Beijing is taking extensive measures to export Bitcoin, its friends, and the related volatility away from the country. As the Chinese private sector's love affair with cryptocurrencies and blockchain deepens, the Party's next moves will be vital for China's stake in this up and coming phenomenon, both for its own preservation and for private domestic and foreign investors.\n\nBitcoin is designed for making secure, cheap, and anonymous digital transactions. Traditional paper-based currencies, tethered by a central bank's seal of approval, are easily trackable and held within the boundaries and under the scrutiny of nation-states. Bitcoin bypasses this through the use of blockchain and encouraging private individuals to become so-called 'miners'. When bitcoin is used to make a transaction, this event generates a complex computational puzzle for the miners to solve. Once solved, others in the mining community authenticate and green-light the transaction by verifying the solution, the miner is rewarded with bitcoin, and thus new bitcoins are released.\n\nExcellent interview Blockchain Technology Has Power to Destroy Monopolies\n\nThe unique technology of blockchain makes this possible. Blockchain can be thought of as a live-updated online ledger, accessible and updateable by numerous Internet-users at any one time. But once a group of transactions is authenticated - in a block - they cannot be altered. Altogether, these features give blockchain its reliability and its democracy. Coins cannot be double spent, records are publicly accessible, and importantly, power is taken away from sovereign political establishments and placed into the hands of an anonymous collective.\n\nIn China, digitally-minded opportunists wasted no time to establish collectives of miners, reaping the rewards of scale. In particular, with the country's cheap electricity, the energy demands of Bitcoin mining - deriving from the huge computational power required to solve transactional puzzles - are satisfied at minimal cost. At their peak, Chinese miners accounted for two-thirds of the world's Bitcoin supply.\n\nBut Beijing does not want the title of the world leader, in this industry at least. Last year, it banned the purchase of Initial Coin Offerings (ICOs) - financial buy-ins to Bitcoin, akin to a stock's IPO, and shut down cryptocurrency trading platforms. Now the focus has moved on to the supply chain. On 2 January, a nation-wide memo instructed authorities at all regional levels to shut down mining operations. It encouraged the use of extensive leverages, including manipulating energy prices (to make mining more expensive to maintain), and property rights. The instructions were quickly reproduced and disseminated down the Party-state mechanism.\n\nSee Johnson on 2018 Bond Market Sell-Off, Bitcoin, and Commodities\n\nWhat explains such utter rejection of Bitcoin, and what happens next? In the first instance, the currency's extreme surge seems too good to be true. Many warn that a painful correction, or worse, a crash, is coming imminently. Just so, a closer look at Bitcoin's upward trend reveals a dramatic landscape of jagged peaks and deep troughs. On 16 December 2017, the value of a single bitcoin was $19,343; in the week that followed, it fell by 28%. For a government that is, despite appearances, walking on eggshells to sustain authority in a rapidly changing world, Bitcoin is a volatility and challenge that it could do without. One need only look to the fate of those bankers and journalists implicated in the 2015 stock market crash to see just how little patience Beijing has for economic theatricals.\n\nWhat's more, such mining comes at a cost. It is estimated that the mining of one coin consumes the same amount of energy as the weekly average consumption of an American household - 215 kilowatt-hours. With the government ever more focused on technological development in strategic areas such as AI and automation, such high energy consumption for the sake of a wild card seems an unnecessary price.\n\nOn the other hand, blockchain is a technological revolution on the cusp of flowering, with potential impact rippling out to businesses, countries, and individuals. The online ledger allows a transaction process that is reliable, instantaneous, and private in an unprecedented way. It can provide an alternative to traditional bank transfers, which are costly and slow on an international scale (one potential application of this is in international aid, where credit can be transferred peer-to-peer and almost instantaneously). It can provide anonymity to consumers and producers, while simultaneously ensuring the reliability of the transaction (such that individuals who have never met can exchange high-value goods without the flaws of traditional capital transfers, such as high cost and slow speed). Lastly, it can decentralize power in a transaction, moving such transactions away from establishment scrutiny. The bottom line is this: properly harnessed, blockchain will allow individuals to capture the benefits that are traditionally captured by service providers such as banks and governments.\n\nYou may also like Bitcoin Bubble Is About to Burst: Central Banks Could Be the Reason\n\nSuch potential has been recognized by investors and entrepreneurs in China, and even state media, historically skeptical of cryptocurrencies, has covered the basics of the blockchain. In an extensive interview, CCTV's Financial channel hosted Chinese financial analyst Song Jiaji, who explained the concept, applications, and potential of the blockchain, and argued that the bullish domestic and international reaction to the tech is not an overreaction. The existence and content of the interview demonstrate Chinese interest in the technology, with Song mentioning current and short-term applications used by real firms. Examples included Kodak's pivot to the technology in a bid to re-energize, and Singaporean firm VeChain's project to authenticate the provenance of branded goods purchased online.\n\nTo skip out on exploiting the potential of blockchain for fear of crypto volatility would be incongruous with Beijing's general strategy for growth, which has increasingly relied on technological advancement. And indeed, the government has separated the two and repeatedly demonstrated a positive attitude towards blockchain, despite the ever-tougher stance on Bitcoin et al. For instance, just a few months before ICOs for cryptocurrencies were banned, Chinese officials welcomed the World Economic Forum'sWhite Paper on blockchain, which advocated the importance of blockchain but also the potential for regulating it. More recently, the Ministry of Industry and Information Technology has backed the creation of a blockchain research facility, and the official discussion surrounding FinTech regulations in China has identified blockchain as a point of interest. Importantly, the China Banking Regulatory Commission advocates a 'sandbox' approach to regulating blockchain; firms and entrepreneurs are encouraged to play with the technology, and only then can regulators better understand their mission at hand, and regulate from there.\n\nCheck out Bitcoin, Tulips, and Power Consumption\n\nThe current climate for blockchain in China is friendly, worlds apart from the state's attitude towards cryptocurrencies. Correspondingly, the biggest players in the market have caught on - Tencent, UnionPay, and Alibaba are amongst those already investing in blockchain. As Don Tapscott told McKinsey & Co, the blockchain revolution is like the Wild West - full of opportunity. In the East, its technological frontier is no less exciting.", "DigixDAO prices surged 24%, although there isn't a concrete reason as to why prices shot up so quickly today (Jan. 26, 2018).\n\nIt appears to be in part thanks to a meetup held in Singapore yesterday and hosted by TenX, a wallet that makes virtual currencies spendable anytime and anywhere.\n\nEach DGX token represents one gram of 99.99% LMBA standard gold. The DGD token, which is the token that surged 24% today, fluctuates in value based on exchange rates and market forces, according to Digix.global.\n\nIn Litecoin news, prices dropped over 3% Friday after UK Prime Minister Theresa May said a crackdown on the cryptocurrency sector may be imminent.\n\n\"In areas like cryptocurrencies, like Bitcoin, we should be looking at these very seriously,\" May said in an interview with Bloomberg.\n\nMay also said that regulation was necessary \"because of the way they are used, particularly by criminals.\"\n\nBitcoin was also down on the day, and critics poured in to take shots at the crypto coin.\n\nYale economist Robert Schiller and Bank of Canada Governor Stephen Poloz both questioned the value of Bitcoin and other cryptocurrencies.\n\n\"There is no intrinsic value for something like Bitcoin so it's not really an asset one can analyze. It's just essentially speculative or gambling,\" Poloz said.\n\nBut one Bitcoin supporter made his voice heard today...\n\nBespoke Investment Group's Dan Ciotoli argued that Bitcoin's value could triple from the new lows hit in January. The blockchain analyst argued that Bitcoin could trade between $20,000 and $30,000 by the end of the year.\n\nBelow is a recap of the top cryptocurrency prices at 1:00 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Friday, the market capitalization of the global cryptocurrency sector hit $543.69 billion. Bitcoin represented 34.5% of the total cryptocurrency market, with a market capitalization of $181.32 billion.\n\nTop performers out of the top 50 cryptocurrencies by market capitalization included RaiBlocks (up 24.03%), Walton (up 10.93%), Populous (up 9.73%), Bytecoin (up 8.08%), BitShares (up 7.80%), 0X (up 7.67%), VeChain (up 7.27%), Maker (up 6.29%), and Stellar (up 3.81%).\n\nThe worst performers from the top 50 largest cryptocurrencies by market capitalization included Ardor (down -8.98%), NEM (down -8.75%), Ripple (down -6.80%), Steem (down -6.14%), OmiseGo (down -6.14%), Electroneum (down -5.95%), and IOStoken (down -3.81%).\n\nMarkets reacted negatively today to developments at Japanese crypto exchange Coincheck.\n\nAccording to reports, it appears that the exchange was hacked after a payment of $123 million in Ripple left its platform.\n\nMust Read: 5 Cryptocurrencies to Watch in 2018 Under $10\n\nNot only did it send the price of Ripple plunging, but it created a system-wide freeze on withdrawals.\n\nThe price of Litecoin is still off roughly 50% from its all-time high.\n\nHowever, many analysts project that it could receive a big boost in the future thanks to a major development in India.\n\nOn Thursday, India's largest cryptocurrency exchange, Zebpay, added Litecoin to its platform for the first time ever.\n\nAnalysts are bullish, because this could help increase widespread Litecoin use among India's 1.32 billion population.\n\nLitecoin is the third cryptocurrency to be added to the platform after Bitcoin and Bitcoin Cash.\n\nThe cryptocurrency sector is getting a lot of negative attention over in Switzerland, particularly on matters tied to money laundering, drug trafficking, and other illegalities.\n\nOne of the primary drivers of this narrative has been a major study out of Sydney, Australia, called, \"Sex, Drugs, and Bitcoin: How Much Illegal Activity Is Financed Through Cryptocurrencies?\"\n\nReleased last week, the 58-page report suggests that about 44% of global cryptocurrency transactions are tied to illegal activities.\n\nThe report also suggests that 25% of Bitcoin users have ties to illegal activities like money laundering, drug trafficking, and hacking.\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "Revain (CURRENCY:R) traded 11.9% lower against the U.S. dollar during the 24-hour period ending at 11:00 AM ET on February 22nd. Revain has a market cap of $448.10 million and approximately $20.86 million worth of Revain was traded on exchanges in the last 24 hours. One Revain token can currently be purchased for about $2.43 or 0.00024287 BTC on popular exchanges including Mercatox, Kucoin, YoBit and Cryptopia. In the last seven days, Revain has traded 23.5% lower against the U.S. dollar.\n\nHere's how similar cryptocurrencies have performed in the last 24 hours:\n\nGet Revain alerts: Ripple (XRP) traded down 8.6% against the dollar and now trades at $0.94 or 0.00009403 BTC. NEO (NEO) traded down 3.7% against the dollar and now trades at $115.82 or 0.01157890 BTC. Stellar (XLM) traded down 5.9% against the dollar and now trades at $0.37 or 0.00003711 BTC. IOTA (MIOTA) traded 8.8% lower against the dollar and now trades at $1.62 or 0.00016221 BTC. TRON (TRX) traded 6.3% lower against the dollar and now trades at $0.0411 or 0.00000410 BTC. VeChain (VEN) traded 5.1% lower against the dollar and now trades at $5.50 or 0.00055000 BTC. Tether (USDT) traded up 0.8% against the dollar and now trades at $1.01 or 0.00010088 BTC. Binance Coin (BNB) traded down 4.9% against the dollar and now trades at $8.91 or 0.00089109 BTC. Populous (PPT) traded down 0.1% against the dollar and now trades at $22.46 or 0.00224554 BTC. RChain (RHOC) traded down 8.7% against the dollar and now trades at $1.95 or 0.00019487 BTC.\n\nRevain Profile\n\nRevain's launch date was September 5th, 2017. Revain's total supply is 484,450,000 tokens and its circulating supply is 184,450,000 tokens. The Reddit community for Revain is /r/revain_org and the currency's Github account can be viewed here. Revain's official Twitter account is @Revain_org and its Facebook page is accessible here. Revain's official website is revain.org. The official message board for Revain is medium.com/revain.\n\nAccording to CryptoCompare, \"Revain is a platform that will leverage the Ethereum blockchain to implement a review mechanism that doesn't require a third-party to be involved. In order to avoid the third-party involvement while keeping track of the review's quality, the Revain review mechanism will be composed of two phases. In the first phase there is a filtering layer which is applied by a machine using AI (RAF & Tone Analyzer utilities), and then a second layer is applied by the company to either decide if the review is accepted or not. This mechanism also allows saving part of a review in an RSS smart contract (Review snapshots storage) making reviews immutable. The Revain platform, differently from other blockchains will have two tokens, the R token, and the RVN token. The R token will be used to gather funds during the ICO and to exchange it for other cryptocurrencies. On the other hand, the RVN token will be used exclusively inside Revain platform, to reward users/companies for quality reviews and to penalize those who write unconstructive reviews. A fixed value of 0,0001 Bitcoin is attributed to the RVN token, enabling RVN tokens to be converted for the R tokens within the platform. The conversion is calculated by dividing the actual price of the R token (in BTC) for 0,0001 Bitcoin and then multiplying that value by the number of RVN tokens that a certain user possess. \"\n\nBuying and Selling Revain\n\nRevain can be bought or sold on the following cryptocurrency exchanges: BitFlip, Kucoin, C-CEX, Kuna, EtherDelta, YoBit, BTC-Alpha, Mercatox and Cryptopia. It is not possible to buy Revain directly using U.S. dollars. Investors seeking to acquire Revain must first buy Ethereum or Bitcoin using an exchange that deals in U.S. dollars such as Changelly, Gemini or Coinbase. Investors can then use their newly-acquired Ethereum or Bitcoin to buy Revain using one of the exchanges listed above.\n\nReceive News & Updates for Revain Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Revain and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "Siacoin (CURRENCY:SC) traded down 13.6% against the U.S. dollar during the twenty-four hour period ending at 11:00 AM Eastern on January 30th. Siacoin has a market capitalization of $1.15 billion and approximately $33.57 million worth of Siacoin was traded on exchanges in the last day. In the last week, Siacoin has traded down 5.3% against the U.S. dollar. One Siacoin coin can now be bought for $0.0367 or 0.00000355 BTC on cryptocurrency exchanges including Upbit, BITHOLIC, Abucoins and Bittrex.\n\nHere is how other cryptocurrencies have performed in the last day:\n\nGet Siacoin alerts: Bitcoin (BTC) traded 7.9% lower against the dollar and now trades at $10,446.90 or 1.00000000 BTC. Ethereum (ETH) traded 6% lower against the dollar and now trades at $1,126.20 or 0.10874300 BTC. Bitcoin Cash (BCH) traded 7.4% lower against the dollar and now trades at $1,558.40 or 0.15047600 BTC. Litecoin (LTC) traded 6.7% lower against the dollar and now trades at $170.48 or 0.01646070 BTC. Monero (XMR) traded 8% lower against the dollar and now trades at $293.25 or 0.02831580 BTC. Ethereum Classic (ETC) traded down 10.1% against the dollar and now trades at $28.88 or 0.00278824 BTC. Bitcoin Gold (BTG) traded 7% lower against the dollar and now trades at $170.07 or 0.01642170 BTC. RaiBlocks (XRB) traded 26.4% lower against the dollar and now trades at $13.62 or 0.00131465 BTC. Zcash (ZEC) traded 9.8% lower against the dollar and now trades at $408.10 or 0.03940470 BTC. Steem (STEEM) traded 13.2% lower against the dollar and now trades at $5.20 or 0.00050195 BTC.\n\nSiacoin Profile\n\nSC is a proof-of-work (PoW) coin that uses the Blake2b hashing algorithm. It launched on June 6th, 2015. Siacoin's total supply is 31,396,146,174 coins. The Reddit community for Siacoin is /r/Siacoin and the currency's Github account can be viewed here. Siacoin's official Twitter account is @SiaTechHQ and its Facebook page is accessible here. Siacoin's official website is sia.tech.\n\nAccording to CryptoCompare, \"Sia is an actively developed decentralized storage platform. Users all over the world contribute disk storage from their computers to form a decentralized network. Anybody with siacoins can rent storage from hosts on Sia. This is accomplish via \"smart\" storage contracts stored on the Sia blockchain. The smart contract provides a payment to the host only after the host has kept the file for a given amount of time. If the host loses the file, the host does not get paid. The distrubuted nature of the Sia network enables many optimizations in latency, throughput, reliability, and security. The decentralized nature of the Sia network enables anyone with storage to get paid, lowering the barrier to entry and reducing the overall price of cloud storage. The Sia cryptocurrency is live! You can rent storage using siacoins and hosts providing storage to the network receive compensation in the form of siacoins. The storage platform itself is still in beta, and only uploads that are 500mb or less in size are supported by the wallet. \"\n\nBuying and Selling Siacoin\n\nSiacoin can be purchased on these cryptocurrency exchanges: Bisq, Abucoins, HitBTC, Poloniex, Bittrex, Upbit and BITHOLIC. It is not possible to purchase Siacoin directly using US dollars. Investors seeking to acquire Siacoin must first purchase Bitcoin or Ethereum using an exchange that deals in US dollars such as GDAX, Gemini or Coinbase. Investors can then use their newly-acquired Bitcoin or Ethereum to purchase Siacoin using one of the exchanges listed above.\n\nReceive News & Updates for Siacoin Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Siacoin and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.", "Cryptocurrency and precious metals exchange Coinsquare is taking steps toward its goal of leading the cryptocurrency exchange market in Canada. On February 20, 2018, it announced a new partnership with Processing.com, after wrapping up a recent investment of $30 million, for a total $47 million raised in the last four months.\n\nThe partnership with Processing.com will allow Coinsquare to facilitate instant fiat currency payments of digital currencies for the general public through debit and credit card transactions.\n\nIn a release, Processing.com's James Bergman said:\n\n\"We are very excited to partner with such a respected and fast-growing trading platform as Coinsquare. As digital currencies increasingly make their way into the mainstream conscious, service providers have a responsibility to ensure the broader public can access the rapidly growing blockchain ecosystem.\"\n\nMarketing Strategy\n\nBesides increasing its Canadian market share, Coinsquare also has plans to move on to establishing new exchanges internationally, initially in the U.S. and the U.K.\n\nCoinsquare CEO Cole Diamond acknowledges that he is continuing original owner Virgile Rostand's marketing strategy of emphasizing Coinsquare's Canadian foundations, with its economic and political stability and relatively light regulatory environment.\n\nDiamond said: \"Virgile Rostand, Coinsquare's founder, was an early industry pioneer and blue-chip banking industry veteran. He built a custom platform that is unrivaled in Canada, boasting extremely high security standards.\"\n\nCoinsquare is also continuing Rostand's unprecedented service to the French-speaking community.\n\nIn an interview with Bitcoin Magazine, Diamond noted: \"We are the only trading platform that we know of that has a French website. Five percent of our users view our website in French, and we have been commended for it and are proud of it.\"\n\nA recent review of exchanges by education website Blockgeeks, placed Coinsquare in the top 10 exchanges. Forex also reviewed Coinsquare and gave it a thumbs up.\n\nDespite positive reviews, however, there have been some dissatisfied customers who have voiced concerns on social platforms and below the Forex review. Common complaints cite long wait times, lost funds, high fees and a non-responsive staff. Comments on other sites also mentioned an unclear fee structure and lack of customer support. Coinsquare has not responded to request for comment from Bitcoin Magazine regarding these concerns.\n\nCanadian compliance expert, Amber D. Scott, CEO of Outlier Solutions told Bitcoin Magazine: \"With price volatility and a massive influx of new clients, most exchanges are likely having some growing pains and Coinsquare is likely no exception.\"\n\nDiversification as a Priority\n\nCoinsquare, based in Toronto, Canada, wants to diversify its business beyond cryptocurrency holdings.\n\nThe company already has its own mining operation with 2 MW of power and 1700 mining units in operation.\n\nThey are planning to invest in two more mines. Canada, particularly the province of Quebec, is attracting lots of interest from mining companies based on inexpensive electricity and cooler temperatures.\n\n\"Canada is about to become a central source,\" explained Diamond in a recent interview with Global News. \"I think there's definitely a rush happening now. I think we're going to have a significant amount of mining in the next few months.\"\n\nTrading precious metals is also a part of Coinsquare's diversified holdings. They trade in silver coins and silver and gold bars.\n\nCoinsquare is planning a Trading and Arbitrage division to take advantage of cross exchange and hedge opportunities.\n\nAlso in the works is the launch of CoinCap Funds, a group of funds focused on investments across the digital asset landscape.\n\nSecurity\n\nAccording to Coinsquare, they store 98 percent of their assets in cold storage and their trading platform is based on the same technology as that used by the NYSE.\n\nWhile Bitfinex and Coinbase announced recently they are adopting SegWit, Coinsquare does not have any plans to follow suit just yet.\"The decision to use Segwit is an ongoing discussion at Coinsquare and we are not for or against it at this time,\" said Diamond.\n\nMeanwhile, they are working on developing trading platforms for international markets and white labelling and licensing its technology for markets around the world.\n\nCoinsquare offers trading in Bitcoin, Bitcoin Cash, Ethereum, Dash, Dogecoin and Litecoin and has a special OTC service for those wanting to trade large amounts.\n\nScott is optimistic about the future for Coinsquare: \"At this stage, Canada has taken a relatively light touch from a regulatory perspective. This has been a boon for exchanges like Coinsquare in many ways. They've been able to focus on managing their risks and building their business, rather than fitting into paradigms that weren't built with them in mind.\" #cryptocurrencies #Coinsquare #exchange #canada", "A day of reckoning has arrived for digital currencies as lawmakers take aim at the innovative but largely unregulated technology undergirding e-money, and a barrage of class-action lawsuits batter companies already whipsawed by the dizzying rise and recent selloff of digital currencies.\n\nFederal and state regulators have hit at least four companies in recent weeks with charges that they'd made too-good-to-be-true appeals to consumers or sold securities improperly.\n\nA sharp slide in the price of bitcoin and other digital currencies has only hardened anger on social media among investors and speculators. Bitcoin edged up slightly to $7,600 or so Tuesday afternoon, still far less than half its peak on Dec. 19 of over $19,000.\n\n\"There are so many people who have been scammed,\" said Jasper D. Ward, a Louisville, Kentucky, attorney who represents clients in two class-action lawsuits against a British company, BitConnect, that until recently was valued at $4 billion but has largely halted activity.\n\nRegulators in North Carolina Jan. 11 ordered BitConnect to stop selling its products, and said the company targeted \"persons of limited financial means, and unsophisticated investors\" who would suffer particular hardship if their investments went down the drain. BitConnect did not immediately respond to a query.\n\nDrama over the plunge of digital currencies, and a lack of regulation around the way they are traded, unfolded on YouTube, in courtrooms and on Capitol Hill.\n\nHoled up in a hotel room in Myrtle Beach, S.C., an affiliate marketer who is not an employee of BitConnect, Trevon James, released a YouTube video Feb. 2 pleading with those who heeded his sales pitches to let him off the hook.\n\n\"I'm not guilty of anything. I'm affected by BitConnect closing the lending as much as anyone else,\" James said. \"The people that joined a month ago, two months ago, they are going to be pretty sour. And I can understand that.\"\n\nIn a Reddit forum discussing James' role in the collapse of BitConnect, an internet user who goes by Weyrleader threatened, \"There's people who lost everything because of your promotion and (are) going to be gunnin' for your ass.\"\n\nThe heads of the Securities and Exchange Commission and the Commodity Futures Trading Commission, which respectively regulate financial instruments with an eye toward protecting investors and markets, testified Tuesday before the Senate Banking Committee on how they are reshaping their agencies to address problems posed by fledgling digital currencies. The chairmen of both agencies acknowledged a struggle to keep pace.\n\n\"In short, the currently applicable regulatory framework for cryptocurrency trading was not designed with trading of the type we are witnessing in mind,\" SEC Chairman Jay Clayton said in prepared remarks.\n\nBoth agencies late last year smoothed the way for the trading of virtual currencies but in December also issued harsh warnings that smaller investors were the likeliest to jump into the untested waters and are the most at risk for fraud.\n\nAnother challenge, CFTC Chairman J. Christopher Giancarlo said Tuesday, is that some of the players in crypto currency don't fall into the same regulatory definition as companies that may trade in foreign currencies.\n\n\"Many of the internet-based cryptocurrency trading platforms have registered as payment services and are not subject to direct oversight by the SEC or the CFTC,\" Giancarlo warned.\n\nGiancarlo pointed out that digital currencies do not yet comprise a sizable part of the economy. He noted that, as of Feb. 5, the total value of all outstanding bitcoin was about $130 billion based on a Bitcoin price of $7,700. That cumulative bitcoin sum is less than the market value of all the outstanding shares in McDonald's.\n\nThe agency head put the total outstanding value of all virtual currencies at about $365 billion. By comparison, the total value of gold traded in the world is about $8 trillion.\n\nMany Americans who have bought digital currency expecting huge gains may be trying to ride out the roller-coaster valuations and the recent plunge, Giancarlo said.\n\n\"And in fact what we hear a lot of is people buying and holding. If you -- if you go on the Twitter universe, you'll see a phrase HODL, which means hold on for dear life,\" he said.\n\nVirginia Democratic Sen. Mark Warner became a millionaire by pioneering the cell phone business in the 1980s, a time when everyone was sure that he was wrong and cell phones were going to be a small business.\n\n\"I think we're looking at the same kind of transformation about to take place and we are going to have to wrap our arms around it,\" he said during the hearing.\n\nBoth agency heads agreed Congress must consider new cryptocurrency rules.\n\n\"The SEC has been slow to respond to this challenge but is now picking up the pace and may accelerate even faster in light of bitcoin's plunge,\" said John Coffee, a Columbia University law professor and a frequent congressional witness on securities matters.\n\nCoffee points to a number of enforcement actions by the SEC going after companies engaged in Initial Coin Offerings. That's where investors accept a digital coin or token and get an ownership stake in a business or portfolio of managed assets issued by an affiliated marketer of that coin or token.\n\n\"Often these tokens amount to securities because they make the investor a passive investor in a business run by the promoter,\" he said.\n\nThe SEC has brought legal action against four companies in the digital currency sector since last July, when it determined that coin offerings were akin to selling stock.\n\nJust a week ago, the SEC launched action against Dallas-based AriseBank, which was trying to raise $600 million from investors toward a goal of $1 billion. Regulators allege AriseBank's public sale began on Dec. 26 with a planned distribution of digital coins to investors on Feb. 10. These coins could be held over time and would hypothetically increase in value and be tradeable on a digital-trading platform.\n\nThe SEC determined this all amounted to the sale of unregistered securities, just as if someone with a private oil drilling company was offering shares of the company but failing to register for the authority to offer shares to the public.\n\nA court-approved emergency freeze on AsideBank's assets allowed the SEC to secure cryptocurrencies that included Bitcoin, Litecoin, Bitshares, Dogecoin and BitUSD, the agency said in a statement.\n\nThe CFTC normally regulates contracts, called futures, for future delivery of wheat, oil and other commodities. In 2015, it deemed virtual currencies to be a commodity. A year later it went after a bitcoin futures exchange that operated in the United States without CFTC registration. Then last December it allowed two commodity exchanges to begin offering contracts based on the future price of bitcoin.\n\nThe CFTC moved last year to shut down a Las Vegas business called My Big Coin Pay Inc., bringing charges of commodity fraud and misappropriation of $6 million. Investors thought they were investing in a digital currency that was back by gold, the agency said. The CFTC said Jan. 24 that it had charged the company with commodity fraud in a federal lawsuit.\n\nBitter investors, meantime, moved on their own against crypto-related businesses, filing lawsuits in California, Florida, and elsewhere.\n\nAmong those hit with a class-action suit was Paragon, a company catering to the marijuana industry that uses the blockchain technology that is the scaffolding for most digital currencies.\n\nA former Miss Iowa, Jessica VerSteeg, is a founder of the company, which was served with a suit Jan. 30 saying its initial coin offering that raised $70 million violated federal securities laws. Paragon did not immediately respond to a query.\n\nAnother company in the crosshairs of regulators, Dubai-based USI Tech Limited, promised investors that they would obtain a daily return of one percent.\n\nThe Texas Securities Commissioner issued a cease and desist order against the company Dec. 20, and noted that it had targeted investors using Craigslist ads, YouTube videos and standalone websites. A co-founder of the company, Horst Jicha, acknowledged in a talk Jan. 23 that he had made the decision to \"switch off\" operations in Canada and the United States but that he hoped to reopen in North America at some point.", "Electroneum, the exciting new mobile-based cryptocurrency, is set to be listed on KuCoin, one of the top exchanges in Asia.\n\nThis comes as Electroneum announces a partnership with QUOINE, showing that the team is taking expansion into the Asian markets seriously.\n\nKuCoin has a great reputation as a secure and technologically advanced exchange and should bring significant new market exposure to Electroneum. The Electroneum team will be working with KuCoin to promote the mobile-focused cryptocurrency across Asia using KuCoin's \"To The Moon\" marketing package, which is focused on introducing new users to trade Electroneum.\n\nRichard Ells, CEO of Electroneum, said:\n\nWe support 20 different languages but are only currently listed on English based exchanges. We've chosen the KuCoin marketing campaign package that has had the most dramatic effect on the price of other coins that have listed on KuCoin. They're also giving away a limited number of ETN in a special joint promotion, so if you don't have an account there yet - I recommend getting opening one. I'm confident this will greatly increase our exposure in Asia.\n\nThis will be welcome news for the Electroneum community, one of the largest cryptocurrency communities in the world. They will be able to confidently trade ETN on another secure and reliable exchange, and the coin will be exposed to huge numbers of cryptocurrency enthusiasts in Asia.\n\nWith exchange listings pending on some of the largest exchanges in the world and the recent news that Electroneum will be exhibiting at Mobile World Congress, the eyes of the cryptocurrency world will be carefully watching the British coin as it charts its course to mass user adoption.\n\nElectroneum is a brand new disruptive technology, combining blockchain, cryptocurrency and mobile ubiquity to make something entirely new.\n\nIt is designed entirely for mass adoption, aiming to be the largest cryptocurrency by user numbers during 2018. It has signed agreements in place with mobile telecoms providers giving Electroneum access to over 100m users.\n\nYou can find further details about Electroneum at https://electroneum.com and you can find live and historical coin price information here: https://coinmarketcap.com/currencies/electroneum/\n\nIn addition to the upcoming addition to KuCoin, Electroneum is also available to trade on Cryptopia here: https://www.cryptopia.co.nz/Exchange?market=ETN_BTC", "According to the website for the coin, Litecoin (LTC) holders will receive 10 litecoin cash (LCC) coins for each litecoin they own. The website also says that LCC will have lower transaction fees than LTC.\n\nBut other than just receiving free coins, there isn't a compelling reason to claim Litecoin Cash right now. We don't know what exchanges will support LCC trades.\n\nLater this week, we will have a detailed report examining the Litecoin hard fork and Litecoin Cash. To make sure it hits your inbox as soon as we publish it, sign up for our free Profit Alerts service.\n\nIn Bitcoin news, the tiny nation of Iceland is generating the most heat in the cryptocurrency space. A report from BBC indicates that Icelandic Bitcoin mining centers will use more electricity this year than all of the electricity its citizens will use to power their homes.\n\nMiners are on pace to use 840 gigawatt hours of electricity, outpacing the consumer demand of 700 gigawatt hours.\n\nIceland has a population of just 340,000 people.\n\nIceland's Bitcoin mining boom has been fueled (literally) by cheap electricity that is generated from renewable sources. The boom in miners has prompted political leaders from the nation's Pirate Party to suggest taxes on the profits of Bitcoin mining.\n\nBelow is a recap of the top cryptocurrency prices at 1:30 p.m. EST.\n\nNow that we know all of today's price movements, here's what has been moving these cryptocurrencies...\n\nOn Tuesday, the market capitalization of the global cryptocurrency sector hit $420.35 billion.\n\nBitcoin represented 34.9% of the total cryptocurrency market, with a market capitalization of $146.5 billion.\n\nThe best performers from the top 50 largest cryptocurrencies by market capitalization included ZClassic (up 32.04%), Revain (up 23.93%), Ethereum Classic (up 14.53%), Stellar (up 10.24%), Stratis (up 6.84%), Hshare (up 5.18%), Dogecoin (up 3.86%), and OmiseGo (up 1.27%).\n\nThe worst performers from the top 50 largest cryptocurrencies by market capitalization included U.CASH (down -44.24%), Populous (down -6.72%), Veritaseum (down -6.39%), Aeternity (down -6.18%), DigaxDAO (down -6.10%), Monero (down -3.60%), and Augur (down -3.34%).\n\nThe price of Bitcoin is still hovering under $8,700 on a day that had very few headlines.\n\nMany traders are suggesting that the $9,000 level is a key resistance point for Bitcoin.\n\nThe tech giant, which has already garnered headlines in the crypto space, hinted that it is exploring the use of the Bitcoin, Litecoin, and Ethereum blockchain technologies.\n\nOne prominent Wall Street analyst believes that a correlation exists between capital flows between gold and Bitcoin.\n\nRBC Capital Markets' Chris Louney said in a research note that it had been difficult to identify a \"tangible correlation\" between Bitcoin prices and gold prices in the past.\n\nHowever, Louney now says that at the end of the year, his firm began to notice a negative correlation between the two assets.\n\nDid you know we have a free research service that finds the most profitable opportunities in cryptocurrencies today?\n\nIt gives you real-time recommendations and price updates on only the best ways to make money now.", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nThe Lisk price surged more than 65 percent following its listing on Japan-based cryptocurrency exchange bitFlyer.\n\nWednesday has been brutal for the cryptocurrency markets. The Bitcoin price dropped below the $10,000 barrier, while the cryptocurrency market cap entered sub-$500 million territory for the first time since Jan. 17.\n\nOne token, however, bucked this trend and posted a strong advance against the dollar. Lisk, a blockchain platform that stores decentralized applications in sidechains (as opposed to the main blockchain, as Ethereum does), saw its price soar during intraday trading.\n\nShortly before 6:00 UTC, the Lisk price was trading at roughly $21.50 on Bittrex. At this point, it experienced a near-sudden spike, and within the span of 25 minutes, the Lisk price was valued at $36.27, which represented an increase of more than 65 percent. Just as quickly, however, the Lisk price dropped back below $30, but it continues to trade well above its previous level. At present, Lisk is valued at $26.56 on Bittrex, which represents a single-day increase of about 24 percent and translates into a $3.1 billion market cap.\n\nBinance accounts for a plurality of LSK trading, where the token trades against Bitcoin, while South Korea-based Upbit's LSK/KRW market provides Lisk with its largest fiat trading pair. Most of LSK's remaining volume is concentrated in BTC and ETH trading pairs.\n\nLisk's rally appears directly tied to the token's listing on bitFlyer, Japan's highest-volume cryptocurrency exchange.\n\nThe addition was notable -- and unexpected -- since the exchange previously only supported five altcoins: Ethereum, Ethereum Classic, Bitcoin Cash, Litecoin, and Monacoin.\n\nBeing listed on bitFlyer not only introduces Lisk to one of the world's largest cryptocurrency markets but also provides the token with a new fiat trading pair since bitFlyer supports JPY trading.\n\nThe listing appears to have strained bitFlyer's server capacity, as the exchange reported multiple outages in the hours immediately following the announcement that Lisk trading had gone live.", "Cryptocurrency is the buzziest tech sector around. It's also one of the least understood. Pair those two facts, and you'll understand what's driving the burgeoning cottage industry of online cryptocurrency analysts.\n\nWhat's a little tougher to understand is the method of compensation many of them rely on. Rather than opt for cryptocurrency-powered subscriptions, many crypto pundits are pointing their more obsessive YouTube, Discord or podcast audiences towards Patreon -- a subscription membership site that does not accept even bitcoin, the most common cryptocurrency.\n\nPatreon campaigns within this crypto-centric pocket ecosystem are working towards the creation of \"cryptocurrency education,\" \"cryptocurrency pro trading content & tips,\" \"cryptocurrency investing/trading charts and videos,\" and \"how-tos for making money in Bitcoin and other cryptocurrency.\"\n\nAll pages share the same legally protective mindset. \"I am not responsible for any trades made by members of the group. You are trading at your own risk,\" one page notes, while another drops all the niceties and just blares: \"NOTHING ON THIS CHANNEL CONSTITUTES ADVICE.\"\n\nSome of these crypto patreons have existed for years, while others have sprung into existence within the past twelve months. Business has been booming since December (though cryptocurrencies themselves are on a sharp downswing at the moment). MarQuis Trill, a social media star whose YouTube channel still primarily bills his content as consisting of \"Celebrity News | New Music | Pranks\" has nevertheless leveraged his influence into the Patreon account \"Cryptocurrencymember.\" According to the data-tracking site Graphtreon, it has grown from just two patrons on December 22, 2017 to 1,889 patrons as of a few days ago.\n\nHow much are they making? Patreon allows its creators to hide the dollar amounts they earn, and Data Dash, one of just a few crypto creators I found who hadn't hidden their Patreon earnings, currently earns $2,976 a month off of YouTube investment videos. Some earn less: One attempt at \"creating a Cryptocurrency Podcast Network\" makes eight dollars a month. Given the long tail of low-earning creators on Patreon, it's no wonder that plenty have just one supporter or earn $51 off of four supporters.\n\nMany likely earn more than they let on, however, as crypto investment advice is apparently valuable enough to command a high support tier. Creators who set their minimum support tier at $25 or $30 can earn a healthy living with fewer supporters. One creator with my favorite handle -- \"RollinInCrypdough\" -- has just 84 supporters, but they pay between $25 and $100 each. Ian Balina has 183 patreons and just two tiers: $1,000 for a weekly group video chat, and $2,500 for a weekly one-on-one. Noted paleo dieter Richard Nikoley offers crypto advice for $5 a month to more than 500 patrons.\n\nSo why are all these lovers of decentralized currency tying themselves to the same revenue source they're fighting to leave in the past?\n\nI'm glad you asked. Turns out there's a simple explanation for why cryptocurrency lovers aren't buying what they're selling.\n\nWhile I reached out to a wide assortment of crypto enthusiasts who were supporting their endeavors through Patreon, just one got back to me by the time this article was published: Romeo Hypeson of Crypto Hype, whose 126 patrons can subscribe for a minimum of $30 a month, likely netting Romeo at least $3,780 each month. He provided the reasoning behind opting to support cryptocurrency hype through a membership that relies on the normal kind of currency.\n\n\"I use Patreon membership to keep the value or price of entry the same,\" Romeo told me. \"If I charge in Cryptocurrency due to their volatility it won't be fair to both me and my Patreons because down the line crypto prices fluctuate.\"\n\nRomeo's got a point: Cryptocurrency is currently far to volatile to use for utility purposes. But the original vision behind its creation was just that. The more volatile cryptocurrencies and the blockchain tech they run on are, the less useful they become.\n\nThose who tackle cryptocurrency trading like stock traders or a comic book collector in the mid-90s are ruining it for the true believers. By chasing a speculative profit, they're driving the currency's value into a bubble, setting up an inevitable crash.\n\nGranted, I'm not revealing any secrets here.\n\n\"Bitcoin losing utility has singlehandedly created the scam market we're seeing right now,\" one commenter on Hacker News recently summed up.\n\n\"People who want to make money choose the most efficient way to make money. And if they can see that they could make more money by building productive things on top of Bitcoin instead of building their own scam coin or scam scheme to manipulate the idiots who fall for it, they would probably rather work on those instead. But that's not the case, which is why we are where we are.\"\n\nA focus on sky-high valuations may well have pushed crypto into a rarefied category alongside ED treatments and lottery tickets: The gold rush is attracting its share of scammers.\n\nOn one side are those baiting the hook for clueless people hoping to jump on a trend, like this fake website claiming Elon Musk is starting a Bitcoin trading venture.\n\nYou cannot make this stuff up. A Bloomberg article just served me a fake ad for a fake news story on a fake CNN Tech website about Elon Musk leaving Tesla to start a Bitcoin trading venture. pic.twitter.com/dxiMgQql4P\n\n-- Natasha Loder (@natashaloder) February 1, 2018\n\nOn the other end are crypto miners, who'll steal currency from its owners' unsecured computers. \"Mining for crypto is king right now,\" Tyler Moffitt, Webroot's Senior Threat Research Analyst, tells me. And the industry is rife with snake oil salesmen hoping to inflate the bubble ever bigger, a phenomenon Wired's Erin Griffith covered last week in an article that looked at a staged debate that doubled as an exercise in crypto recruitment.\n\nBy now, the fact that cryptocurrency is suffering from fluctuation that could undermine its entire purpose is a concern well-known enough that those hoping to get their own cryptocurrencies or tokens off the ground are addressing it head first.\n\n\"Those who treat tokens like stocks - buying and selling for speculative profit - do not represent even a portion of the real potential value,\" a pitch sent to me by the bitcoin-for-dentists currency Dentacoin asserts.\n\nBut as negative as I may be coming across about the crypto sector, I don't doubt that some of the crypto enthusiasts on Patreon truly believe that it is the deregulated future. I also believe that some of them don't, and that it's pretty tough to differentiate the two.\n\nJust one thing's for sure: As the numerous Patreon accounts powering many crypto enthusiasts' YouTube punditry indicate -- and as Romeo confirms -- even the sector's loudest voices know that cryptocurrency is, overall, too risky to treat as an actual functional currency.\n\nBlockchain tech, any cryptocurrency enthusiast or expert will gladly tell you, is going to change the economic landscape in ways that we can't yet fathom. I believe it. I'm just not sure that's a good thing.", "LONDON, February 15, 2018 /PRNewswire/ --\n\nIt's no secret that crypto incubators and hedge funds get access to the best deals because of their inside connections. But, now, for a short time there is a way for regular investors to ride on the coat tails of one of the most connected teams in crypto. Right in your brokerage account. Included in today's commentary: Advanced Micro Devices Inc (NASDAQ: AMD), Intel Corporation (NASDAQ: INTC), Microsoft Corp (NASDAQ: MSFT), Bank of America Corp (NYSE: BAC), Nvidia Corporation (NYSE: NVDA).\n\nIn short: The team behind Global Blockchain Technologies (BLOC; BLKCF) could be one of the best ways to play the crypto boom.\n\nThe company is the world's first blockchain private equity fund, an incubator for new crypto up-and-comers.\n\nMost importantly, it's overseen by the co-founder of Ethereum, Steven Nerayoff.\n\nHe's as connected as they come... and helped Ethereum go from zero to over $100 BILLION.\n\nNot only does the Global Blockchain team invest in the best, brightest and most profitable crypto projects. It also incubates new and upcoming crypto and blockchain firms.\n\nBlockchain technology is set to revolutionize every major industry. It's time for smart investors to pay attention and Global Blockchain (BLOC; BLKCF) is the perfect place to start.\n\n#1 How Does Global Blockchain Get the Blockchain Projects?\n\nBlockchain technology is used in the crypto-currency world. It allows cryptos to bypass traditional middle-men (banks, financial firms, hedge funds) and sets up secure, linked interactive collaborative networks for the quick and easy flow of information and money.\n\nBitcoin may be a bubble, but blockchain is going to disrupt everything. In financial services alone it's being applied in brokerages, exchanges, merchants, middleware... and much more.\n\nGlobal Blockchain gives investors exposure to this booming industry. The company has built a basket of crypto-currency and blockchain investments.\n\nThe company's team of blockchain experts choose 12 or more crypto-currency tokens to incubate and will take equity and a percentage of the founder's tokens in return.\n\nIn some cases, the only way to get access to the value of these tokens early is to invest in Global Blockchain. The team at Global Blockchain knows the token world inside and out.\n\nSteve Nerayoff was a senior adviser for the crypto-currency Ethereum when it was first launched: since then, the currency has risen 94,000 percent. Nerayoff also designed the Ethereum crowdsale, which funded the project, and went on to advise Lisk crypto-currency, now with a market cap of $526 million.\n\nPresident Shidan Gouran is a blockchain expert with a long track record of spotting successful crypto-currencies.\n\n#2 They Make the Investments\n\nLast year, crypto-currencies and blockchain stocks burst on to the scene, taking investors by surprise. Now, everyone wants to get in on the action.\n\nBut investing in crypto currencies can be dangerous. Different coins are highly volatile, and values can change in the blink of an eye.\n\nGlobal Blockchain (BLOC; BLKCF) invests in a basket of holdings in the Blockchain space, giving it smart exposure to the entire sector.\n\nIn return for incubating specific tokens, Global Blockchain receives equity, allowing it to profit down the line as the token picks up value.\n\n#3 The BLOC Strategy\n\nRight now, some very large crypto-currency tokens are hogging the spotlight.\n\nBitcoin has a market cap of $157 billion, while Ethereum comes in at $109 billion and Ripple at $38 billion.\n\nBut there's still lots of room for growth. The amount of the world's wealth held in crypto-currency is very, very small: less than 0.5 percent.\n\nWhile these larger, more expensive cryptos get all the attention, there's real potential in medium and small cap tokens.\n\nSmaller coins bring higher returns. Verge, a crypto with a market cap of $864 million, has delivered a ROI of 203,049 percent to its investors.\n\nOther tokens, like PIVX, Einsteinium, ReddCoin and Stellar are also high earners: they've all brought ROIs of more than 10,000 percent.\n\nIn fact, the average price gains from the top ten small-cap tokens is more than 30,000 percent!\n\nGlobal Blockchain (BLOC; BLKCF) goes after these types of small cap currencies.\n\nAnd the insights of the company's team gives them the experience to choose the tokens most likely to have success, sifting through the hundreds of small cap tokens.\n\n#4 Securing Start-Ups\n\nGlobal Blockchain (BLOC; BLKCF) has also positioned itself as an incubator for token start-ups.\n\nAs the only \"crypto hedge fund\" in the business, it can get in on the ground floor with tokens before they reach the ICO stage.\n\nFor example: Global Blockchain was one of the first buyers of Kodak Coin, a brand-new token from the legendary camera and film company.\n\nGlobal Blockchain was offered 8 million KodakCoins as part of a pre-ICO sale, which the company secured at a huge discount for only $2 million.\n\nIn connection to its KodakCoin investment, Global Blockchain is partnering with Overstock.com and its subsidiary tZero to facilitate the KodakCoin ICO.\n\nWith tZero setting up a secure platform for KodakCoin, which will make the token more readily available and compliant with SEC regulations, Global Blockchain is to provide advisory services.\n\nThe platform will provide a secure way to facilitate ICOS in a way that is regulated and secure.\n\nAnd with each innovation, BLOC stock ticks higher and higher.\n\n#5 Major Opportunity\n\nThe crypto market realized huge gains in 2017. And it's just getting started.\n\nLarge cap tokens like Ethereum, small-caps like Verge, and start-up ICOs like KodakCoin are revolutionizing the international financial system.\n\nAnd Global Blockchain (BLOC; BLKCF) is one company that has the expertise, the strategy and tools available to make that value accessible for the investor.\n\nThe exposure gained from Global Blockchain's diverse portfolio and its stake in new crypto start-ups allows it to offer opportunities that investors can find nowhere else.\n\nDon't miss out on the blockchain revolution... especially when you can get exposure to experience, tokens and projects with one simple stock investment in Global Blockchain (BLOC; BLKCF).\n\nBy. Joao Piexe\n\nHonorable Mentions:\n\nAdvanced Micro Devices Inc (NASDAQ: AMD) is Nvidia's biggest competitor. The company has developed a cult following among gamers, leading to many a Reddit debate. AMD's groundbreaking technology not only rivals that of Nvidia, some even argue that it outperforms it. As the two square off, one of the key areas to keep an eye on is in the GPU race.\n\nIntel Corporation (NASDAQ: INTC) is a leader in multiple fields of technology. The forward-thinking industry giant is the backbone of many laptops and PCs running the Windows operating system. The company has been so successful in its deal-making and advertising that it is impossible to escape its influence.\n\nMicrosoft (NASDAQ: MSFT) is one of the most innovative and well-known companies within the tech sector, but with its Xbox video game system, the company has made waves in the gaming world. Microsoft's Xbox Live gave gamers a way to communicate, face off, or make purchases on an entirely new platform.\n\nBank of America Corp (NYSE: BAC) One of the biggest bankers in the U.S. is embracing the revolution in artificial intelligence. Along with 'big data,' AI, and blockchain tech will completely change the way markets are monitored, assets are managed, and trades performed.\n\nNvidia Corporation (NYSE: NVDA): Nvidia is one of the hottest stocks on the market right now, and the top performer across the entire S&P 500. This stock has gone in only one direction-up. NVDA designs graphics processing units for the gaming and professional markets, as well as system on a chip units for the mobile computing and automotive market. Nvidia's chips are the best out there-at least the fastest.\n\nBy. Ian Jenkins\n\n**IMPORTANT! BY READING OUR CONTENT YOU EXPLICITLY AGREE TO THE FOLLOWING. PLEASE READ CAREFULLY**\n\nForward-Looking Information\n\nThis news release contains \"forward-looking information\" within the meaning of applicable securities laws. Forward-looking information includes, but is not limited to the rate of cryptocurrency and blockchain technology adoption and the resultant effect on the growth of the global cryptocurrency and tokens market capitalization; Global Blockchain Technologies Corp.'s (\"BLOC\") anticipated ability to reduce risk for investors and give investors exposure to a broad cross-section of the blockchain ecosystem; BLOC's projected asset allocations, business strategy and investment criteria, including the anticipated contributions of BLOC's incubator program; the expected strengths and contributions of BLOC's management and advisors; and the rate of cryptocurrency adoption and the resultant effect on the growth of the global cryptocurrency market capitalization.. These forward-looking statements are subject to known and unknown risks and other factors that may cause the actual results of BLOC to be materially different from those expressed by such forward-looking information, including but not limited to: risks related to changes in cryptocurrency prices; the estimation of personnel and operating costs; that BLOC will receive required regulatory approvals; the availability of necessary financing; permitting of businesses that BLOC intends to invest in; general global markets and economic conditions; uninsurable risks; risks associated with currency fluctuations; risks associated with competition faced in securing experienced personnel; risks associated with changes in the financial auditing and corporate governance standards applicable to cryptocurrencies and ICO's; risks related to potential conflicts of interest; the reliance on key personnel; financing, capitalization and liquidity risks including the risk that the financings necessary to fund continued development of BLOC's business plan may not be available on satisfactory terms, or at all; the risk of dilution through the issuance of additional common shares of BLOC; the risk of litigation; the risk that BLOC's management and advisors may not contribute as much as expected to the company's success; the risk and the risk that cyber-crime may severely damage the value of any or all of BLOC's investments. There may be many other factors that cause results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information.\n\nBLOC has no assets except cash from a recently closed financing and this article is based on the business plan of BLOC which at this point is purely conceptual in nature. There is no assurance that the business plan will be implemented as set out herein, or at all.\n\nDISCLAIMERS\n\nPAID ADVERTISEMENT. This communication is not a recommendation to buy or sell securities. This communication is for entertainment purposes only. Never invest purely based on our communication. Gains mentioned in our newsletter and on our website may be based on end-of- day or intraday data. In most cases we are paid by the issuer or a third party to profile the issuer. In this case, BLOC is paying to Safehaven.com eighty thousand US dollars for this article and certain banner ads. We have not investigated the background of BLOC. The third party, profiled company, or their affiliates may liquidate shares of the profiled company at or near the time you receive this communication, which has the potential to hurt share prices. Frequently companies profiled in our alerts experience a large increase in volume and share price during the course of investor awareness marketing, which often end as soon as the investor awareness marketing ceases. The investor awareness marketing may be as brief as one day, after which a large decrease in volume and share price is likely to occur.\n\nWe do not guarantee the timeliness, accuracy, or completeness of the information on our site or in our newsletters. The information in our communications is not researched or verified in any way whatsoever to ensure the available information is correct.\n\nDISCLOSURE. Safehaven.com, Advanced Media Solutions Ltd, and their owners, managers, employees, and assigns (collectively \"the Company\") does not make any guarantee or warranty about what is advertised above. The Company is not affiliated with, any specific security.\n\nSHARE OWNERSHIP. The owner of Safehaven.com owns shares of this featured company and therefore has an additional incentive to see the featured company's stock perform well. The owner of Safehaven.com will not notify the market when it decides to buy more or sell shares of this issuer in the market, but will not trade on material information that has not been disclosed to the public. The owner of Oilpatch.com will be buying and selling shares of this issuer for its own profit. This is why we stress that you conduct extensive due diligence as well as seek the advice of your financial advisor or a registered broker-dealer before investing in any securities.\n\nNOT AN INVESTMENT ADVISOR. The Company is not registered or licensed by any governing body in any jurisdiction to give investing advice or provide investment recommendation. ALWAYS DO YOUR OWN RESEARCH and consult with a licensed investment professional before making an investment. This communication should not be used as a basis for making any investment.\n\nINDEMNIFICATION/RELEASE OF LIABILITY. By reading this communication, you agree to the terms of this disclaimer. You further warrant that you are solely responsible for any financial outcome that may come from your investment decisions.\n\nPAST PERFORMANCE IS NOT INDICATIVE OF FUTURE RESULTS. Investing is inherently risky. Don't trade with money you can't afford to lose. This is neither a solicitation nor an offer to Buy/Sell securities. No representation is being made that any account will or is likely to achieve profits or losses similar to those discussed on this web site.\n\nDISCLAIMER: Safehaven.com is Source of all content listed above. FN Media Group, LLC (FNM), is a third party publisher and news dissemination service provider, which disseminates electronic information through multiple online media channels. FNM is NOT affiliated in any manner with Safehaven.com or any company mentioned herein. The commentary, views and opinions expressed in this release by Safehaven.com are solely those of Safehaven.com and are not shared by and do not reflect in any manner the views or opinions of FNM. FNM is not liable for any investment decisions by its readers or subscribers. FNM and its affiliated companies are a news dissemination and financial marketing solutions provider and are NOT a registered broker/dealer/analyst/adviser, holds no investment licenses and may NOT sell, offer to sell or offer to buy any security. FNM was not compensated by any public company mentioned herein to disseminate this press release.\n\nFNM HOLDS NO SHARES OF ANY COMPANY NAMED IN THIS RELEASE.\n\nThis release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E the Securities Exchange Act of 1934, as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may\", \"future\", \"plan\" or \"planned\", \"will\" or \"should\", \"expected,\" \"anticipates\", \"draft\", \"eventually\" or \"projected\". You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors, and other risks identified in a company's annual report on Form 10-K or 10-KSB and other filings made by such company with the Securities and Exchange Commission. You should consider these factors in evaluating the forward-looking statements included herein, and not place undue reliance on such statements. The forward-looking statements in this release are made as of the date hereof and FNM undertakes no obligation to update such statements.\n\nContact Information:\n\nMedia Contact: FN Media Group LLC\n\ne-mail: editor@financialnewsmedia.com\n\nU.S. Phone: +1(954)345-0611\n\nSOURCE Safehaven.com", "The weekend was a sombre affair for bitcoin miners and traders in India. On Saturday, it became public that authorities from the tax department had started sending notices for tax evasion to those involved in the bitcoin trade. A few hours later, there were reports of a handful of crypto-platforms complaining of having their bank accounts blocked. Platforms banking on current accounts from HDFC Bank, State Bank of India, and ICICI bank tweeted that access to their services were down.\n\nIn the latest of moves to follow, the Registrar of Companies has now refrained from registering crypto-currency platforms from registering under the companies Act 2013. If that reads like too much of a pressure on bitcoin platforms, then you must read this again.\n\nThe Registrar of Companies, that operates as a department under the ministry of corporate affairs, has specifically asked for an undertaking from software companies that they are information technology companies per se and dealing only with software and not cryptocurrencies. The department has followed this approach in a few cases, and hence software companies that do not have any dealing with crypto-currency are out of the ambit for the time being now.\n\nBusiness Standard published a report quoting a registrant, saying, \"\"I tried to register my company in December, but the RoC didn't accept my request. The company's name had the term 'bitcoin' and the RoC said it wouldn't support it.\"\n\nThe department may have a tough time in gauging which software company is offering only consultancy or software services and not bitcoin trading, because a good number of software companies have started blockchain as a practice. For instance, IBM, Infosys, Capgemini, L&T Infotech, PriceWaterHouse Coopers, and even Microsoft have a blockchain practice. These companies do not have a trading portal per se, but do offer blockchain as a service.\n\nThe way Indian authorities have reacted to bitcoin and how each department has started targetting the bitcoin trade does not appear surprising. Such practices are similar even in places such as South Korea and China. The regulator has plans to make sure local banks only allow accounts by a user's real name in cryptocurrency transactions starting from January 30.\n\nYou don't need to guess which department may come out with a policy that will prompt banks from denying services to users who do not have their \"real\" names as their banking User IDs in India. Considering the rising popularity of bitcoins in India, you should certainly think of having your banking user ID changed (even if you do not transact in Bitcoins), for instance from \"Maverick\" to the real name, as it appears on your Aadhar Card, or PAN card or Driving License or Marriage Certificate, or School Leaving Certificate. Customers do have wide-ranging options to decide from their KYC documents.\n\nThe price of one bitcoin has slipped from $12956 on January 20 to 10299.81 on Tuesday. There is logic in the belief that a potential sell-off could occur, in the event countries like South Korea and India continue with their enforcement drives.\n\nWILL IT HOLD AT $8000?\n\nSify.com analysed the top hundred crypto-currencies, and only six of them returned positive numbers on Tuesday. Tether was up by 0.59%, Walton by 1.59%, PIVX by a whopping 32.76%, Cindicator by 4.36%, Cryptonex by 36.51%, and Sirin Labs Token by 0.68%. Of these the only ones you should even seriously consider is Cryptonex, considering it is the only one of the six that is a mineable crypto-currency. The rest are flavours that you could only trade in.\n\nThe negative list saw popular names such as Ethereum (down by 10.22%), Ripple (down by 9.23%), Bitcoin Cash (down by 12.13%), Cardano (down by 9.58%). The total market capitalisation of these five popular flavours runs into nearly $362 billion. Catch this for a trivia, UAE's GDP in 2016 was calculated at $348.7 billion, Austria recorded a GDP of $386.4 billion, Norway recorded $370.6 billion.\n\nA total shutdown in South Korea could evict nearly 4% from the grid, or a 20% dip in terms of valuations. South Korea contributes nearly 4% of the total bitcoin transactions by value. There is a lack of data on how many Indians account for bitcoin transactions, but we do pay a premium - sometimes as high as 20% for transactions. Considering this, an enforcement scare should result in values eroding by as much as 20%.\n\nA simple analysis tells one that a correction of at least 20% could get the bitcoin grounded at figures of $8319.2 (comparing with Tuesday spot price on Coindesk). The bitcoin has had days when it has dipped by a whopping 40%, so falling flat 20% shouldn't be something new to the cryptocurrency. But this analysis is true only if supply-demand in Europe and US remain unchanged, which appears a remote possibility.\n\nCrypto-currencies have had a tough time around the month of January, but with over a week to go, it will be interesting to speculate how political moves can influence the bitcoin. Would it hold up to $8000 levels or will we see more of such actions to force them into oblivion?", "Cryptocurrencies are the latest craze sweeping the world, and it's not just average Joes dropping their life savings for a piece of the action. Some of the most popular people in the world have used their money, celebrity, and immense social media followings to invest in or endorse cryptocurrency-based businesses and services.\n\nA lot of the celebrity support for cryptocurrencies revolves around the Initial Coin Offerings (ICO) the cryptocurrency startups create. An ICO is a fundraising event where a cryptocurrency sells a percentage of that currency, in the form of tokens, to people in exchange for money to help get the cryptocurrency off the ground. A few words of praise from certain celebrities have helped numerous cryptocurrencies earn millions of dollars in funding.\n\nActors, musicians, athletes, and entrepreneurs have all been drawn to the allure of cryptocurrencies. These are some of the most notable celebrity endorsements.\n\n50 Cent\n\nNo rapper has benefited from the rise in popularity of cryptocurrencies like 50 Cent. In an effort to stay current with how his fans purchase music, 50 Cent accepted bitcoin purchases of his 2014 album Animal Ambition. He received 700 bitcoins, which were valued at $660 each, at the time, and admits he forgot about the stash. Once each bitcoin's value exploded in 2017 to a record high of $19,850 in mid-December, his forgotten stash rose in value to as high as nearly $14 million. When 50 celebrated his new fortune in January, the value had dropped to $10,000 per bitcoin, enough for a nearly $8 million haul.\n\nNas\n\nNas was a celebrity endorsing cryptocurrency before it became a fad. He invested in bitcoin digital wallet Coinbase in early 2014. Months later in a August 2014 interview, Nas proclaimed that bitcoin had the potential to be \"as big, if not bigger, than the Internet.\" A few months later, the Illmatic rapper informed his millions of fans on Facebook that he would be rewarding bitcoins to those with the highest scores on his Nas trivia contest at The Rap Test website. At the time of the August 2014 interview, the legendary lyricist claimed he and his team had been collecting bitcoins for over a year, when the price of a bitcoin hovered between $100-$1,000. At the time of press, each bitcoin is worth roughly $8,000, which would net the multi-millionaire rapper a hefty sum of money if he kept a large enough number of bitcoins in his stash.\n\nRichard Branson\n\nRichard Branson, the Virgin Group founder trying to make commercial space flights a reality, rarely does anything less than epic. His love of cryptocurrency is no different. He invested $30 million into bitcoin startup Bitpay in 2014. Before that, he announced he would accept bitcoins as a form of payment for tickets on his upcoming commercial space travel service Virgin Galactic, in late 2013. Branson received six bitcoin purchases for tickets only a few months after that announcement. Later in 2014, the multi-billionaire voiced his immense satisfaction in Bitcoin's future in a September 2014 interview. His cryptocurrency support hasn't wavered over the years, with Branson investing in bitcoin service provider Blockchain last year.\n\nAshton Kutcher\n\nThe That 70s Show star has had a complicated, but profitable relationship with technology over the last decade. He portrayed Steve Jobs in a film, and was an early investor in Airbnb and Uber. One of his early hits was in cryptocurrency, and it's starting to pay off. Kutcher is one of the earliest celebrities to the cryptocurrency craze, tweeting about Ethereum in May 2014, more than a year before its initial release in July 2015. Ethereum is now one of the biggest cryptocurrencies in the world, with one Ethereum valued at more than $830, at the time of press. Kutcher also invested in Bitcoin processing service Bitbay, and regularly updates his 19 million Twitter followers about the latest Bitcoin news.\n\nKaty Perry\n\nBack in November 2017, Katy Perry shared with her more than 68 million Instagram followers how she got some cryptocurrency advice from one of the best people to get any financial advice from: Warren Buffett. It wasn't long after her meeting with Buffett that Perry became a cryptocurrency supporter. In January, she posted on Instagram what may be the prettiest advertisement for cryptocurrency to date, embroidering her nails with the logos of five cryptocurrencies. Tweeting about how much you love bitcoin is one thing. Decorating your nails with the logos of five of the most popular cryptocurrencies in the world is a different level of crypto dedication.\n\nFloyd Mayweather\n\nFloyd Mayweather is synonymous with two things - money, and winning. Now, he may be one of the most active celebrity endorsers in the cryptocurrency market. In July 2017, Mayweather endorsed the ICO for blockchain prediction platform Stox.com. A month later in August 2017, the undefeated pugilist promoted the ICO for a blockchain-based content marketplace known as Hubii Network. Then, in September 2017, Mayweather signed on to being the brand ambassador for cryptocurrency platform Centra. Mayweather's endorsement is as good as his right jab, with Centra raising more than $30 million weeks after Mayweather's endorsement. No wonder the revered boxer has referred to himself as \"Crypto Mayweather.\"\n\nDJ Khaled\n\nDJ Khaled's greatest talent is promotion. He can make any mundane meetings feel like the Super Bowl with his boisterous personality and grandiose descriptions of everything. Just like Mayweather, Khaled used his social media promotional prowess to endorse the potential of cryptocurrency platform Centra. In September 2017, Khaled bragged to his more than 12 million followers on Twitter and Instagram about having a \"titanium centra debit card\" from Centra. A month later in October 2017, he posted a video on his Instagram page showing off the features of Centra Wallet app on his iPhone, a few weeks after the app hit the Apple Store.\n\nMike Tyson\n\nUnlike most celebrities whose cryptocurrency endorsements don't extend beyond a few social media posts, Tyson tied Bitcoin directly to his brand. In late 2015, Tyson partnered with Bitcoin Direct to release Bitcoin ATMs branded with the fighter's ferocious image. Months later in January 2016, Tyson and Bitcoin Direct announced the former heavyweight champ would get his own digital Bitcoin wallet where people can buy and exchange cryptocurrency directly form the app.\n\nJamie Foxx\n\nJamie Foxx has given a few technology endorsements over the years, including a backpack with built-in speakers, and Verizon Wireless. So, it's not a big surprise that the 50-year old comedian has got in on the cryptocurrency craze. Foxx promoted his participation in the ICO of cryptocurrency exchange platform Cobinhood to his more than four million followers on Twitter in September 2017. Cobinhood raised nearly $10 million mere weeks after Foxx's endorsement. Not bad for a few minutes of typing a tweet.\n\nEditors' Recommendations How to trade bitcoin for other cryptocurrencies Ethereum vs. bitcoin: What's the difference? Banks ban Bitcoin credit card buys as cryptocurrency crash continues An estimated $30 billion in Bitcoins may be lost forever What is Ethereum?", "Texas securities regulators are continuing to crackdown on unregistered companies with opaque business practices selling investments tied to cryptocurrencies.\n\nTexas Securities Commissioner Travis J. Iles issued on Feb. 2 an emergency cease-and-desist order against a company dubbed DavorCoin to stop its \"illegal and fraudulent offers of a different lending scheme,\" according to a news release. It's the fourth emergency action the Texas State Securities Board has taken against such firms, and the orders are part of the agency's \"ongoing investigation\" into the cryptocurrency market, Robert Elder, spokesman for the Texas State Securities Board, said Monday via email.\n\nBefore buying in to \"the hype surrounding cryptocurrencies\" investors should make sure they know exactly what they're investing in, Iles advised in the news release on DavorCoin.\n\n\"Promoters of fraudulent securitized cryptocurrencies are using technology in a way that conceals their identity and their actions,\" he said in the release. \"Ultimately, investors are investing in nothing more than a promise made through a website maintained by an anonymous group.\"\n\nDavorCoin is allegedly telling investors they can earn a profit by investing in a lending platform based on \"a new cryptocurrency known as davorcoin,\" the release says. An investor would purchase the davorcoin, and then lend it to the firm, the release says.\n\nBut DavorCoin didn't make it clear how it will generate profits for those who invest, the Texas State Securities Board said in its release.\n\nThe company also doesn't say who its principals are or where its place of business is, \"claiming instead that 'due to tax and regulation risks,' it 'cannot officialize its domiciliation,'\" according to the release.\n\nDavorCoin could not be reached for comment.\n\nLast month the regulators issued cease-and-desists order against Hong Kong-based R2B Coin, and United Kingdom-based BitConnect. In December regulators issued an order against Dubai-based USI-Tech.\n\nAfter BitConnect announced in January it was shutting down its \"lending and exchange platform,\" DavorCoin appeared to step up its efforts, according to the release.\n\nDavorCoin is an unregistered firm, and its affiliates, who are also unregistered, are selling securities, according to the release.\n\n\"It's a recent issue for kind of everyday Texas investors,\" Elder previously told the Express-News.\n\nThe \"volatility\" in the price of bitcoin has attracted the attention of the press and the financial marketplace, Elder said, and companies are trying to take advantage of the \"mania over price and the promise of cryptocurrencies.\"\n\n\"When they start to target specifically Texas investors through websites, Craigslist ads, YouTube channels, multi-level marketing sales strategies, when it hits that area where you see companies come out of the woodwork to try to attract Texas investors in these ways, that's when we feel we have to take action, let investors know what deficiencies these companies have,\" Elder said last month.\n\nMarketing cryptocurrency-based investments has \"exploded in recent months,\" Elder added Monday via email, \"primarily due to the attention paid to price spikes, and declines, of Bitcoin.\"\n\n\"The companies we have entered orders against are overseas entities who provide very little information about themselves,\" Elder said. \"It's not possible to tally losses.\"\n\nLast week Facebook said it had created a new policy banning ads which \"promote financial products and services that are frequently associated with misleading or deceptive promotional practices, such as binary options, initial coin offerings and cryptocurrency.\"\n\n\"There are many companies who are advertising binary options, ICOs (Initial Coin Offerings) and cryptocurrencies that are not currently operating in good faith,\" Facebook said.\n\nThe Texas Department of Banking also recently went after a cryptocurrency-related business in January, issuing a cease-and-desist order against AriseBank, which claimed to be a \"cryptocurrency bank.\"", "Having struggled to find acceptance above the $500 billion mark, the total value of all cryptocurrencies is set to end the week with moderate losses.\n\nThe figure hit a low of $422 billion earlier today as bitcoin, the world's largest cryptocurrency by market capitalization, fell to an eight-day low of $9,593.\n\nHowever, as of writing, bitcoin is trading at $10,300, according to CoinMarketCap. Meanwhile, the total market capitalization stands at $445 billion - still down 8.26 percent from last Friday's high of $485 billion. Furthermore, the total value has dropped 14.32 percent from the weekly high of $519.42 billion (seen on Feb. 18).\n\nBitcoin looks set to end the week on a flat note, given the cryptocurrency had closed last Friday at a similar level of $10,233.90. Out of the top 25 cryptocurrencies by market capitalization, the majority are reporting losses on a weekly basis. That said, small caps like nano, ethereum classic and vechain have managed to etch out gains.\n\nNano (formerly known as raiblocks) is a bitcoin competitor with claimed infinite scalability and no fees. The cryptocurrency clocked a 10-day high of 0.00010955 BTC today. Nano wallet for Android went live in beta this week, although it is unclear if the news has driven nano prices higher.\n\nETC, the native currency of the ethereum classic blockchain, had risen to $42.85 on Bitfinex earlier this week - its highest level since Jan. 15. The cryptocurrency fell to $29.95 yesterday, amid a general market drop. However, the dip was short-lived, and ETC has appreciated by more than 10 percent in the last 24 hours.\n\nAn ethereum classic hard fork called \"callisto\" (CLO) is reportedly due next week and holders of ETC at the time of the fork will receive CLO coins at a ratio of 1:1. Thus, the lure of making free money just by keeping the cryptocurrency in a blockchain wallet could keep it solidly bid in the next week.\n\nVechain's VEN token is the third biggest gainer among the top 25 cryptocurrencies for the second week. It was also the best performing cryptocurrency in January. A look at the VEN/BTC chart shows, the cryptocurrency is beginning to capitalize on the bull flag breakout witnessed on Feb. 15.\n\nLisk (LSK) topped out at $33.79 on Feb. 17, according to Bittrex, and fell sharply after the team behind the blockchain relaunched the project on Feb. 20. The cryptocurrency had rallied sharply in the run-up to the relaunch date, and the losses may be merely part of the wider market dip. Bittrex data shows the cryptocurrency is currently trapped between the 50-day moving average ($24.89) and the 100-day moving average ($18.96).\n\nNEM's XEM is trading below the 200-day moving average on Bittrex and ranks second on the list of losers among the top 25 cryptocurrencies. The cryptocurrency was the second biggest loser last week. Recently, it was notably involved in a theft, when hackers stole over $500 million-worth of the digital asset from Japanese crypto exchange Coincheck, though prices suffered little as a result.\n\nComing bottom in the top 25 this week is tron, which registered an 18 percent drop. As of writing, though, Tron (TRX) is up 4 percent against the greenback and the hourly chart (prices via Bittrex) shows the bullish price-relative strength index (RSI) divergence is behind the recovery from the weekly low of $0.03825.", "The start of 2018 wasn't particularly auspicious for cryptocurrencies...to say the least. The value of the market dropped by a whopping $93 billion, to hit a low of $276 billion on February 6, well off the all-time high of $834 billion reached in the early days of January.\n\nBitcoin for example, the world's biggest virtual currency by market capitalization, lost about 25% in January, its biggest monthly percentage decline in three years, amid increased fears over regulatory scrutiny in the U.S. and Asia. Despite its modest recovery in recent days, Bitcoin prices remain down about 18% since the start of 2018.\n\nBitcoin isn't the only mainstream cryptocurrency to endure a rough start to the new year. For instance, Ripple, the third biggest cryptocurrency in terms of market cap, has declined 55% since January 1, making it one of the worst performing digital currencies of 2018.\n\nThat follows a banner year in 2017, in which Bitcoin soared a whopping 1,320%, while Ripple scored a jaw-dropping gain of 36,000%.\n\nStill, not all coins have endured the wrath of sellers, with some of the more resilient names, covered below, catching many crypto traders and investors by surprise. In this post we take a look at the five best performing cryptocurrencies so far in 2018. Most interesting, perhaps, is that many of last year's top performers are absent from this list.\n\nIn order to filter the 1,500+ coins which currently exist in the cryptospace, we decided to focus only on digital currencies with a market cap of greater than $1 billion, which left a total of 26 coins.\n\nAfter starting the year at $2.2900, VeChain soared to an all-time high of $9.7000 on January 22. It has since pulled back to $6.4320 for a year-to-date gain of 160%, earning it the title of best performing digital currency so far in 2018.\n\nAt current prices, it has a market cap of around $3.0 billion, making it the 16th biggest cryptocurrency in circulation.\n\nVeChain is a blockchain-enabled platform that is designed to enhance supply chain management processes. From product source materials, to servicing history, and spare part replacements, every single piece of information about the supply chain movement of a product can be recorded and verified to bring about a supply chain management ecosystem that is secure for all participants.\n\nVeChain also offers specific solutions, outlined on its website, for the luxury goods, retail, cold-chain logistics, and general logistics industries.\n\nIts blockchain technology is currently being used by a number of Chinese companies in connection with importing goods. It is also utilized by PricewaterhouseCoopers for \"third party services\", which is another major validation of what VeChain's technology is capable of.\n\nThere is no doubt that blockchain technology can be an important innovation to supply chain management in the future. With a growing list of business partnerships and technological developments, VeChain is positioning itself to be a major disruptor in the supply chain management industry.\n\nThe price of one NEO coin changed hands at $75.02 on January 1, 2018, before soaring to a record $198.20 on January 15 amid general optimism over its future value. While it has since pulled back from those levels, it has more successfully held on to gains versus any other major digital currency during the recent market rout.\n\nAt time of writing, NEO was trading at around $124.50, representing an increase of 64% so far this year. It is currently the seventh biggest cryptocurrency in circulation, with a market cap of roughly $8.3 billion. It ended 2017 with a gain of 53,450%.\n\nNEO, dubbed 'Chinese Ethereum' by many cryptowatchers because it was launched in China and is operationally similar to Ethereum, is a blockchain platform and cryptocurrency which enables the development of digital assets and smart contracts.\n\nNEO works on the same functionality that Ethereum does, as both aim for similar roles in the crypto community. Both want to be platforms for decentralized applications, initial coin offerings, and smart contracts, but NEO also supports decentralized commerce, identification, and digitalization of assets. Additionally, it closes loopholes that have caused Ether contracts to be vulnerable to hackers.\n\nIt was originally launched in 2014 as AntShares by Da Hongfei, CEO of Onchain and a blockchain evangelist in China, along with co-founder Erik Zhang.\n\nUnderstanding OnChain is critical to understanding NEO. They're not the same company, but their interests align and they have a partnership. OnChain's system, known as DNA (Decentralized Network Architecture) aims to work with Chinese businesses and government institutions.\n\nIf OnChain can successfully integrate with Chinese businesses and government entities, that will greatly spur adoption of NEO, which would bode well for its future.\n\nLisk started the new year trading at $22.01. It now trades at $25.50, representing a year-to-date gain of 20% so far. It rose to an all-time peak of $42.00 on January 7, as part of the broad rally in cryptos just after the New Year holiday.\n\nIt has a market cap of approximately $2.6 billion, making it the 17th largest digital currency. It notched a gain of 13,480% last year.\n\nLisk is a public blockchain platform that provides decentralized blockchain apps. It started as a fork of Crypti, a little-known cryptocurrency developed by Max Kordek and Oliver Beddows in May 2016.\n\nThe idea behind Lisk is that every blockchain app is on its own sidechain, separate from the main blockchain. The benefits from this configuration would be in solving scalability issues that many cryptocurrencies are facing, while also allowing for far greater customization to particular sidechains, something thatcould not be done on other platforms.\n\nSimilar to NEO, Lisk also works on the same functionality as Ethereum, with both attempting to provide a platform for a similar idea: decentralized applications (Lisk calls them blockchain applications). The main difference between the two is that the Lisk blockchain was not built with the intent to create smart contracts.\n\nIn a promising sign for its future, Charles Hoskinson, ex-CEO of Ethereum and founder of Cardano, along with Steven Nerayoff, a former advisor for Ethereum, joined Lisk in June 2016 as senior advisors to facilitate product development.\n\nLisk also recently entered into a partnership with Microsoft Azure (NASDAQ:MSFT). This collaboration means that developers worldwide can develop, test, and deploy Lisk blockchain applications using Microsoft's Azure cloud computing platform and infrastructure.\n\nBinance Coin's price at time of writing was $9.8795, signifying a gain of 19% in the first six weeks of 2018. Its price on January 1 was $8.53. Despite retreating from record-high levels of $24.64 reached on January 12, the digital currency remains a strong candidate for top gainer of the year.\n\nAt current prices, it has a market cap of nearly $1.1 billion, making it the 28th biggest digital currency.\n\nBinance Coin is the signature virtual token of the popular China-based crypto exchange Binance, which supports around 100 digital currencies and is one of the world's leading exchanges for Bitcoin, Ethereum and Tether.\n\nLaunched in July 2017, BNB is used as an alternative method for paying Binance's trading fees. Purchasing the coin gives customers a kick-back in the form of a 50% discount on all transaction and withdrawal fees in their first year of use.\n\nThe closing price of one Ethereum coin on December 31, 2017 was $736.77. It now trades at around $885, representing a gain of 17%. It rose to an all-time peak of $1,423 on January 13.\n\nAt current prices, Etheruem has a market cap of approximately $94 billion, making it the world's number two cryptocoin, trailing only Bitcoin. Interestingly, it is the only 'mainstream' cryptocurrency to make the list. In 2017, it climbed 9,160%.\n\nEthereum is an open software platform based on blockchain technology that enables developers to build and deploy decentralized applications that run smart contracts. It was proposed in late 2013 by Vitalik Buterin, a cryptocurrency researcher and programmer, and launched in 2015.\n\nGains have been fueled by several bullish factors, including increased public awareness and legitimacy, as well as the growing support of major global corporations.\n\nThe recently formed Enterprise Ethereum Alliance, which consists of names like Intel (NASDAQ:INTC), Microsoft, JP Morgan Chase (NYSE:JPM) and Credit Suisse (SIX:CSGN) to name a few, has been helpful in supporting the cryptocurrency's rapidly growing functionality.\n\nBottom line: It's been a highly volatile start to the year in the cryptocurrency space, with few signs of a slow-down as we move further into 2018. So things could get even more interesting as markets move forward. Perhaps most surprising: barring Ethereum, the top performers on this list are names that haven't achieved mainstream status yet. But who knows, in the highly unpredictable cryptocurrency space, 2018 could be their year.\n\nWe think this is a trend that will continue as the year progresses, as many late-comers to the crypto party remain more hesitant to invest in the coins that have already rallied thousands of percent, and instead look for the cheaper, arguably more promising alt-coins."]