["J.P. Morgan has called cryptocurrencies the \"innovative maelstrom\" around Blockchain and said they are \"unlikely to disappear\" in what appears to be an internal report from the company, published Feb. 8, 2018.\n\nIn an extract from what is allegedly the banking giant's executive summary on cryptocurrency, the company appears bullish on crypto's future.\n\n\"Cryptocurrencies are the face of the innovative maelstrom around the Blockchain technology that is bringing both massive price volatility and a constant trial-and-error of new product try-outs and failures,\" the report states.\n\nDespite the report's mixed tone, the distinction from J.P. Morgan's public position on cryptocurrency over the past six months is palpable.\n\nIn September, 2017 J.P. Morgan CEO Jamie Dimon became notorious after he called Bitcoin a \"fraud,\" triggering the very price volatility the bank now cites as a \"challenge\" crypto assets face.\n\nDimon subsequently claimed he was \"not going to talk about Bitcoin anymore,\" while last month publicly disclosing he \"regretted\" making the fraud comments.\n\nSpeaking to Cointelegraph at the World Economic Forum in January, 2018, Dimon flatly refuted the idea that he was a \"skeptic\" on Bitcoin.\n\nThe recently published report meanwhile offers ideas as to how cryptocurrencies could be used most effectively.\n\n\"CCs [Cryptocurrencies] are unlikely to disappear and could easily survive in varying forms and shapes among players who desire greater decentralization, peer-to-peer networks and anonymity, even as the latter is under threat,\" the summary continues in a positive vein.\n\n\"The underlying technology for CCs [cryptocurrencies] could have the greatest application in areas where current payment systems are slow, such as across borders, as payment, reward tokens or funding systems for other Blockchain innovations and the Internet of Things, as well as parts of the underground economy.\"\n\nLast week J.P. Morgan was one of several US banks to ban clients from purchasing cryptocurrency with credit cards.", "After the rapper 50Cent made millions from bitcoins, another celebrity has now showed her fascination for the spark of bitcoins, that too quite overtly. The comedian and the talk show host Ellen DeGeneres spoke about bitcoins on her show recently. She says, \"One thing I am down with right now, that I think everybody is learning about, is bitcoin. Who's heard of bitcoin? Who can explain what bitcoin is? Liar. Nobody knows how it works. Nobody.\"\n\nShe further says, \"Everybody is talking about bitcoin; nobody understands it. It's like a plot twist in a confusing movie. When you're watching a movie and your friends act like they know what's going on, and you're like, 'Yeah, I do too!' And then you're like, 'What the hell is every ... I have no idea!' All I know is that bitcoin is either worth twenty thousand dollars or nothing; that's what I know.\n\nIt is worth remembering that an American rapper '50 Cent' last month tweeted about his bounty of bitcoins when his hoard of 700 bitcoins, which he had received for a payment of less than half a million dollars, jumped to a valuation of $8 million.\n\nOn Saturday, a bitcoin is being traded for $10,560 on the Luxembourg-based BitStamp. In Indian exchanges such as CoinSecure, a bitcoin is traded for Rs 6.7 lakh.\n\nThe average price of bitcoin in the cryptocurrency markets worldwide jumps by 4% on Saturday. A week ago, the bitcoin price was $8,621. Two weeks ago, the price had closed at $9,175 on the CoinMarketCap.\n\nBitcoin prices have been under significant pressure on regulatory crackdown. Recently, four major banks, Bank of America, Citi Bank, JP Morgan and Lloyds, prohibited their customers from buying the cryptocurrency via credit cards.", "Virtual coins fail to meet the major criteria of currency, according to JPMorgan Chase, which has called them a bad store of value and a bad form of money.\n\nIt may make sense for some investors to include digital currencies in their portfolios as a hedge, the bank said in a wide-ranging note to clients. The bank added, however, that it doesn't view any cryptocurrency as a \"legitimate competitor\" to sovereign currencies.\n\n\"The huge volatility of the price of cryptocurrencies - with respect to either traditional currencies or to a basket of goods and services - has made use of cryptocurrencies as a unit of account impractical,\" it said. \"Only hobbyists are using cryptocurrencies as a medium of exchange, at least for conventional transactions for goods and services.\"\n\nJPMorgan added that even if cryptocurrencies were to meet the criteria of cash, they still would have a very difficult time giving a national currency a run for its money because of the network effect of fiat.\n\n\"At any rate, even a hypothetically stable-value cryptocurrency is unlikely to compete with the dollar for transactions in goods and services, in say, Chicago, or to compete with the euro in Stuttgart.\n\n\"Economists have long viewed successful (i.e. relatively price-stable) currencies as natural monopolies in a given geographic area. This particular natural monopoly arises as a result of the inherent network externalities: pricing a New York meal in yen makes little sense, as almost all customers will be holding dollars,\" said JPMorgan.\n\nAccording to the Wall Street bank, the only area where cryptocurrencies could compete with national currencies as a medium of exchange is in the black market.\n\nCEO of JPMorgan Jamie Dimon, who once denounced bitcoin as a fraud that was bound to fail, said last month he regrets the comment, but remains uninterested in digital currencies.", "Atari SA, a holding company of the former Atari Inc., famous for inventing Tetris, watched its share price increase over 60 percent after its crypto investment was made public\n\nAtari SA, a French holding company that contains the former Atari, Inc., inventor of Tetris and Pac Man, has seen its share price go up more than 60 percent after announcing that it would invest in cryptocurrency, Bloomberg reports Thursday, Feb. 15.\n\nAccording to Atari's press release earlier this month, Atari will be creating its own digital currency, the Atari Token, to be used in a Blockchain-based digital entertainment platform created by Infinity Networks, Ltd., in which Atari bought a 17.5 percent stake.\n\nThe company will also develop its partnership with Pariplay Ltd., an online casino-gaming company. The casino sites will offer Atari games where players can gamble with cryptocurrencies, including Atari's second projected cryptocurrency, the Pong Token, which will be dedicated to crypto casinos.\n\nFrederic Chesnais, Atari Chairman and Chief Executive Officer, said in a press release,\n\n\"Blockchains technology is poised to take a very important place in our environment and to transform, if not revolutionize, the current economic ecosystem, especially in the areas of the video game industry and online transactions [...] Our objective is to take strategic positions with a limited cash risk, in order to optimize the assets and the Atari brand.\"\n\nCompanies that formerly had nothing to do with the crypto world have seen profits in publically aligning themselves with cryptocurrencies and Blockchain, even if it is just in name alone.\n\nWhen the Long Island Iced Tea Corp changed its name to Long Blockchain and promised a move into the crypto mining business, its stock saw a 458 percent trading range gain. The SEC has recently suggested that companies that add the word \"Blockchain\" to their name could face increased scrutiny from regulators.", "Welcome to Crypto Insider, Business Insiderâ\u0080\u0099s roundup of all theÂ bitcoinÂ andÂ cryptocurrency newsÂ you need to know today.Â Sign upÂ here to get this email delivered direct to your inbox.\n\nRiot Blockchain tripled its stock price in October by pivoting to blockchain, but a CNBC investigation published Friday raises doubts about the company's prospects. The hotel where the shareholders meeting was supposed to be held reportedly said no meeting room was ever booked for Riot Blockchain's twice-cancelled shareholders meeting.Â\n\nShares of Riot Blockchain are down 29% in trading Friday. In an interview with Business Insider, CEO John O'Rourke refuted CNBC's story.Â", "The first player to beat the PC game \"MonteCrypto: The Bitcoin Enigma\" will be awarded one whole bitcoin.\n\nAt the time of writing, a single bitcoin is priced at around $10,100 -- though, given the wild swings in bitcoin's price, who knows what it'll be worth when the game officially comes out on February 20th. Motherboard reports that it'll cost $2.\n\nThe game developers, Gem Rose Accent, humorously claim \"this game must be amongst the hardest you've ever played.\" To beat the game and claim your cryptocurrency prize, players will have to navigate through a maze and solve 24 \"mind bending\" puzzles.\n\nThere's a multiplayer aspect to the game, as well, where you can team up with others to find clues and solve the puzzles.\n\nGem Rose Accent\n\nAt the same time, there are no rules as to how you or other players should conduct themselves, at least when it comes to beating the game. Other players could just as easily lead you down the wrong path -- taking you away from the prize, and themselves closer.\n\nCheck out the YouTube video trailer for \"MonteCrypto: The Bitcoin Enigma:\"\n\nIt's still a few days before that February 20th release. But you can get a headstart by finding a clue in the game website's source code, according to the site's FAQ. To pull up the site's source code, just right-click anywhere on the site and click \"View page source.\" It'll look like a lot of nonsense to anybody who's not familiar with HTML code:\n\nPart of the website's source code where a clue is supposedly hiding. Screenshot\n\nIt's not clear where the clue is hidden: It could be in the source code of either the Home page or FAQ page. The other two clickable links lead you to a press kit download and the Steam product page, so there's no source code to browse through there.\n\nI obviously pulled up the source code of both the Home and FAQ page and lazily searched for \"clue,\" and I was met with a message that's not visible on the regular FAQ page. It reads: \"haha you really thought this was going to work?\"\n\nThe message you see when you search for \"clue\" in the source code. Screenshot\n\nWell, you have three days to divine that first clue before the hunt truly begins. And on a final note, in case you're wondering: The developers have provided apparent proof, in the form of a public bitcoin wallet address, that they have a bitcoin to give away.", "Welcome to Crypto Insider, Business Insider's roundup of all the bitcoin and cryptocurrency news you need to know today. Sign up here to get this email delivered direct to your inbox.\n\nRiot Blockchain tripled its stock price in October by pivoting to blockchain, but a CNBC investigation published Friday raises doubts about the company's prospects. The hotel where the shareholders meeting was supposed to be held reportedly said no meeting room was ever booked for Riot Blockchain's twice-cancelled shareholders meeting.\n\nShares of Riot Blockchain are down 29% in trading Friday. In an interview with Business Insider, CEO John O'Rourke refuted CNBC's story.", "Welcome to Crypto Insider, Business Insider's roundup of all the bitcoin and cryptocurrency news you need to know today. Sign up here to get this email delivered direct to your inbox.\n\nRiot Blockchain tripled its stock price in October by pivoting to blockchain, but a CNBC investigation published Friday raises doubts about the company's prospects. The hotel where the shareholders meeting was supposed to be held reportedly said no meeting room was ever booked for Riot Blockchain's twice-cancelled shareholders meeting.\n\nShares of Riot Blockchain are down 29% in trading Friday. In an interview with Business Insider, CEO John O'Rourke refuted CNBC's story.", "The three companies, which trade in OTC markets, all announced plans to purchase crypto assets.\n\nCount this as another sign that US regulators are paying closer attention to the nascent cryptocurrency world.\n\nThe Securities and Exchange Commission on Friday suspended the trading of three companies after they made announcements that they would dive into crypto, according to a memo dated February 15.\n\nThe suspension, which lasts until March 2, will allow the SEC to look into claims made by Cherubim Interest, PDX Partners, and Victura Construction. The companies have all announced plans to purchase cryptocurrency-related assets, according to the regulator.\n\n\"The SEC's trading suspension orders state that recent press releases issued by CHIT, PDXP, and VICT claimed that the companies acquired AAA-rated assets from a subsidiary of a private equity investor in cryptocurrency and blockchain technology, among other things,\" the memo said.\n\nThe agency will also look into Cherubim's plans for an initial coin offering, a cryptocurrency twist on the initial public offering process. The three companies trade in over-the-counter markets.\n\nThe SEC has made it clear that it will closely examine companies that claim to doing business in cryptocurrency. In August, it warned investors about the possibility of companies making crypto announcements to impact their share price.\n\nJay Clayton, the chairman of the regulator, said in January that the agency \"was looking closely at the disclosures of public companies that shift their business models to capitalize on the perceived promise of distributed-ledger technology.\"", "The third-largest cryptocurrency by market cap has seen a volatile start to the year, with price swings well over 40% in either direction. Bitcoin cash was trading at $1,476 per coin early Friday, up 65% in the last three months, but well off its December high of $4,053.\n\nBitcoin cash, which split from bitcoin in August 2017 has been accused of misleading investors by piggy-backing off the bitcoin name. It is completely unrelated in every aspect except its name.\n\nVocal bitcoin cash supporter Roger Ver, who owns bitcoin.com and refers to bitcoin as \"bitcoin core,\" has appeared on numerous alternative internet talk shows like InfoWars to promote the coin.\n\nLitecoin founder Charlie Lee tweeted many of these concerns Wednesday, using Ver to stop calling bitcoin \"bitcoin core.\"\n\nTwitter\n\nLee has also spoken out against a litecoin fork scheduled to happen later this weekend to form \"litecoin cash.\"\n\nBitcoin is down 2.54% Friday morning, Ethereum and Ripple's XRP are down 0.14% and 1.24% respectively.", "Bitcoin cash was up more than 8% Friday morning, while most other major cryptocurrencies were in the red.\n\nThe third-largest cryptocurrency by market cap has seen a volatile start to the year, with price swings well over 40% in either direction. Bitcoin cash was trading at $1,476 per coin early Friday, up 65% in the last three months, but well off its December high of $4,053.\n\nBitcoin cash, which split from bitcoin in August 2017 has been accused of misleading investors by piggy-backing off the bitcoin name. It is completely unrelated in every aspect except its name.\n\nVocal bitcoin cash supporter Roger Ver, who owns bitcoin.com and refers to bitcoin as \"bitcoin core,\" has appeared on numerous alternative internet talk shows like InfoWars to promote the coin.\n\nLitecoin founder Charlie Lee tweeted many of these concerns Wednesday, using Ver to stop calling bitcoin \"bitcoin core.\"\n\nTwitter\n\nLee has also spoken out against a litecoin fork scheduled to happen later this weekend to form \"litecoin cash.\"\n\nBitcoin is down 2.54% Friday morning, Ethereum and Ripple's XRP are down 0.14% and 1.24% respectively.", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nThe cryptocurrency market recovery finally began to stall on Friday, potentially bringing an end to the longest rally of 2018. The Bitcoin Cash price, however, continued to post double-digit percentage gains even as other coins began to trade sideways.\n\nYesterday, the cryptocurrency market cap had reached a pinnacle of $486.5 billion, its highest point since Feb. 1. Unfortunately, the market entered Friday on a downward slope, and the cryptocurrency market cap has since declined to a present value of $471.9 billion.\n\nThe Bitcoin price rode a bullish wave this week, rising as high as $10,300 after trading below $8,000 as recently as Feb. 11. On Friday, though, the Bitcoin price dipped back below $10,000. As of the time of writing, Bitcoin was valued at $9,793 on Bitfinex, which translates into a $166.9 billion market cap and represents a slight increase over its previous-day level.\n\nThe decline correlated with the start of Chinese New Year but it is unclear to what extent the events are linked, given that Bitcoin surged in advance of the holiday.\n\nConventional wisdom, though, suggests that the holiday could lead to some downward pressure on the markets, as regional investors exchange their cryptoasset holdings for fiat to finance their holiday spending.\n\nThe Ethereum price, meanwhile, charted an incredibly choppy course that saw the second-largest cryptocurrency fluctuate between $906 and $944 before ending the day at $921. Ethereum maintains a market cap of $90.9 billion.\n\nThe majority of top-tier altcoins traded sideways on Friday, with six of the top 10 cryptocurrencies (including Ethereum) making net single-day movements of less than one percent in either direction. There was, however, one notable exception: Bitcoin Cash.\n\nThe Bitcoin Cash price leaped by 12 percent for the day, reaching as high as 1,550 on Bitfinex before ebbing back to $1,457 at the time of writing. Bitcoin Cash was the only top-tier coin to post a double-digit percentage advance -- indeed, it was the only coin in the top 10 to rise by more than two percent -- and it now boasts a market cap of $25.5 billion.\n\nThis advance enabled Bitcoin Cash to gain significant ground on third-ranked Ripple, which remains valued at $43.8 billion after a day of sideways trading. Cardano, NEO, EOS, and IOTA posted similarly-stagnant returns, while Litecoin and Stellar declined by three percent and one percent, respectively.", "The executive director of the Bitcoin Foundation Llew Claasen predicted that the price of Bitcoin will hit $40,000 by the end of 2018, while 90% of all other cryptocurrency projects will fail, Business Insider reported Feb. 15.\n\nAs Claasen stated at the Startup Grind conference which took place Feb. 12-14, this failure will be caused by investors taking too much risk investing in cryptocurrency projects which later turn out to be scams.\n\nOnly a month and a half into 2018, five major Initial Coin Offering (ICO) and cryptocurrency scams have already been discovered, including the notorious case of Bitconnect.\n\nClaasen is confident that the cryptocurrency community will learn from these unfortunate occurrences and will be able to prevent them in future, as he told Business Insider. Claasen believes that investors are already being more careful, declaring that \"this is a problem the market is good at solving.\"\n\nAs Claasen further explained, Bitcoin will not be gradually growing to the value of $40,000 over the course of 2018. Instead, it will be bouncing for three to six months with the same ups and downs as during the previous three months.\n\nJust this Tuesday, the CEO of Ripple Brad Garlinghouse similarly said that most virtual currencies will likely go to zero, as reported by Business Insider.", "Everyone should get £10,000 from UK government, report suggests Jimmy NsubugaFriday 16 Feb 2018 10:19 am Share this article with Facebook Share this article with Twitter Share this article with Google Plus Share this article through email Share this article with Whatsapp Share this article through\n\nEvery UK citizen under 55 should be given £10,000, according to a new report.\n\nThe money should come in the form of a basic state wage, the Royal Society for the encouragement of the Arts, Manufactures and Commerce (RSA) has suggested.\n\nMusic producer is 12th person to be stabbed to death in London since New Year's Eve\n\nCitizens would would be handed two £5,000 payments over the course of 24 months.\n\nThe RSA has made the recommendation because it feels people need help over the next few years because automation, climate change and work/life balance is going to have a huge effect.\n\nMORE: 100,000 orangutans killed in Borneo in last 16 years\n\n'A low-skilled worker might reduce their working hours to attain skills enabling career progression, the report said.\n\n'The fund could provide the impetus to turn an entrepreneurial idea into a reality. It could be the support that enables a carer to be there for a loved one.'\n\nIf you're wondering how we're going to pay for it the RSA has also covered this in its study.\n\nIt proposes getting rid of Child Benefit, Tax Credits and Jobseeker's Allowance and replacing it with the basic state wage.\n\nMORE: Your iPhone will crash if you receive a message containing this one letter\n\nFurther money would be raised in other ways, including charges on untaxed corporate assets and using government savings.\n\nRSA's Action and Research Centre director Anthony Painter added: 'The simple fact is that too many households are highly vulnerable to a shock in a decade of disruption, with storm clouds on the horizon if automation, Brexit and an ageing population are mismanaged.\n\n'Without a real change in our thinking, neither tweaks to the welfare state nor getting people into work alone, when the link between hard work and fair pay has broken, will help working people meet the challenges ahead.'\n\nIn order to qualify for the money applicants would have to tell the government how the funds would be used and the scheme would also be means tested.\n\nMORE: Truly heartbreaking picture of man crying as he eats his Valentine's meal alone\n\nMORE: Bitcoin price to 'double' in 2018 cryptocurrency boom as Ethereum, Ripple and Litecoin surge, analysts predict", "Other cryptocurrencies are also up as crypto recovers from its early-February slump.\n\nBitcoin passed $10,000 a coin Thursday afternoon, making for the first time in just over two weeks its trading above the psychological hurdle.\n\nThe flagship cryptocurrency, which still accounts for 35% of the total value of all coins, is up 5.7% Thursday.\n\nBitcoin slumped at the start of February, but has been gaining steam again over the last week or so. It remains well off its all-time highs of over $19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent rally. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world.\n\nCharlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $40,000.", "Wednesday, 7 February 2018 ()\n\nThe North American Crypto Currency Conference, or NAC3 for short, will be expanded in 2018 following the success of last year's event in Las Vegas. Two events are planned: one in New York on Feb. 24 and 25 at the Sheraton in Times Square, and another in Los Angeles a month later, on March 24 and 25, at Playa Studios. Described by organizer and founder Andy Crane as the only bitcoin and blockchain conference designed for \"the average person,\" NAC3 offers access to its roster of keynote speakers in a highly inclusive event that welcomes all ages and experience levels. \"NAC3 is designed for the average person in every way,\" Crane said in a statement. \"Whether you're a total beginner or a seasoned pro, you'll walk away from NAC3 with a great deal of useful and actionable information.\" NAC3 will also feature an intensive, all-day advanced trading course taught by Crypto Bud (Ivan Leon), as well as keynote presentations by Day Hay (Crypto Riot), Rob Paone (Crypto Bobby), and Nathan Leung (Cryptonauts), as well as blockchain legal expert Jason Civalleri and Polyswarm CEO Steve Bassi. Event sponsors include Polyswarm, Blockmason, Blockpass, CEX.io, and Bitcoin.com. Tickets for the New York and L.A. events are available at https://www.nac3.io. Ticket giveaway NAC3 announced it will give away more than $10,000 worth of free tickets to the New York and Los Angeles NAC3 events to ensure that everyone who wants to attend can through a special \"scholarship program.\" \"The goal is to make sure that the tickets go to students of cryptocurrency who would otherwise not be able to attend due to the ticket price, which is $247 for admission,\" the organizers said in a statement. Those interested in winning the NAC3 scholarship can apply at http://www.davidhay.org/nac3-scholarship-program.", "2018 has been a wild year for the cryptocurrency market so far, with coins like Bitcoin and Ethereum falling over 50%.\n\nThis comes after the tokens reached all-time highs in December 2017.\n\nThe market once again demonstrated its volatility this week - albeit in a positive direction - with Bitcoin rallying over the last few days.\n\nBitcoin has now passed the $10,000 price point, after falling below $6,000 just 10 days ago.\n\nThe price of Bitcoin is historically volatile, but it may have been influenced by recent worries about the regulation of Bitcoin by governments.\n\nMany credit card issuers have also limited the ability of customers to buy Bitcoin on credit, with US exchange Coinbase disabling new credit card registrations.", "Atari has become the latest company to pivot to cryptocurrency, launching a digital coin in a bid to revive the gaming pioneer's fortunes.\n\nAtari, the creator of some of the most iconic video games consoles of the 1970s and 80s, is to launch \"Atari Token\", its own cryptocurrency, according to the Daily Telegraph.\n\nThe French-listed company, which faded from the gaming industry and filed for bankruptcy in 2013, has now joined the growing list of companies jumping on the blockchain technology trend. Atari's shares have jumped more than 60 per cent since it announced the launch of its cryptocurrency last week.\n\nWhile Atari is best known for games like Pong, Pac-Man and Space Invaders, it is now turning to digital currencies. It is working on a blockchain-based digital entertainment platform, the company said in a statement, and online casinos that will accept cryptocurrency.\n\n\"Blockchain technology is poised to take a very important place in our environment and to transform, if not revolutionise, the current economic ecosystem, especially in the areas of the video game industry and online transactions,\" said Atari CEO Frederic Chesnais, according to Bloomberg.\n\n\"Our aim is to take strategic positions with a limited cash risk, in order to best create value with the assets and the Atari brand.\"\n\nBlockchain technology, which records data in a digital ledger, has been touted as a way to transform digital industry, from financial services to healthcare. But dozens of companies have jumped on the trend, launching their own cryptocurrencies or adding the word \"Blockchain\" to their name, often followed by a stock price jump.\n\nEstablished companies have turned to cryptocurrencies, attempting to draw on the success of the digital currency Bitcoin, and so-called Initial Coin Offerings, which see companies selling digital tokens as a form of crowdfunding.\n\nIn June last year, Atari confirmed it was working on a new games console, its first in 20 years. The Atari Box project would allow gamers to play a number of classic Atari games, but it has since been postponed indefinitely. The last update on the console was in December. The Telegraph has contacted Atari for comment on the future of the project.\n\nAtari is not the only company trying to regain former glories by turning to crypto. Kodak, the camera company which, like Atari also went bankrupt, has also turned to cryptocurrency, developing its Kodak Token coin and hosting an ICO.", "Bitcoin is up more than 5% Thursday, above $US10,000 for the first time in just over two weeks. Other cryptocurrencies are also up as crypto recovers from its early-February slump.\n\nBitcoin passed $US10,000 a coin Thursday afternoon, making for the first time in just over two weeks its trading above the psychological hurdle.\n\nThe flagship cryptocurrency, which still accounts for 35% of the total value of all coins, is up 5.7% Thursday.\n\nBitcoin slumped at the start of February, but has been gaining steam again over the last week or so. It remains well off its all-time highs of over $US19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent rally. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world.\n\nCharlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $US40,000.\n\nOscar Williams-Grut contributed to this report from London\n\nWATCH MORE: Tech & Finance News", "Kevin Abosch, the photographer who purportedly sold a photo of a potato for over $1,000,000 in 2016, has now become the photographer behind the world's most expensive crypto-artwork by selling a photo of a rose on the blockchain for $1,000,000.\n\nCNN reports that the photo, titled Forever Rose, was purchased yesterday on Valentines Day by a group of 10 collectors that included investment funds, an advisory firm, crypto projects, and a leading China-based crypto investor. There were over 150 interested buyers, and the 10 collectors who ended up purchasing the photo split the price (paid in GTO and IAMA tokens) evenly 10 ways. The $1 million is believed to be the highest price ever paid for a cryptocurrency artwork.\n\n\"The Forever Rose is an ERC20 token called ROSE on the Ethereum blockchain that is based on Abosch's photograph of a rose,\" Crowdfund Insider reports. \"The buyers each receives 1/10 of the ROSE token. The purchasers can decide to sell their partial rose.\"\n\nAbosch created Forever Rose in collaboration with GIFTO, a decentralized gifting platform that stores its record of collectibles on the Ethereum blockchain.\n\nThe photographer and platform have donated the proceeds from the sale ($1 million worth of Ether) to CoderDojo Foundation, which provides free programming programs for kids aged 7 to 17 years old.", "After slipping below $6,000 nine days earlier, the price of Bitcoin briefly shot above $10,200 on Thursday.\n\nThe Bitcoin rally comes as a string of positive news has buoyed the broader market for cryptocurrencies, including Litecoin and Ethereum.\n\nPrices had tumbled amid fears of global cryptocurrency crackdown by governments, but got a lift following signs that the U.S. had no plans to ban cryptocurrency earlier this month. Investors took heart, in particular, from remarks before the Senate by Commodity Futures Trading Commission Chair Christopher Giancarlo and Securities and Exchange Commission Chair Jay Clayton. Their general message, which came as Bitcoin was bottoming, was: The U.S. doesn't want to quash the market but regulate it.\n\nLayering on the positive sentiment was South Korea. The country helped lower Bitcoin prices this year after imposing stricter regulations and even floating an outright ban on cryptocurrency exchanges. But now it is apparently considering a licensing system for cryptocurrency exchanges, according to reports from Business Korea.\n\nStill, for investors who bought into Bitcoin at the beginning of the year, it's still not smooth sailing. Bitcoin started the year at $14,000, down from an all-time high of about $20,000 in December. Since the start of the year, Bitcoin's market cap is still down by about $60 billion.\n\nAs of late Thursday, the cryptocurrencies had moderated some of their latest gains.\n\nBitcoin is now up 7% at $10,000, Ethereum rose 2% to $926, while Litecoin trades up roughly 1% at $211.", "The company behind iconic video games such as Pac-Man and Pong is planning to launch its own cryptocurrency, dubbed \"Atari Token,\" according to an announcement last week.\n\nAs part of the effort, Atari acquired a 15% stake in a Gibraltar-based company, Infinity Networks, Ltd and has licensed its brand to the firm. The partnership - which was previously hinted at in a December statement - will see the development of a digital entertainment platform underpinned by the so-called Atari Token. The game maker noted that its investment was \"made without cash disbursement by Atari.\"\n\n\"Our aim is to take strategic positions with a limited cash risk, in order to best create value with the assets and the Atari brand,\" Atari chairman and CEO Frederic Chesnais said in a statement.\n\nThe name selection is a notable one, given that Atari had previously created an Atari Token to serve as a currency for making in-game purchases. Whether the newly-announced Atari Token will serve that purpose remains to be seen.\n\nAdditionally, Atari said that it plans to integrate cryptocurrencies via its branding partnership with Pariplay, Ltd, which offers online games using Atari games and characters as part of their design. Last week's statement also notably hints at the creation of a second token, which would be used in conjunction with the online casino plan.\n\n\"To broaden the appeal of these new casinos, and once the Atari Token available, Atari has the project to launch Pong Token, a second token dedicated to crypto-casinos and usable on these gaming sites. The details of this launch of crypto-casinos will be announced soon,\" the statement (loosely translated) reads.\n\nAs might be expected, the announcement has drawn comparisons - and not entirely favorable - to Kodak, the one-time photo giant that has licensed out its brand for the creation of a KodakCoin. The project was announced in January, with plans to hold an initial coin offering at the end of that month. That token sale was later delayed, and no launch date has since been released.\n\nAs Bloomberg notes, Atari's stock price saw a noticeable jump after the announcement was made.\n\nVintage game image via Shutterstock", "Thursday, Bitcoin rose above $10,000 for the 1st time in more than 2 weeks, as investors came back in and bought the digital currency after having seen a 70% Fibo correction from its all-time highs hit in December 2017, the pattern looks encouraging.\n\nOn the Luxembourg-based Bitstamp, bitcoin rose as high as $10,234.\n\nCurrently, Bitcoin is trading at: 10,129.43, +644.80, or +6.80%, as of 7:57p GMT, the market is open.\n\nThomas Lee, managing partner at Fundstrat Global Advisors, sees a new record by July.\n\nBitcoin has been buffeted this year by a series of negative headlines centering around increased scrutiny by global regulators.\n\nThe digital currency was also affected by the risk-off mood across financial markets since the beginning of the year, undermining views that Bitcoin's price moves are generally uncorrelated to other asset classes.\n\nSentiment on risk assets has since improved and the markets are recovering quickly.\n\nBitcoin, the #1 cryptocurrency, gained more than 1,300% last year, capped by high just shy of $20,000 on 17 December.\n\nEthereum, the second-largest by market value, was up 2.91 percent over the past 24 hours at $940.123, while the third-largest, Ripple, gained 6.8 percent to $1.16, according to the data.\n\nNotably, during Bitcoin's Bull frames, its recoveries take 1.7X the duration of the decline and that implies that 85 days are needed to recover prior highs, this is seen in July 2018 if not sooner.\n\nAnalysts expect that Y 2018 will remain a strong year for cryptocurrencies, but he sees established blockchain networks such as Bitcoin and ethereum dominating the action.\n\nIf you want to trade cryptocurrencies on secure, encrypted, not hackable platform check out GbitX here.", "Hydro-Quebec may consider raising its rates for energy-hogging cryptocurrency miners who are rushing to establish themselves in the province.\n\nREAD MORE: Hydro-Quebec says U.S. export deal will keep local power rates below inflation\n\nSpokesman Marc-Antoine Pouliot says more than 100 cryptocurrency companies have expressed interest in coming to Quebec as they look for cheap sources of energy to power the computers that solve the equations that support the currency.\n\nREAD MORE: Hydro-Quebec names HQ after former Quebec premier Jean Lesage\n\nHe says the sheer volume of demand is forcing the public utility to reflect on what rates to offer and how many clients it can accommodate.\n\nREAD MORE: 'You're going to die,' Sainte-Adèle teen films peers climbing hydro pole\n\nPouliot says a few operations have already been established and Hydro-Quebec is analyzing dozens more requests.\n\nWATCH BELOW: Hydro-Quebec controversy\n\nSacred Irish ground sold to Hydro-Quebec for development 02:22 Sacred Irish ground sold to Hydro-Quebec for development 01:46 Hydro-Quebec contractor damaged property: resident 02:13 How much will DDO Hydro lines cost? 02:09 Hydro-Quebec over-estimates consumption by $1.4B 02:50 DDO residents rally against planned Hydro-Quebec project 00:39 Hydro-Quebec sends reinforcements to help storm-battered New York 00:27 Hydro-Quebec announces new 400-kilometre transmission line 00:48 Protests continue against Hydro-Quebec price hikes\n\nSome of the proposed projects are as big as 100 megawatts, Pouliot said -- more than 20 times what it takes to power Montreal's Bell Centre.\n\nREAD MORE: DDO wants transparency on Hydro-Quebec transmission line project\n\nA spokesperson for Natural Resources Minister Pierre Moreau confirmed the matter of raising rates is being discussed but said no final decision has been made.", "Bitcoin jumped above $10,000 on Thursday, as a slew of major digital currencies extended Wednesday's rally and regulatory fears subsided.\n\nThe price of the world's best-known cryptocurrency surged above $10,000 on Thursday, on Coinbase, the largest U.S. marketplace for buying major cryptocurrencies.\n\nA number of other major cryptocurrencies, including ethereum, ripple, bitcoin cash and litecoin were also higher Thursday. On Wednesday, litecoin got a major boost from news that a payments processor for the digital asset, called LitePay, is set to launch later this month.\n\nSouth Korea appeared to soften its attitude toward cryptocurrencies this week, with one report suggesting that the government is looking at the possibility of a cryptocurrency exchange licensing system. The licensing system could be similar to that of New York's \"BitLicense\" system, which provides firms handling virtual currencies a license to operate, according to the report.\n\nSouth Korea is one of the biggest cryptocurrency markets in the world. Its government spooked investors last month after one minister said it was preparing a bill to ban trading via cryptocurrency exchanges.\n\nA South Korean minister said Wednesday that its \"basic rule\" was to prevent illegal activities associated with cryptocurrency trading, adding that a ban was just one of many options the government had been considering.\n\n\"FOMO (fear of missing out) is back in the markets,\" Mati Greenspan, senior market analyst at eToro, told CNBC in a phone interview. \"Crypto investors have been sitting on the sidelines waiting for a rally. Yesterday it was litecoin which had a clean break out from its resistance levels and investors jumped on and are still riding it today.\"\n\nGreenspan added: \"There's been a lot of FUD (fear, uncertainty and doubt) over the past few weeks. The FUD is fading now.\"", "The fifth largest cryptocurrency in the market in terms of market capitalization, Litecoin (LTC), is having an amazing bull run, recording its one-month high at $231 as of the time of posting. LTC has recovered by over 100% from its huge dip to $106 last February 6. Furthermore, LTC's market capitalization has once again reached the $10 billion for the first time since January 29.\n\nThe Litecoin Cash Controversy\n\nLitecoin's seemingly magical run is a bit questionable for analysts due to some controversy surrounding the news for the supposed upcoming fork, \"Litecoin Cash (LCC).\" According to the LCC official website, existing LTC holders at block 1,371,111 will receive 10 LCC tokens for every 1 LTC. This news may have had an influence in Litecoin's current bull run.\n\nHowever, Litecoin founder and creator Charlie Lee, together with the Litecoin community, have called this project a scam, dismissing the news as mere propaganda to confuse Litecoin investors. The people behind the LCC project may have gotten their inspiration from a similar fork event that happened with Bitcoin last year.\n\nThe Bitcoin Cash Hard Fork\n\nOn August 1, 2017, the Bitcoin scalability debate resulted to a hard fork in Bitcoin, creating a new blockchain. The new cryptocurrency was called Bitcoin Cash. The hard fork propelled the price of Bitcoin from the $2700 level to the $3400 level by the end of the first week of August. Bitcoin Cash, on the other hand, grew from $278 to $354 during the same period, with a spike in price on August 2 reaching $727.\n\nDisregarding the LCC news, Litecoin seems to be performing well, having a short-term momentum in favor of the bulls. Breaking the $250 psychological barrier would signal a strong bull run towards the $300 level. Closing below the February 11 low of $142 would be the only invalidation for the bullish pattern. Some influential players in the cryptomarket believe that Litecoin may hit the $1000 mark by 2018 if all goes well with the market. In general, many investors are still confident of Litecoin's technological potential.", "Other cryptocurrencies are also up as crypto recovers from its early-February slump.\n\nBitcoin passed $US10,000 a coin Thursday afternoon, making for the first time in just over two weeks its trading above the psychological hurdle.\n\nThe flagship cryptocurrency, which still accounts for 35% of the total value of all coins, is up 5.7% Thursday.\n\nBitcoin slumped at the start of February, but has been gaining steam again over the last week or so. It remains well off its all-time highs of over $US19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent rally. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world.\n\nCharlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $US40,000.", "The price of a single bitcoin hit $10,000 for the first time since the beginning of the month, underscoring a rally in the world's No. 1 cryptocurrency since touching a recent low. Bitcoin has risen about 68% since touching a low below $6,000, according to news and research site CoinDesk. Bitcoin BTCUSD, +9.77% hit an intraday high of $10,064.98, representing a 5.6% increase on the day, dragging other major digital currencies along for the uptrend. That said, the virtual currency is still below its late-December peak at around $20,000.\n\nRead the full story: Bitcoin rises back above $10,000 as rally continues", "Round prices seem to continue to command the minds of traders in the Bitcoin universe, especially when it comes to the most popular of cryptocurrencies. Just as it happened when the price of Bitcoin VS USD nearly met 20k, now here once again, there's a bit of a hurdle. After Bitcoin went over 19K USD, it tumbled down to $6k. Now not long after that trip, the price is rumbling back up over $9k.\n\nIt's almost as if there's some real liquidity in the price of Bitcoin, isn't there? It would seem as though the massive interest in the cryptocurrency market as a whole lead to some sort of price jockeying over the past few months. It's not as if there've been any big mentions of Bitcoin and the crypto market in general, is it? Oh yes, yes it is.\n\nNow as the market reached up to 10k overnight, resistance can be found in the price of bitcoins. This week the Death Cross took place - EMA (150, close) rose above EMA (20, close) as the chart below shows. This chart comes from crypto trader Wilson Trodler, showing how this bit of a jump back up doesn't necessarily mean the market's suddenly saved. In fact it's a bit more of a mess than that.\n\nUnfortunate for all traders, those that believe in the round number points are those that make or break the market. Everyone else - the folks that know the difference between 9,999 and 10,001 is extremely tiny - were forced to follow, and they'll continue to be forced to follow. Watching the emotional reactions of investors and acting before they make their FOMO or FUD moves - therein lies the true profit making playbook.\n\nAs it is always, heed the following. Nothing written here or in any other article on SlashGear should be considered investment or financial advice. Anything any reader does before, during, or after the reading of this or any other SlashGear article is the responsibility of the reader alone. Go seek out your own research and make your own moves, and the power shall be yours.", "A 24-year-old man from Colchester, Essex has been sentenced to two years in prison for running a website that allowed cyber criminals to test attacks against antivirus scanners.\n\nGoncalo Esteves pleaded guilty in January 2018, after a joint investigation by the National Crime Agency (NCA) and cyber security firm Trend Micro.\n\nThe investigation found that Esteves, under the pseudonym KillaMuvz, ran the website reFUD.me to test the effectiveness of malware. He also sold custom-made malware-disguising products and offered technical support to users.\n\nHe was sentenced in the Blackfriars Crown Court for convictions on two computer misuse offences and a count of money laundering.\n\nEsteves called his encryption tools Cryptex Reborn and Cryptex Lite. Part of a family of cyber tools known as crypters, they could be used by hackers to improve their chances of dodging antivirus. He sold them for use in packages which varied in price according to the length of the licence.\n\nA month of Cryptex Lite cost $7.99 (£5), while a lifetime licence for Cryptex Reborn cost $90 (£60). Esteves provided customer support via a dedicated Skype account and accepted payment either in conventional currency, in cryptocurrency Bitcoin or in Amazon vouchers.\n\nEsteves advertised his website on the hackforums.net website, a well-known message board for cyber criminals, under the description: \"A free service that offers fast and reliable file scanning to ensure your files remain fully undetectable to anti-malware software.\"", "The surge in funds comes at a volatile time for the cryptocurrencies they trade in.\n\nThe number of hedge funds focused on trading cryptocurrencies more than doubled in the four months to Feb. 15, despite sharp falls in the value of the virtual coins in recent weeks, data from fintech research house Autonomous NEXT showed on Thursday.\n\nThe firm recorded a record high of 226 global hedge funds with such a strategy, up from 110 global hedge funds as of Oct. 18. That itself was up from 55 funds at Aug. 29 and just 37 at the start of 2017.\n\nAssets under management hit between $3.5 and $5 billion, according to the firm.\n\nThe surge in funds comes at a volatile time for the cryptocurrencies they trade in. After hitting a record high close to $20,000 in December, bitcoin 70 percent of its value to slip below $6,000 in January, posting its worst monthly performance in three years.\n\nBitcoin has since recovered some of those falls, but at just below $10,000 is still only worth around half what it was a month ago.\n\nRival cryptocurrencies have also seen sharp declines. The so-called \"market cap\" of all virtual currencies -- their price multiplied by the number of coins issued -- currently stands at around $465 billion, according to trade website Coinmarketcap, down from more than $830 billion in early January.\n\nAgainst that backdrop, cryptocurrency hedge funds lost an average of 4.6 percent in January, according to data from industry tracker Eurekahedge. The funds made an average of 1,477.85 percent in 2017, showed Eurekahedge data.", "The parent company behind the centralized and third-largest cryptocurrency, Ripple, will work in the banking system of the oil-rich Kingdom of Saudi Arabia, the firm claims.\n\nSaudi Arabia and Ripple, the company behind the XRP coin, will cooperate by using xCurrent, software that enables banks to instantly settle cross-border payments with end-to-end tracking.\n\n\"Central banks around the world are leaning into blockchain technology in recognition of how it can transform cross-border payments, resulting in lower barriers to trade and commerce for both corporates and consumers,\" said Dilip Rao, Ripple's global head of infrastructure innovation.\n\nThe Saudi central bank will be the first to use Ripple's blockchain network.\n\nRipple is being traded as a cryptocurrency, but it is more of a token than digital money. It peaked at $3.31 in January, but is trading at around $1.15 this week. The idea of the token is to act as a bridge between international bank transactions, not to become an alternative for fiat currencies. The majority of ripple tokens are held by the parent company, meaning that it can regulate their price.\n\nRipple is often criticized by cryptocurrency enthusiasts, who say XRP undermines the whole idea of digital assets being deregulated and decentralized. The company's CEO Brad Garlinghouse has publicly said that Ripple \"works within the system,\" and is not opposed to the traditional financial system.\n\nThere is no doubt some CryptoCurrencies with fail, some will be scams, and some will live on to change the very nature of money and wealth, no wonder the old dudes are scared.\n\nOpen your G-BiT X Account today.\n\nCryptoCurrencies is not about Tax Evasion or Money Laundering, real hardcore fundamental CryptoCurrency Exchanges like G-BiT have seriously tackled the Money Laundering and Tax issues, that's why they have such a bright future. While the Establishment still wants you to be hit with heavy fees and delays sending money around the world the reality is that is legalized theft built in to the Banking Sector and is not a product of cost or reality, CryptoCurrencies have proven that!", "The number of hedge funds focused on trading cryptocurrencies more than doubled in the four months to Feb. 15, despite sharp falls in the value of the virtual coins in recent weeks, data from fintech research house Autonomous NEXT showed on Feb. 15.\n\nThe firm recorded a record high of 226 global hedge funds with such a strategy, up from 110 global hedge funds as of Oct. 18. That itself was up from 55 funds at Aug. 29 and just 37 at the start of 2017.\n\nAssets under management hit between $3.5 and $5 billion, according to the firm.\n\nThe surge in funds comes at a volatile time for the cryptocurrencies they trade in. After hitting a record high close to $20,000 in December, bitcoin lost 70 percent of its value to slip below $6,000 in January, posting its worst monthly performance in three years.\n\nBitcoin has since recovered some of those falls, but at just below $10,000 is still only worth around half what it was a month ago.\n\nRival cryptocurrencies have also seen sharp declines. The so-called \"market cap\" of all virtual currencies - their price multiplied by the number of coins issued - currently stands at around $465 billion, according to trade website Coinmarketcap, down from more than $830 billion in early January.\n\nAgainst that backdrop, cryptocurrency hedge funds lost an average of 4.6 percent in January, according to data from industry tracker Eurekahedge.\n\nThe funds made an average of 1,477.85 percent in 2017, showed Eurekahedge data.", "In an interview with Â Business Insider, the fork's founders maintain that litecoin cash not a scam, and an improvement on the original litecoin.Â\n\nLitecoin is down 2.2% Tuesday morning - alongside most other major coins - after the cryptocurrencyâ\u0080\u0099s first hard fork, Litecoin Cash, was announced by an unaffiliated organization.\n\nLitecoin holders will receive 10 tokens of litecoin cash for every one litecoin they own, the newly minted Litecoin Cash foundation said Monday.\n\nThe goal of the new currency is to increase the \"block speed\" at which the network can process transactions. The foundation says litecoin cash has a goal block time of 2.5 minutes - faster than litecoin. Like bitcoin and most other major cryptocurrencies, but unlike the existing Litecoin network, litecoin cash will use the more energy intensive, but potentially more secure, proof-of-work mining method.\n\nThe fork will occur precisely at block 1371111. The Litecoin network is currently on block 1368028 at the time of writing, according to BlockCypher. The fork is expected to occur sometime around 9 p.m. ET on Monday, February 19.\n\nLitecoin, which was designed to be less energy intensive than bitcoin, saw an astronomical rise in 2017. The cryptocurrency skyrocketed from just $3.73 a year ago, to as high as $365 in December, leading founder Charlie Lee to warn investors about the possibility of losing everything. He also sold his entire stake after being accused of price manipulation.\n\nOne week before litecoin cash was announced, Lee tweeted a warning that any fork of litecoin was \"a scam trying to confuse you to think itâ\u0080\u0099s related to litecoin.\"\n\nTwitter\n\nForks arenâ\u0080\u0099t uncommon in the cryptocurrency world, although they are not without controversy. Bitcoin cash famously split from the flagship bitcoin in August 2017, but the forked cryptocurrency has been accused of merely riding the coattails of the more established bitcoin.\n\nLitecoin cash's founders insist that isn't the case with this new cryptocurrency.Â\n\n\"As to the name, itâ\u0080\u0099s strictly a product of convention. No confusion is intended, but it has simply become customary for a new coin arising from a fork to use the forked coinâ\u0080\u0099s name as a prefix to its own,\" litecoin cash's head of design Michael \"Scarlet\" Wyszynski told Business Insider.\n\n\"And while we're not affiliated with Litecoin or the Litecoin dev team in any way, we will share the first 1371111 blocks of transactions in the ledger.Â People are absolutely right to be cautious and skeptical.\"", "The number of hedge funds focused on trading cryptocurrencies more than doubled in the four months to Feb. 15, despite sharp falls in the value of the virtual coins in recent weeks, data from fintech research house Autonomous NEXT showed on Thursday, Reuters reports.\n\nThe firm recorded a record high of 226 global hedge funds with such a strategy, up from 110 global hedge funds as of Oct. 18. That itself was up from 55 funds at Aug. 29 and just 37 at the start of 2017.\n\nAssets under management hit between $3.5 and $5 billion, according to the firm.\n\nThe surge in funds comes at a volatile time for the cryptocurrencies they trade in. After hitting a record high close to $20,000 in December, bitcoin lost 70 percent of its value to slip below $6,000 in January, posting its worst monthly performance in three years.\n\nBitcoin has since recovered some of those falls, but at just below $10,000 is still only worth around half what it was a month ago.\n\nRival cryptocurrencies have also seen sharp declines. The so-called \"market cap\" of all virtual currencies - their price multiplied by the number of coins issued - currently stands at around $465 billion, according to trade website Coinmarketcap, down from more than $830 billion in early January.\n\nAgainst that backdrop, cryptocurrency hedge funds lost an average of 4.6 percent in January, according to data from industry tracker Eurekahedge.\n\nThe funds made an average of 1,477.85 percent in 2017, showed Eurekahedge data.\n\nFollow Trend on Telegram. Only most interesting and important news", "LONDON: The number of hedge funds focused on trading cryptocurrencies more than doubled in the four months to Feb. 15, despite sharp falls in the value of the virtual coins in recent weeks, data from fintech research house Autonomous NEXT showed on Thursday.\n\nThe firm recorded a record high of 226 global hedge funds with such a strategy, up from 110 global hedge funds as of Oct. 18. That itself was up from 55 funds at Aug. 29 and just 37 at the start of 2017.\n\nAssets under management hit between $3.5 and $5 billion, according to the firm.\n\nThe surge in funds comes at a volatile time for the cryptocurrencies they trade in. After hitting a record high close to $20,000 in December, bitcoin lost 70 percent of its value to slip below $6,000 in January, posting its worst monthly performance in three years.\n\nBitcoin has since recovered some of those falls, but at just below $10,000 is still only worth around half what it was a month ago.\n\nRival cryptocurrencies have also seen sharp declines. The so-called \"market cap\" of all virtual currencies - their price multiplied by the number of coins issued - currently stands at around $465 billion, according to trade website Coinmarketcap, down from more than $830 billion in early January.\n\nAgainst that backdrop, cryptocurrency hedge funds lost an average of 4.6 percent in January, according to data from industry tracker Eurekahedge.\n\nThe funds made an average of 1,477.85 percent in 2017, showed Eurekahedge data.", "Charlie Munger, the 93-year old vice chairman of Berkshire Hathaway and long-time colleague of Warren Buffett, has criticised the bitcoin price explosion as \"totally asinine\" and dismissed the cryptocurrency itself as a \"noxious poison\"\n\nMunger was speaking at a shareholder Q&A session at the Daily Journal, a Los Angeles publisher of which he is a director.\n\nHe conceded that the technology behind bitcoin might be interesting but the investing frenzy surrounding it over the year should have prompted a US government crackdown similar to the one in China. \"I expect the world to do silly things from time to time, because everybody wants easy money. It's just disgusting that people are taken in by something like this.\n\n\"Our government's lax approach to it is wrong. The right answer with stuff that bad is to step on it hard.\"\n\nAlthough Munger had strong view on cryptocurrencies, he conceded that he had no idea whether internet companies such as Google and Alibaba were overvalued and was non-committal on the impact of artificial intelligence.\n\nDuring the session he also called on regulators to \"let up\" on Wells Fargo. The US bank has struggled to overcome criticism after several product sales scandals and efforts to reimburse customers. Berkshire owns $27bn, or about 9%, of Wells shares.\n\nMunger's colleague, Warren Buffett, has expressed a similar attitude to bitcoin and other virtual currencies. \"In terms of cryptocurrencies, generally, I can say with almost certainty that they will come to a bad ending,\" the chairman and CEO of Berkshire Hathaway told CNBC last month.", "The popular cryptocurrency Bitcoin was trading at $9,610.39 in India today on CoinDesks's Bitcoin Price Index (BPI) at the time of reporting. Bitcoin climbed nearly 10 percent, the highest level reached since February 4.\n\nThe popular cryptocurrency Bitcoin was trading at $9,610.39 in India today on CoinDesks's Bitcoin Price Index (BPI) at the time of reporting. Bitcoin climbed nearly 10 percent, the highest level reached since February 4. Bitcoin crossed the psychologically key $9,000 level amid improved sentiment about government regulation in the US. Bitcoin touched the highs of $8,897.81 yesterday. The popular cryptocurrency that was most purchased cryptocurrency in the second half of the last year is still long way from reaching the high of $19,783 that it touched on December 17 last year. Still, Bitcoin is trading for the year so far. However, not all are optimistic on Bitcoin recovering its highs of the last year considering the trading regulations that various countries are mulling over putting on the cryptocurrency.\n\nBitcoin is mother of all bubbles and this bubble will burst anytime soon, said Nouriel Roubini some weeks back. The famous economist who had rightly predicted the US housing crash in 2008 has once against said that the digital currency is on its way down as it lacks any fundamental value. The case of Bitcoin will turn out to similar to Mississippi bubble, tech bubble, and Tulip mania. The Bitcoin received a shot in the arm lately when popular business magazine Forbes came out with a list of Bitocin millionaires. The list was first of its kind brought out by a reputed media organisation. In India too, good amount of investments are parked in the virtual currencies especially Bitcoin.\n\nIn the last two months, Bitcoin struggled amid various fears over its regulation especially by South Korean regulators. Back in India even, government, RBI, Sebi and income tax department has issued warnings to the investors parking their money in the digital currencies especially Bitcoin. In Budget 2018, Finance Minister Arun Jaitley had said that cryptocurrency is not a legal tender in India but the government will explore blockchain to usher in the digital economy.", "Having hit two-week highs, bitcoin is now aiming for the $10,000 mark and beyond, but further gains may be transient, the charts indicate.\n\nBitcoin (BTC) picked up bid yesterday following a bullish breakout on charts and rose above $9,000 in a convincing manner. The cryptocurrency moved higher to $9,961 today - the highest level since Feb. 1, as per CoinDesk's Bitcoin Price Index (BPI).\n\nAs of writing, BTC is up more than 60 percent from the Feb. 6 low below $6,000. Furthermore, in the last 24 hours, BTC has appreciated by nearly 12 percent.\n\nThe price rise should put to rest the fears that bitcoin may take a beating or move in a sideways manner during the Chinese holiday lull. Besides, as discussed yesterday, February has been a good month for bitcoin since 2015.\n\nStill, the chart analysis suggests that a continued rally above $10,000 may not have legs.\n\nMeanwhile, the broader markets are also solidly bid, currently. Litecoin has appreciated by 28 percent in the last 24 hours and is the biggest gainer among the top 10 cryptocurrencies by market capitalization. Meanwhile, ethereum's ether token, Ripple's XRP, Stellar and NEO are up at least 8 percent each.\n\nSo, BTC looks set to test $10,000 and may extend gains to $11,000 as suggested by the inverse head and shoulders breakout.\n\nHowever, gains above $10,000 are to be viewed with caution, the weekly chart indicates.\n\nDisclosure: CoinDesk is a subsidiary of Digital Currency Group, which has an ownership stake in Coinbase and Ripple.\n\nMetro barriers image via Shutterstock", "LONDON - Bitcoin is climbing on Thursday morning and closing in on $US10,000 per coin for the first time in just over two weeks.\n\nBitcoin is up 3.6% against the dollar to $US9,825.91 at 7.55 a.m. GMT (2.55 a.m. ET). As the chart at the top shows, bitcoin slumped at the start of February but has been picking up again over the last week or so. It still remains far off its all-time highs of over $US19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent form. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets, but this may be simply a correlation rather than a causal link.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world. Charlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $US40,000.\n\nHere's how the other top 10 cryptocurrencies by trading volume are doing this morning:", "Bitcoin is up more than 8% Wednesday morning. You can track its price in real-time here.\n\nBitcoin is up more than 8% Wednesday morning, mirroring the broader cryptocurrency market, after the South Korean government appeared to backpedal on its reported plans to ban crypto mining and exchanges in the country.\n\nIn a video posted to the presidential website Wednesday, South Korea's minister of Governmental Policy Coordination, Hong Nam-ki, said the government would look at making cryptocurrency trading more transparent, instead of banning it outright, as previously feared, Bloomberg reported.\n\nIn January, news reports of a potential ban fueled selloffs that wiped out hundreds of billions of dollars of value from cryptocurrency markets around the world. Since then, more than 200,000 South Korean citizens signed an official government petition denouncing the proposed ban.\n\nBitcoin today remains the largest digital currency by market cap, and is now trading at $9,160 at the time of writing. That's up more than 50% from its trough just below $6,000 on February 6. Bitcoin currently accounts for 35% of the total cryptocurrency market value, according to CoinMarketCap.com.\n\nThe total market value for cryptocurrencies is up 7% in the last 24 hours.\n\n\"The news today that South Korea will not ban cryptocurrencies outright has buoyed the market, following a period of negative news,\" Iqbal Gandham, managing director of crypto platform eToro said in an email. \"Rumours of regulatory clampdowns have worsened what is typically a bad time of the year for cryptos, but the tide is starting to turn - particularly with Singapore also ruling out a ban last week.\"", "The hunt for hashrates by cryptocurrency miners is hurting the search for alien life, with miners pissing off SETI (Search For Extraterrestrial Life) as they can't find new GPUs to buy.\n\nSETI chief scientist Dan Wethimer told the BBC: \"We'd like to use the latest GPUs [graphics processing units]... and we can't get 'em. This is a new problem, it's only happened on orders we've been trying to make in the last couple of months\". So it's not just gamers that are mad at the price of second hand and brand new cards, but the lack of stock of new cards is hurting more than just gamers, reaching into the scientific community.\n\nSETI researchers need the GPUs to scan as many communications frequencies simultaneously, with SETI's base in Berkeley using 100 GPUs alone. SETI has other stations in Green Bank, West Virginia and Parkes, Australia are trying to expand, but the GPU shortage isn't helping. Werthimer continued: \"We've got the money, we've contacted the vendors, and they say, 'we just don't have them\".", "Right now we're in one of the worst positions ever for consumer graphics cards, with prices sky high and stocks at rock bottom, most GPUs are being eaten up by crypto miners. What can help, other than a purported next-gen GeForce GTX 20 series and possibly mining-specific SKUs of GTX 20 series cards? Ethereum ASIC miners, that's what.\n\nThe latest news coming in from China is that mining giant Bitmain is working on an Ethereum ASIC miner, the purported Antminer F3. Bitmain's rumored F3 Ethereum miner would pack 3 motherboards with 6 ASICs per motherboard, as well as 32 x 1GB DDR3 memory chips that would make for a very power efficient, but incredibly powerful Ethereum ASIC miner. This would put GPU mining for Ethereum out of business, almost overnight.\n\nBitmain is reportedly meeting with a few manufacturers in Taiwan, so you can be sure that they're talking to TSMC and others in order to see how many chips they can get their hands-on.\n\nThe new ETH ASIC chips will begin production later this month, with the ASICs hitting 200-200MH/s and this could be even better with final hardware. We would be looking at between $2500 and $3000 for the Atminer F3 Ethereum ASIC miner, which is not too bad at all considering the purported 200-220MH/s mining power.\n\nRussian scientists busted mining crypto in NUCLEAR facility\n\n6 x GPU packs now on sale for miners, GTX 1060s or GTX 1080s\n\nNVIDIA says cryptocurrency demand 'exceeded expectations'\n\nLedger owner? Your cryptocurrency can be easily STOLEN\n\n$4 trillion wiped off stock market, tech stocks are HURTING\n\nUS credit card companies block cryptocurrency purchases\n\nSamsung announces it's making cryptocurrency mining chips\n\nEthereum reaches new record all-time high price of $870\n\nRipple (XRP) value blows up, bypasses Ethereum's market cap\n\nCrypto expert kidnapped, had to pay $1 million BTC ransom\n\nUnikoinGold is now available on Bittrex\n\nBitcoin could be worth $0, according to Morgan Stanley\n\nFacebook Messenger malware mines Monero on users' PCs\n\nUsing 'blockchain' in new name, company shares rise 500%\n\nMiningSky 8-GPU Mining Rig V1 Review\n\nFrench dominatrix pimps clients out in 'Crypto Slave Farm'", "NEW YORK (CNNMoney) -- A piece of crypto-artwork sold for $1 million on Valentine's Day.\n\nThe digital photo of a red rose sold to a group of 10 collectors who split the cost evenly in cryptocurrency. This is thought to be the highest price ever paid for virtual artwork.\n\nThe project, called the Forever Rose, was produced by artist Kevin Abosch and GIFTO, virtual gifting platform on blockchain -- a digital ledger. It's the technology that supports cryptocurrencies such as bitcoin, but in this case it's hosting a digital picture.\n\nCrypto-art is a new market. While you can't touch the artwork or hang it in your home, collectors can choose to hold their \"rose token,\" sell it or give it to someone for a special occasion.\n\nIt's an abstract concept designed to get people thinking about how blockchain technology could be applied to the art world, according to a press release from both parties.\n\n\"People traditionally have valued things they can see and feel. But some of the most valuable things -- like love, for example -- can be felt but not seen,\" Abosch told CNN. \"Art reduced to its core essence is about the idea.\"\n\nAbosch is most well known or selling a photo of a potato -- called \"Potato #345\" -- for more than $1 million in 2016. He is also recognized for his celebrity portrait photography.\n\n\"When the potato [photograph] sold for a lot of money, there was discussion. Is it really worth so much?\" he said. \"People now might say why is cryptocurrency worth anything? People do that with art in general.\"\n\nThe artist recently launched another crypto-art project called IAMA Coin, which combines both physical and virtual art. He has created 100 physical artworks and 10 million virtual artworks. The physical works are stamped using the artist's own blood.\n\nMore than 150 potential buyers from around the world showed interest in the Forever Rose. The 10 collectors who bought the artwork include leaders and investors in the crypto world, such as ORCA Fund, Future Money and Ink and TLDR Capital.\n\nThe proceeds from the sale will be donated to the CoderDojo Foundation, an organization that offers free computer programming clubs for young people.\n\nTM & © 2018 Cable News Network, Inc., a Time Warner Company. All rights reserved.", "Looking for ET isn't easy. But unfortunately for the folks at SETI and elsewhere, it's gotten a lot harder in recent months, thanks to a rush on computing power spurred by cryptocurrencies like Ethereum and, to a lesser extent, Bitcoin.\n\nThe root of the problem is an acute shortage of computer graphics cards, known as GPUs. Top-of-the-line consumer GPUs are prized by both cryptocurrency miners and astronomers for their ability to crunch large batches of big numbers at a low price. But as prices for cryptocurrencies have risen, miners have snapped up the cards, driving up prices on secondary markets like eBay.\n\nRadio astronomers studying astrophysical phenomena have also been hit by the shortage.\n\nIn some cases, the GPUs simply aren't available. In others, the grant budgets they wrote months or years ago are no longer sufficient. GPUs that once sold for $500 have doubled in price.\n\nSETI researchers process vast amounts data from a variety of telescopes around the world and in space, including both optical and radio types. Here's Chris Baraniuk, reporting for BBC News:\n\n\"At Seti we want to look at as many frequency channels as we possibly can because we don't know what frequency ET will be broadcasting on and we want to look for lots of different signal types - is it AM or FM, what communication are they using?\" explained Dr Werthimer, who is chief scientist at the Berkeley Seti Research Center.\n\n\"That takes a lot of computing power.\"\n\nBitcoin and other cryoptocurrencies -- the future of money or hype? Here's what they are.\n\nGraphics chip manufacturers have been struggling to meet demand for their wares, and they're wary of ramping up production too quickly. While Ethereum can still be profitably mined using consumer hardware, Bitcoin miners have moved on to specialized equipment. If Ethereum miners do the same -- or if the cryptocurrency's value plummets -- it's possible that the GPU crunch will ease. But if not, astronomers may have to get creative.", "CryptoWatch Daily: Is no one reporting crypto ownership in their taxes?\n\nAs nearly all major digital assets on Wednesday were rallying, the cryptocurrency market was contemplating a notable climb in Litecoin and questions about which digital-asset traders are forking over money to the Internal Revenue Service.\n\nAlmost no one is paying taxes\n\nOf the first 250,000 tax filings, less than 100 people reported owning any cryptocurrency, according to a survey from credit-monitoring company, Credit Karma. If that sounds tiny, it translates to a minuscule 0.04% of cryptotraders paying taxes to Uncle Sam, according to the company.\n\n\"While so few people have reported Bitcoin and other cryptocurrency gains or losses, we're not surprised. Generally, Americans with more complex tax situations file later in the tax season, especially if they expect that they'll owe money,\" said Jagjit Chawla, a general manager in Credit Karma focused on taxes.\n\n\"However, given the popularity of bitcoin and cryptocurrencies in 2017, we'd expect more people to be reporting,\" Chawla said.\n\nCryptoWatch: Check bitcoin and other cryptocurrency prices, performance and market capitalization -- all on one dashboard\n\nLitecoin surges, hits three-week high\n\nThe boomlet in gains for virtual currencies, with a single bitcoin BTCUSD, +9.01% trading above $9,300 for the first time since early February, was highlighted by a surge in bitcoin offshoot Litecoin, pushing it to a roughly three-week high at around $200.\n\nThe news that Litepay -- a new payment system for Litecoin -- will be released on Feb. 26, fueled buying over the potential game-changing technology. If successful, Litepay will allow business to transact in Litecoin, as well as offering consumers a number of other features.\n\n\"Spend dollars anywhere debit cards are accepted, or withdraw cash from any compatible ATM,\" Litepay's website says.\n\nThe price of Litecoin, which was created as faster rival to bitcoin in 20111 by Charlie Lee, hit $216, representing an increase of about 35%.", "Electroneum, the exciting new mobile-based cryptocurrency, is set to be listed on KuCoin, one of the top exchanges in Asia.\n\nThis comes as Electroneum announces a partnership with QUOINE, showing that the team is taking expansion into the Asian markets seriously.\n\nKuCoin has a great reputation as a secure and technologically advanced exchange and should bring significant new market exposure to Electroneum. The Electroneum team will be working with KuCoin to promote the mobile-focused cryptocurrency across Asia using KuCoin's \"To The Moon\" marketing package, which is focused on introducing new users to trade Electroneum.\n\nRichard Ells, CEO of Electroneum, said:\n\nWe support 20 different languages but are only currently listed on English based exchanges. We've chosen the KuCoin marketing campaign package that has had the most dramatic effect on the price of other coins that have listed on KuCoin. They're also giving away a limited number of ETN in a special joint promotion, so if you don't have an account there yet - I recommend getting opening one. I'm confident this will greatly increase our exposure in Asia.\n\nThis will be welcome news for the Electroneum community, one of the largest cryptocurrency communities in the world. They will be able to confidently trade ETN on another secure and reliable exchange, and the coin will be exposed to huge numbers of cryptocurrency enthusiasts in Asia.\n\nWith exchange listings pending on some of the largest exchanges in the world and the recent news that Electroneum will be exhibiting at Mobile World Congress, the eyes of the cryptocurrency world will be carefully watching the British coin as it charts its course to mass user adoption.\n\nElectroneum is a brand new disruptive technology, combining blockchain, cryptocurrency and mobile ubiquity to make something entirely new.\n\nIt is designed entirely for mass adoption, aiming to be the largest cryptocurrency by user numbers during 2018. It has signed agreements in place with mobile telecoms providers giving Electroneum access to over 100m users.\n\nYou can find further details about Electroneum at https://electroneum.com and you can find live and historical coin price information here: https://coinmarketcap.com/currencies/electroneum/\n\nIn addition to the upcoming addition to KuCoin, Electroneum is also available to trade on Cryptopia here: https://www.cryptopia.co.nz/Exchange?market=ETN_BTC", "Bitcoin, LiteCoin, Ethereum and Ripple prices to soar in cryptocurrency boom during 2018, experts predict Jasper HamillWednesday 14 Feb 2018 4:06 pm Share this article with Facebook Share this article with Twitter Share this article with Google Plus Share this article through email Share this article with Whatsapp Share this article through\n\nThe price of Bitcoin will shoot up by almost 3,000% during 2018, experts have predicted.\n\nA group of 13 experts have suggested Bitcoin will be the best performing of all cryptocurrencies this year and could shoot up to a value of $14,928 by March 1 and hit $43,472 by the year's end - more than four times the $9,200 it's currently worth.\n\nTo make this prediction, the price comparison website finder.com assembled a council of 13 crypto-experts, including financial technology entrepreneurs, Bitcoin investors and financial analysts.\n\nThe group said Ethereum would experience huge growth, surging by almost 200% this year.\n\nRipple should also show slight growth, although it is expected to drop by 8% by the end of February.\n\nIf you're looking for a good investment, the experts said you should go for Cardano which is predicted to shoot up by more than 1,600%.\n\nHowever, anyone hoping that the rise of the joke currency Dogecoin will continue is in for a disappointment.\n\nThe analysts said it would plunge by about 5% by the end of 2018.\n\nJon Ostler, UK CEO at finder.com, said: 'It's interesting to see a shared optimism by our panellists, despite the fact that there's been a collective fall in cryptocurrency prices.\n\n'While we saw the top 10 coins dive by 24 percent last month, our survey shows panellists are expecting this to be a bump in the road as these coins are set to recover.\n\n'While these results show an indication of movement, it's difficult for anyone to really know which direction these coins will move and whether outside factors such as regulation, laws and banking systems could create a serious impact to the future and value of some coins out there.'", "Litecoin prices surged by more than 30% Wednesday as the hype around the introduction of Litepay gained momentum.\n\nLitepay is a new payment system for Litecoin, which will allow businesses to accept Litecoin payments, and offer users the ability to \"spend dollars anywhere debit cards are accepted, or withdraw cash from any compatible ATM,\" according to its website. The announcement will bring the fifth biggest cryptocurrency closer to mainstream use.\n\nWe started because the people asked @Bitpay to accept LTC. They wouldn't, so we took the challenge. Infrastructure for LTC February 26 Ὠ0#PayWithLitecoin #LitePay -- LitePay, Inc. (@LitePayInc)\n\nFebruary 13, 2018\n\nThe price of Litecoin reached an intraday high of $216 Wednesday, representing a 35% rally. The move has dragged other cryptocurrencies higher with the No.1 digital currency bitcoin BTCUSD, +7.61% trading above $9,200.\n\n\"In the last 24 hours or so we've seen large buying volumes relative to the last few weeks following some positive recent news including Litepay announcing a 2/26 launch,\" aid Alex Sunnarborg, founding partner of Tetras Capital.\n\nSunnarborg said that the wider crypto positive news, which includes work on Bitcoin's Lightning Network has helped the rally in Litecoin prices.\n\nIn addition to the Litepay news, Microsoft Corp. MSFT, -0.29% announced it would embrace bitcoin and Ethereum to shore up identity and security issues.\n\n\"After examining decentralized storage systems, consensus protocols, blockchains, and a variety of emerging standards we believe blockchain technology and protocols are well suited for enabling decentralized IDs,\" Microsoft said in its press release.\n\nWednesday's rally in Litecoin has taken its total market cap to $11.8 billion, according to Coinmarketcap.com.\n\nCryptoWatch: Check bitcoin and other cryptocurrency prices, performance and market capitalization -- all on one dashboard", "The fear and build up towards Aug. 1, 2017, and the creation of Bitcoin Cash which forked off the original chain was monumental. However, it was a damp squib for the future of Bitcoin as it actually spiked in value.\n\nSince then, forks on Bitcoin have become almost as common as ICOs, and in fact, forks on the Bitcoin chain look to be the latest trend for 2018 as new companies look to cash in on the familiar Bitcoin name.\n\nBitcoin Cash is, of course, the most well known Bitcoin fork out there, sitting comfortably in the top five coins in terms of market cap. However, in 2017, there were 19 registered Bitcoin forks. Still, that pales in comparison to the 50 that are expected this year, according to Lex Sokolin, global director of fintech strategy at Autonomous Research.\n\nThat number could still rise further as there is even services out there that are providing rudimentary programming skills to launch a clone. This will of course have a big effect in the cryptocurrency market as hedge fund manager Ari Paul predicted in a tweet:\n\nThere are a number of reasons to fork off the Bitcoin Blockchain, some do it, in the case of Bitcoin Cash, to seemingly improve facets of the old coin, while others may have different motives. As George Kimionis, chief executive officer of Coinomi puts it:\n\n\"Unfortunately, most fork-based projects we see today are more of a sheer money grab. Looking back a few years from now we might realize that they were just mutations fostered by investors blinded by numerical price increases rather than honest attempts to contribute to the Blockchain ecosystem.\"\n\nKimionis also sees a new phase in the ICO marketplace with the original hype simmered down somewhat. Forking adds a little edge to a new coin. And Rhett Creighton, who's working on the upcoming Bitcoin Private fork, predicts:\n\n\"Bitcoin forks are kind of the new altcoin. We are going to see now a bunch of Bitcoin forks. And they are going to start replacing some of the top hundred altcoins.\"\n\nIt is hard to see these minor forks, even the likes of Bitcoin Gold and Diamond which reached the news, really, truly, adding much to the Blockchain environment. Even Bitcoin Cash has been linked to a money making scheme for the likes of Jihan Wu and Roger Ver. The difference between trying to improve the Blockchain, and to make money off a name, is a very blurred line.", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nThe Litecoin price leaped by nearly 30 percent on Tuesday in response to the announcement that payment processing startup LitePay would officially launch in less than two weeks. The rally enabled LTC/USD to crack the $200 barrier, and it raised LTC/BTC to its highest value in nearly three years.\n\nLitecoin is currently priced at $197 on Bitfinex, although premiums on other exchanges have hoisted its global average just above the $200 mark. Litecoin now has an $11.1 billion market cap, lifting it to fifth in the rankings.\n\nSignificantly, although Litecoin is still trading well below the peak USD value it set in mid-December, LTC/BTC is trading at .0227 BTC, its highest point since July 2015.\n\nDiverging from previous pumps, LTC trading volume is very evenly distributed across the world's major exchanges. At 26 percent, OKEx accounts for the largest slice, while GDAX ranks second with 14 percent. South Korea-based Bithumb and Upbit each prices Litecoin at an eight percent premium over other exchanges, but their trading pairs only account for a combined 10 percent of global LTC volume.\n\nTuesday's rally comes in direct response to the announcement that LitePay, a payment processing company modeled after industry stalwart BitPay, is scheduled to launch on Feb. 26. The company quietly made the announcement on Twitter on Monday, but word seems to have traveled slowly, given that the rally is just now taking off.\n\nAccording to the San Francisco-based company's website, LitePay will offer many of the same features as BitPay. Most notably, it will provide businesses with the ability to accept LTC payments that are settled in fiat currency. Additionally, it will issue Litecoin debit cards, which users can fund with LTC and use at virtually any retailer.\n\nSince Litecoin markets itself as a payment-focused cryptocurrency, the establishment of LitePay's infrastructure will greatly aid its utility for this use case.\n\nHowever, another theory is that Litecoin's bullish pivot could be tied to the announcement that a group of developers is going to fork the main Litecoin blockchain on Feb. 19 to create Litecoin Cash, airdropping coins to all wallet addresses that hold LTC at the time of the fork.", "February 14th, 2018 - Wild Crypto (SYMBOL: WILD), the revolutionary international lottery and eGaming platform built upon blockchain technology, has gone live following last year's successful token sale.\n\nThe platform is the first of the major new cryptocurrency gaming projects to launch, and does so just four months after it raised 10,592 in Ether during a ground-breaking token sale.\n\nWild Crypto offers a range of lottery, slots and bingo games, where players can stake WILD tokens for the chance of winning prizes. These include a first lottery draw offering a one million WILD token jackpot.\n\nWilliam Trentini, CEO, Wild Crypto, said: \"While other fundraised blockchain gaming platforms are taking years to deliver, Wild Crypto has delivered an innovative, game-changing product in just four months.\n\n\"Our early investors have already enjoyed a wild ride, but now we are live we look forward to delivering an ever-improving gaming experience to our customers.\"\n\nIn recent weeks, the price of WILD tokens has soared in anticipation of the launch, but are still trading on exchanges such as Cryptopia at quite undervalued prices.\n\nHowever, WILD tokens will be sold on the Wild Crypto platform at 100 per 1 Ether, giving each token a value of around $8 in today's market.\n\nThe Wild Crypto platform, which is regulated via a Curaçao license, is delivered by regulated lottery specialist Twelve40, which supplies the certified back-end game technology for the new platform.\n\nWild Crypto (SYMBOL: WILD) is the developer of a disruptive, international lottery and eGaming platform built upon blockchain technology.", "It is not the European Central Bank's job to regulate Bitcoin, its President Mario Draghi has said, while warning the public about the risks associated with the volatile cryptocurrency.\n\nCalls are growing for authorities, including central banks, to step in and regulate the market for digital tokens.\n\nBitcoin has seen wild price swings and a series of heists as well as a rapid proliferation in the number of coins on offer.\n\nBut Mario Draghi said in a video response to questions from the public that banning or regulating such tokens was not one of the ECB's tasks.\n\n\"Many of you posted questions about whether the ECB is going to ban Bitcoins or it's going to regulate Bitcoins,\" Draghi said.\n\n\"I have to say it's not the ECB's responsibility to do that.\"\n\nThe head of the Bank for International Settlements, Agustin Carstens, called last week for central banks to end what he described as the \"Ponzi scheme\" of cryptoacurrencies, by restricting their access to banks and financial infrastructure.\n\nThe world's largest central bank chiefs are expected to discuss the matter at a G20 meeting in Buenos Aires in March.\n\nAnswering a question from a member of the public about whether he should buy Bitcoin, Draghi struck a cautious tone.\n\n\"Frankly I would think (about) it carefully,\" he said.\n\nMario Draghi pointed out that the value of Bitcoin had oscillated much more wildly than that of the euro and that cryptocurrencies were not backed by any public institution.\n\nHe added blockchain, the distributed ledger technology used to record Bitcoin transactions, was \"quite promising\" and expected it to bring \"many benefits\", citing its possible use to settle payments.\n\nHe cautioned, however, it was not yet safe enough for use by central banks.\n\n\"We're very interested in this technology but it's still not secure for central banking and therefore we need to look through it and investigate it more,\" he said.\n\nThe ECB and the Bank of Japan have been looking into using blockchain for financial market infrastructure for over a year, reporting in September \"promising results\" but \"no direct conclusion\" for its practical use.", "Raking in $1 billion in 2017, Coinbase seems like the perfect investing opportunity to play the crypto market without having to buy and safeguard Bitcoin, Litecoin, or Ethereum.\n\nBut because the San Francisco-based firm is private, there isn't a Coinbase stock symbol.\n\nYou see, all IPOs are subject to volatile price swings, no matter the industry.\n\nFrom yesterday's (Feb. 12, 2018) opening price of $18.84, some early investors have now lost 33.12% of their original investment.\n\nHowever, we still found a way to profit from the cryptocurrency market without having to buy a risky IPO or even own a cryptocurrency.\n\nBest of all, our readers can invest in it today.\n\nIn fact, some of our readers have already made a profit of 23.43% in the two months since our first report about this company came out on Nov. 27, 2017. In that same time, the Dow Jones Industrial Average climbed just 11.71%.\n\nNot too bad.\n\nCollect a Colossal Payday Thanks to California's Legal Cannabis - Click Here Now to Learn How to Position Yourself for Windfall Profits\n\nBut in the next 12 months, wealth management company DA Davidson projects this company's stock price could climb another 83.48%.\n\nToday, we'll show you our backdoor crypto investing play through an established company that's been in business since 1999 and is worth $1.4 billion.", "Despite the recent price plunge, the market value of all digital currencies will more than double in 2018, according to the chief executive of Kraken, one of the major cryptocurrency exchanges.\n\nThe crypto market will continue to see an \"acceleration\" of growth, founder and CEO of the exchange Jesse Powell told CNBC.\n\n\"You've got a lot more kids graduating from crypto programs at universities now. I think we're just going to see it continue exponentially from here,\" Powell said.\n\nPowell's Kraken is currently ranked 8th by trading volume on cryptocurrency website CoinMarketCap, trading at around $300 million over a 24-hour period.\n\nThe market value of all the world's virtual currencies currently stands at around $432 billion, according to CoinMarketCap. It managed to reach an all-time high of nearly $800 billion at the beginning of the year before a massive sell-off that dragged digital currencies down. Bitcoin, the world's first cryptocurrency, lost about two-thirds of its value at the time.\n\nAccording to some conventional traders, digital investing lacks intrinsic value with its current course looking like a bubble. Financial watchdogs across the globe have recently issued warnings to the public about potential risks connected to crypto trading. Moreover, regulators in India, South Korea and China have recently upped their rhetoric against digital currencies.", "South Korea will seek to increase transparency in cryptocurrency trading by stamping out illegal activities, the Blue House, the country's equivalent to the US White House, has said.\n\nThe nation will prioritize transparency in trading of virtual currency within the boundaries of the current law, and block illegal and unfair activities, but ruled out banning trading.\n\nIt will also continue to support the development of blockchain.\n\nThe Blue House was responding to a petition made to its website back in December, which demanded less regulation on virtual currency trading. The petition gained 200,000 signees within a month, which warranted a response.\n\nDecember saw virtual currency prices hit an all-time high. Bitcoin, the most famous, reached $20,000, prompting a huge market frenzy South Korea.\n\nBut following the government announcement the same month that it plans to regulate the market due to fear of overheating, the prices of virtual currency plummeted.\n\nMore regulatory announcements from China and India pushed the price down further and the price of bitcoin currently hovers below $9,000.\n\nSince then the government has downplayed a total ban but continued to stress the importance of regulation.\n\n\"We have been monitoring the market and global trends meticulously and carefully, and all options are on the table,\" said Hong Nam-ki, minister of the office for government policy coordination, at the Blue House.\n\nLast month, financial regulators announced stricter authentication for opening virtual currency accounts. Anonymous accounts are banned and exchanges must deal with registered banks as of January 30.\n\nThe regulation was much softer than expected as regulators had previously said banning exchanges was being considered as an option.\n\nHong also added that the government stood behind its support for the blockchain industry. As blockchain, or digital ledger, is based on the same technology as cryptocurrency, there were fears that the government was pulling out from fostering it.\n\nSouth Korea is thought to be third globally in total trading volume with over dozens of exchanges, behind frontrunner the US and runner-up Japan.", "The Commonwealth Bank has banned its customers from buying bitcoin on credit cards after the recent plunge in the cryptocurrency's value, saying such purchases are no longer \"appropriate.\"\n\nThe country's largest bank on Wednesday started sending text messages alerting affected customers to the ban, which follows similar action by large banks overseas in the wake of a more than 50 per cent plunge in bitcoin's value from last year's peaks.\n\nThe crackdown comes amid concern among banks overseas that further sharp falls in the price of bitcoin could leave some customers with large debts, creating extra risk for banks.\n\nIt is understood CBA also has concerns about the risk to customers' financial welfare of allowing people to borrow to invest in such a volatile asset at credit card interest rates, often near 20 per cent.\n\nCBA is not stopping customers from using their own money to buy bitcoin as it will continue to allow purchases through debit cards or transaction accounts.", "TRX is attached to a new blockchain-based technology that aims to revolutionise the way people consume entertainment\n\nAFTER Bitcoin's price exploded last year, all eyes have been on the volatile and expanding cryptocurrency market.\n\nTron, which hit the market in September 2017, is one of the newest kids on the crypto-block...\n\nLike Bitcoin, Tron is cryptocurrency which is traded online.\n\nBut unlike Bitcoin, it is attached to a new blockchain-based technology that aims to revolutionise the way people consume entertainment.\n\nTron claims to allow users to freely publish, store and own data - which can create a decentralised content distribution platform.\n\nThe company says this will allow it to undercut its centralised competitors like Google Play and Apple's App Store, which charge high fees.\n\nIt is based on the technology behind another cryptocurrency - Ethereum.\n\nTron's official cryptocurrency is called Tronix (TRX).\n\nTron has been trading since mid-September, and went from strength to strength as the hype around cryptocurrencies exploded.\n\nThe cryptocurrency was worth just $0.0021 (£0.0016) for a single unit on December 5.\n\nBy January 5, though, its value had soared to over $0.25.\n\nLike other cryptoccurencies, it has suffered in recent weeks - on February 12, it is priced at $0.046 (£0.03).\n\nThere are few places where you can buy TRX for real money.\n\nInstead, you need to buy Bitcoin or another cryptocurrency and trade it for TRX.\n\nYou can make this trade using an online currency exchange such as Coinnest, Binance or Liqui.\n\nAnyone thinking of investing in Bitcoin or another cryptocurrency should be very careful.\n\nTheir values are volatile, with the ability to plummet as quickly as they shoot up.\n\nAnd investors are frequently targeted by hackers and other criminals who seek to steal their crypto-cash online.\n\nBe especially careful if you are using direct, peer-to-peer platforms to sell and buy cryptocurrencies.", "Bitcoin mining is becoming more expensive, according to JPMorgan.\n\nBitcoin miners are in an arms race and it is driving the cost of minting new bitcoin to all-time highs.\n\nThat's according to a big report on cryptocurrency out Friday by financial giant JPMorgan.\n\nMiners are the folks who unleash new bitcoin into the universe by running computationally intensive algorithms on systems called rigs. The miners pumping out the most computing power - or \"hash rate,\" referring to how many cryptographic calculations the machines can do per second - have the best chance of earning a new bitcoin. As such, miners are building more and more rigs to one-up their competition.\n\n\"The industry is currently in a hash rate arms race, as the current bitcoin price is incentivizing the addition of more and more mining capacity,\" the report said.\n\nThat doesn't mean more bitcoin are being created. The coin's network is designed to increase the difficulty of successfully mining a coin as the total hash power increases in order to maintain a more or less steady rate of bitcoin creation. More hash power means higher energy costs. As such, the cost to mine one bitcoin has increased dramatically.\n\n\"If this growth in hash rate continues (as it likely will if margins stay positive) without an offsetting increase in energy efficiency of miners, average costs globally will continue to rise,\" the bank found.\n\nAlready, the bank estimates the price of mining one bitcoin has jumped 10-fold over the last year.\n\nThe bank estimates that the price to mine a single bitcoin is approximately $US3,920 a coin. That varies depending on geography and energy costs, however. Take a look at the chart:", "Dealing in Bitcoins? We advise caution as it was in bear territory last week, plummeting all the way to $6,000. It stabilised over the weekend at over $8,000, and investors heaved a huge sigh of relief. For how long, we can't tell, because we don't know, but beware of scams and get-quick-rich schemes. Conmen are using the temporary rise and fall in the value of the cryptocurrency to swindle people of their hard-earned money.\n\nA Sharjah resident has lost Dh2million in such a scheme, according to our report, and readers should watch out for such fraudsters who are using the volatility in the price of the digital currency to profit from it in an illegal way. Leading economist Nouriel Roubini has even predicted that Bitcoin could crash to zero. The American economist last week called it the 'biggest bubble in human history'.\n\nRoubini based his predictions on what is known as \"wash trading\" that traders use to inflate prices. It involves \"buying and selling\" digital orders to tamper with crypto-markets. Reports say this is already happening with regard to Bitcoin, so it's best to go slow until more clarity emerges.\n\nSo, what's really happening in the crypto world, a space fraught with risks, where only those who dare stand to benefit? The market is recovering after last week's blues. On Monday, other digital currencies like Ethereum, Litecoin and Ripple were up from between 4 to 10 per cent. Bitcoin flirted with $9,000 before falling. We agree it may be teasing and tantalising even at that rate, if you are prone to flirting with danger, or if you have the money to burn. But it would be wise to lend a ear to what Roubini is saying. A bubble may be in the making without proper control.\n\nMeanwhile, the regulator of Abu Dhabi's international financial centre said it is considering rules for virtual currency exchanges. This is a shift, which bodes well to prevent future volatility and protect investors. Currently, the UAE Central Bank does not recognise Bitcoin as there are fears that it could be used for money laundering and terror financing. A change in policy helps the government keep an eye on digital markets and would be in the best interest of residents.\n\nCopyright © 2018 Khaleej Times. All Rights Reserved. Provided by SyndiGate Media Inc. (Syndigate.info).", "A bitcoin sign is held outside Hong Kong's first bitcoin retail store during its opening, in Hong Kong February 28, 2014. -- Reuters picNEW YORK, Feb 13 -- Bitcoin is heading lower -- much lower -- if the go-go years of the dot-com bubble are any indication.\n\nAlready slashed by more than half since hitting a record near US$20,000 (RM79,000) in December, the cryptocurrency could plunge a further 90 per cent in an environment of unsustainably growing supply, according to Bloomberg Intelligence commodity strategist Mike McGlone. Using Amazon.com Inc and the Nasdaq Composite Index's spectacular rise and retreat at the turn of the millennium as a proxy, he said the currency could plunge to US$900.\n\n\"I spend a lot of time reading about this, and the more research I do, the more bearish I get,\" McGlone said in an interview. \"It's very similar to these Internet companies we saw in the late 90s.\"\n\nWhile the creators of Bitcoin intended to limit supply to 21 million coins, forks mean that there are already more than 50 million outstanding coins based on the original blockchain. There's also nothing preventing rivals from spawning an infinite amount of clones, he said. The number of tradable cryptocurrencies jumped 120 per cent in the past year.\n\n\"Parabolically increasing supply is the primary limitation to cryptocurrency market-price appreciation,\" McGlone said. \"There's strong gravitational pull toward US$900, the average price since inception and the start of 2017.\" -- Bloomberg", "Iceland is experiencing a boom in bitcoin mining a boom for the economy but also a huge drain on power resources in the country. Snorri Sigurbergsson, an employee of the energy company HS Orka, claims the consumption of energy by cryptocurrency miners is likely to double to 100 megawatts this year. This is greater than Icelandic households use according to the national energy authority. There are 340,000 people in Iceland. Bitcoin mining Bitcoin mining is explained in the appended video. The Investopedia explains: Bitcoin mining is the process by which transactions are verified and added to the public ledger, known as the block chain, and also the means through which new bitcoin are released. Anyone with access to the internet and suitable hardware can participate in mining. The mining process involves compiling recent transactions into blocks and trying to solve a computationally difficult puzzle. The participant who first solves the puzzle gets to place the next block on the block chain and claim the rewards. The rewards, which incentivize mining, are both the transaction fees associated with the transactions compiled in the block as well as newly released bitcoin. Every ten minutes a miner wins a price of 12.5 bitcoins, still worth over a hundred thousand dollars in spite of a huge decline of more than half of bitcoin's value. Mining has now consumed power to the extent that the entire network consumption is said to be equivalent to that of the Republic of Ireland. In Iceland power consumption by mining has overtaken its other productive uses. The reason is simple. Iceland has a great deal of energy with geothermal and electric plants around the island that is has many volcanoes. Miners look worldwide for cheap and plentiful sources of power. The arctic air cools the server rooms instead of expensive air-conditioning as the chips used to mine produce huge amounts of heat. For now mining facilities are increasing power consumption fast in Iceland Sigurbergsson said that for now there is exponential growth in energy consumption by mining centers. He does not see this stopping at present. He claims that he is getting many calls from investors wanting to build centers in Iceland. However, there are doubters as to the value to Iceland of the increased mining activity. Smari McCarthy an MP from the Pirate Party said: \"Cryptocurrency mining requires almost no staff, very little in capital investments, and mostly leaves no taxes either. The value to Iceland... is virtually zero.\"", "Bitcoin and all things cryptocurrency have found themselves at the top of a list of most highly demanded skills for freelancers in 2018. Leading freelance marketplace, Upwork, recently surveyed their users and found that skills relating to digital currency were the fastest-growing sector of freelancer talents on their platform. The results were also dominated by emerging technologies. Along with Bitcoin, AI and AR related skills were noted as growing rapidly. Evidently, the appetite for those with skills relating to cryptocurrency is not following suit with the price of a single Bitcoin which recently took a tumble from its all-time highs.\n\nAccording to reports from Upwork and the Freelancers Union, those independently employed are preparing for the mass upheavals in the way people work with every great technological leap forward in a more effective way than their peers who work for a single employer. The findings of the two mentioned sources indicate that sixty-five percent of freelancers claimed to be keeping up to date with further career preparation in line with evolving technological sophistication and greater machine learning.\n\nAccording to news outlet Fast Company, the list of skills that clients are seeking from the online talent marketplaces like Upwork are indicative of future work trends in general. This is based on the fact that the number of people working as freelancers is growing three times faster than the rest of the more traditionally employed US workforce. This figure is based on the findings from the survey by Upwork and the Freelancers Union entitled \"Freelancing in America\".\n\nMeanwhile, the planet's top-ranked, private sector think tank, the McKinsey Global Institute, predicts that if freelancing talent platforms such as Upwork continue to grow at the rate mentioned earlier, they could add an additional $2.7 trillion to the global Gross Domestic Product by 2025. The would equate to almost two percent of the nations entire GDP.", "Jesse Powell, the founder and CEO of the cryptocurrency exchange, Kraken, has stated that the entire cryptocurrency market will reach a $1 trillion valuation this year. The remarks may be surprising to those who watched bitcoin's price plummet in January, but many inside the cryptocurrency ecosystem, including the Winklevoss brothers, have remained bullish on the future of bitcoin and cryptocurrencies in general.\n\nTalking to CNBC, Powell answered in the affirmative when asked if he believed cryptocurrencies would reach a $1 trillion valuation, up from today's $417 billion valuation. He reiterated his belief saying:\n\n\"You've got a lot more kids graduating from crypto programs at universities now. I think we're just going to see it continue exponentially from here.\"\n\nIf cryptocurrencies do begin to work their way up to a $1 trillion valuation, it could mean that we'll see another slew of media reports when coins reach new highs, which could, in turn, spur renewed interest for those looking to buy into cryptocurrencies.\n\nOne of the adverse effects of bitcoin has been the resources it requires to be mined. Mining warehouses, and hobbyists, have been looking to get in on the mining in a bid to strike lucky and earn some bitcoins if they mine certain blocks. The thirst for additional computing power has caused a surge in the price of graphics card; Nvidia reported a strong fourth quarter in 2017 as a result.\n\nSource: CNBC", "In recent times with the drop in Bitcoin prices, researchers have observed a shift in the investment to Gold. The opposite was observed at the end of last year when a CNBC report suggested that investors were dumping their gold to buy bitcoins in the US.\n\nAnalysts are now studying if there is a relationship between the prices of gold and Bitcoin. While they do, let us note some of the observations made of late, and analyze for ourselves:\n\nThere is an inverse relationship between gold and Bitcoin\n\nThe above graph shows the movement in gold prices between November and now. Notice a drop in price around the 11th December week, which is the same week when bitcoin hit a record high of around Rs 14 lakhs (Source: Koinex).\n\nGold ETF also saw an almost 15% drop in comparison to September 2017 in the US. As previously mentioned, it is said that the investors sold gold worth millions to invest in digital assets.\n\nBitcoin's loss is Gold's gain\n\nn the weeks following December 15, various events like South Korean exchange system hack, saw the volatile rates of Bitcoin decline. Whereas the same week was the beginning of the rise in gold prices.\n\nThe Week of 15th December 2017\n\nBitcoin futures contracts were launched in the same week when it hit its all-time high. If you were to add all the cryptocurrencies in the market, their value in terms of market cap was equivalent to 23% of the gold traded fund that wee(CNBC report).\n\nFind out: Why Does Bitcoin's Price Fluctuate So Much?\n\nBitcoin crashed last week\n\nIn the past week, Bitcoin crashed as much 52% of its all-time high to Rs 7 lakhs. But referring to the graph above once again, we can see the rise in gold prices last week.\n\nThis shows how investors having doubts with the volatality of the cryptocurrency are moving towards the traditional safe haven of the precious metal that is much more stable.\n\nGold has been a traditional favourite in physical form as well as digital.\n\nIt could go both ways\n\nIf there is indeed a serious inverse relationship between gold and bitcoin, the rising in gold investments could bring an end to the digital asset that everyone is skeptical about.\n\nOr could this be a chance to bet on bitcoin and watch it rise?\n\nMay be Right Now is The Best Time to Invest In Bitcoin.\n\nFor investment related articles, business news and mutual fund advise, subscribe to GoodReturns.", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nThe Ethereum Classic price posted a top 35-best 20 percent increase on Tuesday, defying the bearish trend of the overall market and lifting ETC to its highest mark since January.\n\n\"If you're not watching Ethereum Classic, you're doing it wrong.\"\n\nThus tweeted Barry Silbert, founder of the Digital Currency Group (DCG), on Monday. The DCG, of course, is the parent company of Grayscale Investments, which has created a fund that holds ETC on behalf of fund shareholders.\n\nConsequently, Silbert has a vested interest in promoting ETC. Even so, Silbert's tweet was prescient, because within hours the Ethereum Classic price had embarked on a 20 percent rally -- an advance that came even as other top cryptocurrencies pivoted into negative territory.\n\nAt present, the Ethereum Classic price is trading at $32 on Bitfinex, up from a low near $24.50 on Monday. This translates into $3.3 billion market cap, ranking ETC 14th on the charts.\n\nIt's not immediately clear what is contributing to the rally. There is speculation that it is tied to the upcoming launch of the Callisto Network, which will airdrop its tokens (CLO) to current ETC holders. However, developers have planned the airdrop's blockchain snapshot for block 5500000, which will take place on approximately March 5. Consequently, it seems somewhat doubtful that ETC is surging to such a great degree when the airdrop is still 20 days out.\n\nA glance at ETC's daily trading volume, though, shows a fairly-significant concentration of volume on South Korean exchanges, which currently price it at a premium of roughly seven percent over its value on other exchanges. On Upbit, ETC/KRW is priced at an equivalent value of $34.17, while Coinone prices it as high as $34.27. Altogether, KRW pairs account for more than 37 percent of all ETC trading volume.\n\nThat said, this concentration of trading volume does not necessarily indicate that this is a coordinated pump. Rather, it could be indicative of the fact that South Korean traders -- forced to undergo KYC verification following the adoption of new cryptocurrency trading regulations -- had yet to buy into ETC following the initial Callisto announcement last month.", "Litecoin cash is not affiliated with litecoin in anyway, and litecoin founder Charlie Lee has warned it could be a scam.\n\nLitecoin is down 2.2% Tuesday morning after the cryptocurrency's first hard fork, Litecoin Cash, was announced.\n\nLitecoin holders will receive 10 tokens of litecoin cash for every one litecoin they own, the newly minted Litecoin Cash foundation said Monday.\n\nThe goal of the new currency is to increase the \"block speed\" at which the network can process transactions. The foundation says litecoin cash has a goal block time of 2.5 minutes - faster than litecoin. Like bitcoin and most other major cryptocurrencies, but unlike the existing Litecoin network, litecoin cash will use the more energy intensive, but potentially more secure, proof-of-work mining method.\n\nThe fork will occur precisely at block 1371111. The Litecoin network is currently on block 1368028 at the time of writing,according to BlockCypher. The fork is expected to occur sometime around 9 p.m. ET on Monday, February 19.\n\nLitecoin, which was designed to be less energy intensive than bitcoin, saw an astronomical rise in 2017. The cryptocurrency skyrocketed from just $US3.73 a year ago, to as high as $US365 in December, leading founder Charlie Lee to warn investors about the possibility of losing everything. He also sold his entire stake after being accused of price manipulation.\n\nOne week before litecoin cash was announced, Lee tweeted a warning that any fork of litecoin was \"a scam trying to confuse you to think it's related to litecoin.\"\n\nForks aren't uncommon in the cryptocurrency world, although they are not without controversy. Bitcoin cash famously split from the flagship bitcoin in August 2017, but the forked cryptocurrency has been accused of merely riding the coattails of the more established bitcoin.\n\nBusiness Insider could not verify any individuals behind the Litecoin Cash Foundation, which does not claim to be related to litecoin in anyway. The organisation's website lists four team members, with no credentials or last names.\n\nLitecoin holders who wish to claim their share of litecoin cash can follow instructions listed on the litecoin cash website.", "The price of ETC, the native currency of the ethereum classic blockchain, is reporting double-digit gains Tuesday, a move that effectively recovers losses seen over the last two weeks.\n\nAs of writing, ETC is changing hands at $31.70 on Bitfinex, having clocked a two-week high of $32.90 earlier in the day's trading session. The cryptocurrency has appreciated by 20 percent in the last 24 hours, as per data source CoinMarketCap.\n\nStepping back, the move effectively means ETC has come full circle, returning back to a level last seen at January's end. The broad-based sell-off in the crypto markets that began on Jan. 30 saw ETC drop 57 percent to $14.00 (Feb. 6 low), and in this context, the rise to $32.90 marks the completion of a \"V-shaped recovery.\"\n\nSo far, the asset's investor community is associating the jump in prices with top forecaster Cryptonaire's decision to include ETC in the list of verified digital assets (VDA). Investors believe the move will likely generate more public interest in the cryptocurrency, resulting in a pickup in trading volumes.\n\nThat said, the technical charts also point to a bright future ahead.", "A small toy figure is seen on representations of the Bitcoin virtual currency in this illustration picture Thomson Reuters\n\nIt's not clear if or when a bitcoin-linked exchange-traded fund will go live, but it is clear that such a fund would be a game-changer for the digital currency.\n\nA bitcoin ETF has been viewed as a natural next step in bitcoin's maturation as an asset and could precipitate the entrance of more retail investors into the crypto market.\n\nJPMorgan outlined the benefits of such a fund in a note out to clients on Friday, referring to it as the \"holy grail for owners and investors.\" Here's the bank:\n\nHowever, the idea of a bitcoin ETF has received push-back from regulators who want to evaluate the potential risk they could present to investors. In response to that pushback, at least five companies have withdrawn their applications for a bitcoin ETF. As many as 10 bitcoin-linked ETFs are sitting in regulatory limbo, waiting for approval.\n\nJPMorgan\n\nSuch a product could have a transformational impact on the cryptocurrency. JPMorgan said that impact could resemble the impact of the first gold-linked ETF.\n\n\"Launched in 2004, SPDR Gold Shares ETF was the first gold ETF approved in the US by the SEC,\" the bank said.\n\n\"Since its launch, retail access to gold has skyrocketed as new investors more easily turn to the gold market as a portfolio diversifier and as a foundational asset.\"\n\nAfter the launch of the SPDR fund, the price of gold skyrocketed from $440 to a peak of $1,900 in 2011, the bank said.\n\n\"Today, the SPDR Gold Shares ETF is one of the biggest ETFs in the market with over $35 billion under management,\" JPMorgan said.\n\nThat's probably why we've seen a race by firms to launch their own bitcoin ETF, as the first mover advantage could ultimately translate into a fund's long term success.", "Bitcoin bulls risk losing control unless prices see a convincing break above the $9,000 mark soon, according to the technical charts.\n\nOf concern is that the cryptocurrency has failed twice to hold above $8,900, as indicated by CoinDesks's Bitcoin Price Index (BPI). Further, bitcoin also clocked a six-day high of $9,070.64 on Feb. 10, but quickly fell back below the key psychological level of $9,000.\n\nThus, the area around the $9,000 mark has been established as a point of stiff resistance, as is being discussed by the investor community.\n\nAs of writing, bitcoin's global average price on the BPI is at $8,390. The cryptocurrency has appreciated by at least 40 percent from the recent lows below $6,000. However, the bulls are still not out of the woods and need to move prices quickly above $9,000 or the bears could once more exert their influence.\n\nThat said, exhaustion around $9,000 has neutralized the immediate outlook and bearish revival is seen only below Feb. 2 low of $7,845.\n\nDaily chart: Long-term momentum studies turn bearish\n\nAs discussed yesterday, the weekly chart is biased towards the bears. Thus, the bulls need progress soon,via a quick move above $9,000.\n\nA close above $9,000 would confirm an upside break of the falling channel, meaning bearish-to-bullish trend change. It would also add credence to the bullish 5-day MA and 10-day MA crossover and open doors for a move higher to $11,500-$11,800.\n\nHowever, gains above $10,000 could be short-lived as detailed in the previous post.\n\nOn the other hand, a close below $7,851 (Nov. 2 low) would signal the corrective rally from Feb. 6 low has ended and would encourage stronger sell-off to $5,000.\n\nDisclosure: CoinDesk is a subsidiary of Digital Currency Group, which has an ownership stake in Coinbase.\n\nTightrope image via Shutterstock", "By: PTI | Boston | Published: February 12, 2018 8:03 pm Customers can have their genome sequenced for under ,000, which could then be sold to scientists or pharmaceutical manufacturers. (Image Source: Reuters) Russia busts cryptocurrency miners at secret nuclear weapons labNvidia joins AMD in crypto gold rush as mining boosts resultsCryptocurrency racket bust: Online videos gave away accused, helped end four-month hunt\n\nYou may soon be able to make money by selling your own genetic data, thanks to a US-based start-up that is offering a service to sequence a customer's genome. Customers can have their genome sequenced for under $1,000, which could then be sold to scientists or pharmaceutical manufacturers.\n\nThe transactions would occur using cryptocurrency technology used for secure valued transactions such as Bitcoin. The company called Nebula Genomics is headed by George Church, who suggests that the approach is the wave of the future. Most other genome sequencing companies retain ownership of user data derived from spit swab genetic samples, leaving customers out of the proceeds when they sell the data to other companies.\n\nDue to price and privacy issues, the number of people taking part in personal genome sequencing is low, the start-up claims. To best make use of genomic data, researchers need samples from more people, which would help reveal trends underlying currently unknown hereditary disease factors, 'TechXplore' reported.\n\nThe only way to get many more people involved is by guaranteeing that their data will only go where they decide and by bringing the cost down, the startup claims. Customers would be is using a cryptocurrency sold by the start-up. Those wishing to have their genome sequenced would buy a token, which they in turn could sell to another buyer, thereby recovering their initial expenditure.\n\nThe value of tokens can change depending on a variety of factors. The tokens can only be redeemed by purchasing someone's DNA data, their value will depend on the willingness of big companies to use them to pay for data.", "You may soon be able to make money by selling your own genetic data, thanks to a US-based start- up that is offering a service to sequence a customer's genome. Customers can have their genome sequenced for under USD 1,000, which could then be sold to scientists or pharmaceutical manufacturers. The transactions would occur using cryptocurrency technology used for secure valued transactions such as Bitcoin. The company called Nebula Genomics is headed by George Church, who suggests that the approach is the wave of the future. Most other genome sequencing companies retain ownership of user data derived from spit swab genetic samples, leaving customers out of the proceeds when they sell the data to other companies. Due to price and privacy issues, the number of people taking part in personal genome sequencing is low, the start-up claims. To best make use of genomic data, researchers need samples from more people, which would help reveal trends underlying currently unknown hereditary disease factors, 'TechXplore' reported. The only way to get many more people involved is by guaranteeing that their data will only go where they decide and by bringing the cost down, the startup claims. Customers would be is using a cryptocurrency sold by the start-up. Those wishing to have their genome sequenced would buy a token, which they in turn could sell to another buyer, thereby recovering their initial expenditure. The value of tokens can change depending on a variety of factors.\n\nThe tokens can only be redeemed by purchasing someone's DNA data, their value will depend on the willingness of big companies to use them to pay for data.", "Technical indicators are showing that the uptrend would likely persist.\n\nBitcoin price appears to be getting back on its feet and might be poised to text the next upside hurdles soon.\n\nTechnical Indicators Signals\n\nThe 100 SMA is safely above the longer-term 200 SMA on the daily time frame, confirming that the path of least resistance is to the upside. The 200 SMA is holding as dynamic support as well.\n\nA candle appears to be closing above the descending channel resistance, and this is an early signal of a reversal from the short-term selloff. From here, bitcoin price could set its sights on the $11,000-12,000 area of interest next. This lines up with a former horizontal support and a broken rising trend line.\n\nAfter that, sustained bullish momentum could take bitcoin price to the next barrier around $13,000 to $14,000 which would be back above the trend line.\n\nStochastic is on the move up to indicate that buyers have the upper hand. RSI has more room to climb, so bitcoin price could follow suit. The gap between the moving averages is widening to reflect stronger bullish pressure as well.\n\nBitcoin price is also able to benefit from the improvement in investor sentiment these days. Note that the cryptocurrency has been trailing higher-yielders and risky assets like stocks and commodities, which tend to rally when traders are in the mood for more risk.\n\nApart from that, easing concerns about strict regulation in the cryptocurrency industry are in play. Following the Senate hearing encouraging regulators to give way to development even with increased oversight, other nations could follow suit and this might be evident in the upcoming global summits.\n\nAt the same time, crackdown efforts in South Korea appear to have taken the back seat as traders are now being more hopeful that governments and regulators could be more welcoming of bitcoin developments.", "LONDON (Feb 13): Bitcoin is heading lower -- much lower -- if the go-go years of the dot-com bubble are any indication.\n\nAlready slashed by more than half since hitting a record near US$20,000 in December, the cryptocurrency could plunge a further 90% in an environment of unsustainably growing supply, according to Bloomberg Intelligence commodity strategist Mike McGlone. Using Amazon.com Inc and the Nasdaq Composite Index's spectacular rise and retreat at the turn of the millennium as a proxy, he said the currency could plunge to US$900.\n\n\"I spend a lot of time reading about this, and the more research I do, the more bearish I get,\" McGlone said in an interview. \"It's very similar to these Internet companies we saw in the late nineties.\"\n\nWhile the creators of Bitcoin intended to limit supply to 21 million coins, forks mean that there are already more than 50 million outstanding coins based on the original blockchain. There's also nothing preventing rivals from spawning an infinite amount of clones, he said. The number of tradable cryptocurrencies jumped 120% in the past year.\n\n\"Parabolically increasing supply is the primary limitation to cryptocurrency market-price appreciation,\" McGlone said. \"There's strong gravitational pull toward US$900, the average price since inception and the start of 2017.\"", "Crypto-mania has been a boon for Nvidia's graphics card business.\n\nStore shelves have been wiped clean of the company's GPUs as would-be miners of bitcoin and other cryptocurrencies seek out the chips that were once only popular among PC gamers, but are extremely effective at running the algorithms behind the digital coins.\n\nShares of Nvidia exploded throughout 2017, gaining 112% in the past year. It was one of the best-performing stocks in the S&P 500, thanks in part to unexpected revenue from newly minted crypto-enthusiasts snapping up Nvidia cards.\n\nHowever, 2018 hasn't been as kind to cryptocurrencies so far. That's where the downdraft kicks in.\n\nSince January 1, bitcoin has fallen 35% while the total market for cryptocurrencies has lost 30% of its value, or roughly $182 billion.\n\n\"With crypto likely contributing larger-than-expected revenue, it is unclear if Q1 will be flattish next quarter,\" RBC Capital Markets analyst Mitch Steves said in a note to clients following Nvidia's record fourth quarter earnings release.\n\n\"We think it is still doable without material crypto exposure given that GPUs are difficult to purchase due to pent-up gaming demand.\"\n\nDespite the fears, Steves maintains an outperform rating for shares of Nvidia, with a target price of $280 -- 22% above where the stock was trading Monday afternoon.\n\nGaming makes up just over 18% of Nvidia's total GPU revenue, behind data centers (60%) and automotive (22%), according to Bloomberg's financial analysis.\n\nOthers on Wall Street aren't as optimistic as RBC.\n\n\"We think that there is a growing risk that Nvidia could be impacted by a downdraft in cryptocurrency-related demand at some point in the future,\" Wells Fargo analyst David Wong said Monday. He has an extremely bearish price target of $100 for Nvidia -- less than half where shares were trading Monday.\n\nNvidia has gained 13% since January 1. Analysts polled by Bloomberg say on average the stock could rise another 10% above current prices.", "The European Union's top banking, securities and pensions watchdogs have all warned cryptocurrency investors could lose all their money as Bitcoin enters a \"pricing bubble\".\n\nBitcoin soared in value in recent months before losing more than half its value, leaving investors who bought in at the highest prices out of pocket. Prices increased to as high as $20,000 in December, before falling to under $7,000 last week.\n\nThe trio of regulators - the European Banking Authority, European Securities and Markets Authority, and the European Insurance and Occupational Pensions Authority - warned there were no safeguards for consumers buying into the £290 billion cryptocurrency market.\n\n\"They are highly risky, generally not backed by any tangible assets and unregulated under EU law, and do not, therefore, offer any legal protection to consumers,\" the watchdogs said in a statement.\n\nThey added that cryptocurrencies are \"subject to extreme price volatility and have shown clear signs of a pricing bubble... you should be aware that you could lose a large amount, or even all, of the money invested.\"\n\nThey added most Bitcoin buyers were investing in the hope that cryptocurrencies would continue to rise in value \"without being aware of the high risk of losing their money invested\".\n\nThe EU regulators also warned of the risks of cyber attacks, such as the crippling CoinCheck heist earlier this year which saw £380m in the cryptocurrency NEM stolen. They said there was no protection under EU law for such losses.\n\nThey added the information available to buyers was often limited. \"Information made available to consumers wishing to buy [virtual currencies], where such information is at all provided, is in most cases incomplete, difficult to understand, does not properly disclose the risks,\" the regulators said.\n\nFor months, regulators and governments have been warning that cryptocurrencies pose a substantial risk to investors, and even to the financial system.\n\nLast week, the Telegraph revealed Lloyds bank would ban the purchase of cryptocurrencies on credit cards in an effort to protect buyers speculating on Bitcoin on credit.", "A small toy figure is seen on representations of the Bitcoin virtual currency in this illustration picture, December 26, 2017. Reuters/Dado Ruvic\n\nBitcoin has had a rough start to 2018, but things may get even worse before they get better.\n\nWhile the cryptocurrency avoided the historic selling pressure that swept much of the markets last week, it is still down more than 35% year-to-date.\n\nBitcoin gripped the attention of Wall Street and Main Street as it soared to an all-time high close to $20,000 in mid-December. Investor anxieties about a frothy market, cryptocurrency hacks, and the potential of a regulatory crackdown in some Asian countries have since dragged the entire market for digital coins to half of its peak worth.\n\nNow, conditions may be forming for a sell-off towards $4,605, according to chart-readers at JPMorgan. That would be a nearly 50% decline from its current price of $8,682 a coin.\n\n\"The question is whether we go there straight away, indicated on a failure to clear 10128 and 10776, or at a later stage after a stronger countertrend rally,\" technical analysts at the bank wrote in a note to clients on Friday.\n\nJPMorgan\n\nBitcoin's recovery from a low above $5,900 earlier this month was \"impressive,\" according to the bank. Still, JPMorgan sees a \"fairly high risk\" of a sell-off towards the $4,605 level if the digital currency doesn't break through its resistance level between $10,128 and $10,776.\n\n\"Above 10776 though, the door for a broader countertrend rally to 14334 if not to 16304 (76.4% on different scales) would be wide open,\" the bank concluded.\n\nBitcoin hasn't traded above $16,000 since early January 2018, according to CoinMarketCap data.", "The token is up 7% in the last 24 hours after Ripple said it had signed a new customer to its real-time payments product.\n\nXRP, the third-largest cryptocurrency created by Ripple, is trading above $US1 Monday for the first time since January 31.\n\nDesigned for international payments and money transfers, XRP has had a wild ride in the past three months. The coin soared as high as $US3.31 before Christmas- a steeper rise than bitcoin- before falling as low as $US0.56 on February 6.\n\nRipple, which holds 55 billion tokens, or more than half the total supply, in escrow, has tried to distance itself from the speculative cryptocurrency markets which have caused the breakneck price fluctuations.\n\nAt a Yahoo Finance conference last week, CEO Brad Garlinghouse said XRP and others should be referred to as \"digital assets\" rather than cryptocurrencies.\n\n\"It's not currency,\" he said. \"I can't go to Starbucks or Amazon and use-and you know, somebody inevitably will be like, Well, I have one example where I bought something with a bitcoin.' And then I usually say, 'Well, did you do a second transaction?' It's not actually a currency. These are digital assets. If the asset solves a real problem for a real customer, then there'll be value in the asset.\"\n\nXRP powers Ripple's institutional settlement and transfer products. The company says it has signed more than 100 customers onto trial programs, including large name banks like Britain's Standard Chartered as well as large money services firms like Western Union and MoneyGram.\n\nMost recently, it inked a deal with foreign exchange giant UAE Exchange to use its RippleNet real-time payments network, the company said Sunday.\n\nHowever, UAE Exchange won't actually use XRP in its processes. The cryptocurrency is used by Ripple for offering liquidity to institutions but not for international transfer. This nuance is not always made clear.\n\nXRP is up 7% in the last 24 hours, but still down more than 50% since the New Year.", "The token is up 7% in the last 24 hours after Ripple said it had signed a new customer to its real-time payments product.\n\nXRP, the third-largest cryptocurrency created by Ripple, is trading above $1 Monday for the first time since January 31.\n\nDesigned for international payments and money transfers, XRP has had a wild ride in the past three months. The coin soared as high as $3.31 before Christmas -- a steeper rise than bitcoin -- before falling as low as $0.56 on February 6.\n\nRipple, which holds 55 billion tokens, or more than half the total supply, in escrow, has tried to distance itself from the speculative cryptocurrency markets which have caused the breakneck price fluctuations.\n\nAt a Yahoo Finance conference last week, CEO Brad Garlinghouse said XRP and others should be referred to as \"digital assets\" rather than cryptocurrencies.\n\n\"It's not currency,\" he said. \"I can't go to Starbucks or Amazon and use -- and you know, somebody inevitably will be like, Well, I have one example where I bought something with a bitcoin.' And then I usually say, 'Well, did you do a second transaction?' It's not actually a currency. These are digital assets. If the asset solves a real problem for a real customer, then there'll be value in the asset.\"\n\nXRP powers Ripple's institutional settlement and transfer products. The company says it has signed more than 100 customers onto trial programs, including large name banks like Britain's Standard Chartered as well as large money services firms like Western Union and MoneyGram.\n\nMost recently, it inked a deal with foreign exchange giant UAE Exchange to use its RippleNet real-time payments network, the company said Sunday.\n\nHowever, UAE Exchange won't actually use XRP in its processes. The cryptocurrency is used by Ripple for offering liquidity to institutions but not for international transfer. This nuance is not always made clear.\n\nXRP is up 7% in the last 24 hours, but still down more than 50% since the New Year.", "Price volatility is the main element preventing the faster penetration of cryptocurrencies to the real world. After hitting a record mark of $20,000 in mid-December 2017, Bitcoin's price fell below $7,000 at the beginning of February 2018. As a result, over $60 billion was wiped off the value of the entire cryptocurrency market.\n\nSuch fluctuations undermine the trust of investors and potential users of cryptocurrencies. Few people want to invest in an unstable asset, and it is also hard to use such a tool as a payment method or for remittance purposes due to constant price changes. As a result, cryptocurrencies are becoming just a niche for speculative traders, and the potential for this concept remains unrealized.\n\nThe team behind the Lightcash project aims to solve the cryptocurrency volatility problem and become able to unlock all the advantages of blockchain technology by linking a cryptocoin to the real highly-demanded asset. This is why Lightcash's own cryptocurrency (LCSH) is secured by real gold, mined from deposits in Russia.\n\n\"The Lightcash parent company owns a working gold mining facility in the Amur Region of Russia, as well as a plant for the enrichment of precious metals, and it possesses the necessary state licenses,\" says Vyacheslav Vokin, Lightcash CEO. \"Using this infrastructure we will be able to ensure the stability of our service by issuing own cryptocoin secured by real gold in a 1000:1 ratio.\"\n\nLightcash project closed pre-sale is scheduled for March 2, and the main token sale will take place on March 15. The main goal of the token sale is to raise funds for the purchase of a new deposit of ore gold in the Republic of Buryatia, Russia. This will allow the company to provide a full load to its precious metal enrichment plant.\n\nSales of the project's internal cryptocurrency LCSH are scheduled for May 2018. Lightcash will close the deal to acquire a new gold deposit in summer. Gold mining will start there immediately.", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nThe cryptocurrency markets entered the week on a high note, as every top 100-cryptocurrency rose against the value of the dollar on Monday. The rally placed the Bitcoin price in position to surmount the $9,000 barrier, while the Ethereum price began to test $900.\n\nAltogether, the cryptocurrency market cap made a nearly $40 billion advance, from $392.8 billion on Sunday to $432.4 billion on Monday. This works out to a 24-hour increase of 10 percent, one of the index's better single-day performances in recent memory.\n\nMonday morning brought an eight percent recovery for the Bitcoin price, raising it to a present value of $8,729 on Bitfinex. This represented a nearly $1,000 recovery from Sunday morning when the flagship cryptocurrency dipped to $7,851. Bitcoin now has a market cap of $149 billion, which holds its market share steady at 34.5 percent.\n\nMonday's market movement also dealt the Ethereum price a winning hand, and the second-largest cryptocurrency rose by six percent to $860. Ethereum currently has a market cap of $85.1 billion, which places its market share at 19.7 percent.\n\nThe wider altcoin markets took full advantage of the day's bullish wave, and every cryptocurrency ranked within the top 100 advanced by at least two percent (excluding stablecoins).\n\nThe Ripple price posted a 14 percent gain, which raised the value of XRP to $1.07. Ripple now has a $41 billion market cap, making it nearly twice as large as fourth-ranked Bitcoin Cash, which rose just six percent to $1,290.\n\nCardano saw its price rise by eight percent, placing its market cap in position to crack the $10 billion barrier in short order. EOS, meanwhile, punched through $9 billion on the heels of a nine percent price increase.\n\nThe final four coins in the top 10 managed to outperform the index. Litecoin, ranked seventh, rose by 12 percent to $162, while NEO's 14 percent gain led all top 10-cryptocurrencies.\n\nThe Stellar price added 11 percent to reach a present value of $0.39, and IOTA -- bolstered by news that Bosch had invested in IOTA and joined the project's network advisory board -- rose 13 percent to round out the top 10.", "BOSTON: You may soon be able to make money by selling your own genetic data, thanks to a US-based start- up that is offering a service to sequence a customer's genome.\n\nCustomers can have their genome sequenced for under USD 1,000, which could then be sold to scientists or pharmaceutical manufacturers.\n\nThe transactions would occur using cryptocurrency technology used for secure valued transactions such as Bitcoin.\n\nThe company called Nebula Genomics is headed by George Church, who suggests that the approach is the wave of the future.\n\nMost other genome sequencing companies retain ownership of user data derived from spit swab genetic samples, leaving customers out of the proceeds when they sell the data to other companies.\n\nDue to price and privacy issues, the number of people taking part in personal genome sequencing is low, the start-up claims.\n\nTo best make use of genomic data, researchers need samples from more people, which would help reveal trends underlying currently unknown hereditary disease factors, 'TechXplore' reported.\n\nThe only way to get many more people involved is by guaranteeing that their data will only go where they decide and by bringing the cost down, the startup claims.\n\nCustomers would be is using a cryptocurrency sold by the start-up.\n\nThose wishing to have their genome sequenced would buy a token, which they in turn could sell to another buyer, thereby recovering their initial expenditure.\n\nThe value of tokens can change depending on a variety of factors. The tokens can only be redeemed by purchasing someone's DNA data, their value will depend on the willingness of big companies to use them to pay for data. (AGENCIES)", "You may soon be able to make money by selling your own genetic data, thanks to a US-based start- up that is offering a service to sequence a customer's genome. Customers can have their genome sequenced for under USD 1,000, which could then be sold to scientists or pharmaceutical manufacturers. The transactions would occur using cryptocurrency technology used for secure valued transactions such as Bitcoin.\n\nThe company called Nebula Genomics is headed by George Church, who suggests that the approach is the wave of the future. Most other genome sequencing companies retain ownership of user data derived from spit swab genetic samples, leaving customers out of the proceeds when they sell the data to other companies. Due to price and privacy issues, the number of people taking part in personal genome sequencing is low, the start-up claims.\n\nTo best make use of genomic data, researchers need samples from more people, which would help reveal trends underlying currently unknown hereditary disease factors, 'TechXplore' reported. The only way to get many more people involved is by guaranteeing that their data will only go where they decide and by bringing the cost down, the startup claims.\n\nCustomers would be is using a cryptocurrency sold by the start-up. Those wishing to have their genome sequenced would buy a token, which they in turn could sell to another buyer, thereby recovering their initial expenditure.\n\nThe value of tokens can change depending on a variety of factors. The tokens can only be redeemed by purchasing someone's DNA data, their value will depend on the willingness of big companies to use them to pay for data.", "Here's how Kodak CEO Jeff Clarke pitched it in a statement:\n\n\"For many in the tech industry, 'blockchain' and 'cryptocurrency' are hot buzzwords, but for photographers who've long struggled to assert control over their work and how it's used, these buzzwords are the keys to solving what felt like an unsolvable problem. Kodak has always sought to democratize photography and make licensing fair to artists. These technologies give the photography community an innovative and easy way to do just that.\"\n\nThe plan seems to be working: Shares of Kodak were trading at $7.12 in mid-afternoon, compared to an opening price of just $3.13.\n\nKodak is just the latest legacy company to find itself a crypto niche. Last month, tea-maker Long Island Iced Tea Corporation rebranded as Long Blockchain Corporation and said it would start focusing its efforts on investment opportunities that leverage blockchain technology.", "New York: What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of $5,922 it touched on Tuesday, rebounding 53% to $9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5% this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity US Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in bitcoin prices and headlines, this week US equities are beating the largest cryptocurrency on that field.\n\nSince the drop below $6,000, bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilize while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by US regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70% slump from bitcoin's high of almost $20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature. Bloomberg", "At a CNBC-hosted interview at the Milken Institute MENA Summit, Cameron suggested that the cryptocurrency is better than gold across the board when looking at the desirable properties of money.\n\n\"And what makes gold gold? Scarcity. Bitcoin is actually fixed in supply so it's better than scarce ... it's more portable, its fungible, it's more durable. It sort of equals a better gold across the board,\" said Cameron.\n\nHe highlighted the digital currency's recent sell-off as a buying opportunity. While early last week bitcoin's market value was around $200 billion, it sank to $100 billion during this week's larger market plunge, slightly recovering toward the end of a week to a value of around $140 billion. At its lowest point this week, the Olympic rower and entrepreneur said investors could be looking at \"a potential appreciation of 30 to 40 times because you look at the gold market today, it's a $7 trillion market. And so a lot of people are starting to see that, they recognize the store of value properties. So we think regardless of the price moves in the last few weeks, it's still a very underappreciated asset.\"\n\nAt the time of Cameron's comments, a 40-times price appreciation reflected a bitcoin market cap of about $4 trillion. The twin mentioned that he and his brother Tyler were taking a 10- to 20-year outlook.\n\nThe crypto bulls, credited with becoming the first bitcoin billionaires, took a jab at critics including legendary investor and Berkshire Hathaway Inc. (BRK.A) head Warren Buffett and JPMorgan Chase & Co. CEO Jamie Dimon. Tyler blamed skepticism on a \"failure of the imagination,\" going on to describe a world where autonomous cars and other devices make micro payments to each other via digital currencies. (See also: Crypto, Cannabis, FOMO Drive New Investor Inflow.)", "What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of $5,922 it touched on Tuesday, rebounding 53 percent to $9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5 percent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity U.S. Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week U.S. equities are beating the largest cryptocurrency on that field.\n\nSince the drop below $6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilize while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by U.S. regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 percent slump from Bitcoin's high of almost $20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature.", "\"Cryptocurrencies have failed to become a payment system, the scope of their application is limited mainly to investments. Because of this, and also due to a number of other circumstances, very few fundamental factors are available for the analysis of the cryptocurrency market,\" Zhanna Kulakova, financial consultant at TeleTrade, told RT.\n\nBesides the bearish news about tightening regulation by governments and banks, the situation for bitcoin is getting worse with the introduction of crypto trading on several large traditional exchanges, because it became easier for institutional investors to take short positions on bitcoin, the analyst says. \"Not surprisingly, after the explosive growth of the market in 2017, large investors chose this strategy,\" Kulakova said.\n\nThat's why it is impossible to forecast the bitcoin price, as it could fall below the new lows, and also jump above $10,000 again, she added.\n\nEldiyar Muratov, president of Singapore Castle Family Office, predicts that the bitcoin price could collapse to the level of $4,300, if the current negative trend continues. He also says bitcoin can't be compared to gold yet, something that has been said by others.\n\n\"The largest bitcoin losses from Christmas coincided with the fact that investors began to withdraw from risky assets, fixing their positions. Until now, bitcoin has struggled to justify any comparison with gold as a limited and valuable asset. For example, gold has grown significantly over time, like the yen, the Swiss franc and bonds,\" Muratov told RT.\n\nOlga Prokhorova, expert at the International Financial Center, notes that the biggest drop in cryptocurrencies is not connected to the latest Wall Street meltdown.\n\n\"From a technical point of view, the correction of the S&P 500 and DJIA was long overdue, and a sharp jump in the indices is connected, most likely, to the robotic trading systems (sort of a flash crash). Nevertheless, I would not link the fall of bitcoin to American stock indices,\" she said.\n\nBitcoin is now facing consolidation near the $6,000 mark. If the digital coin stays up near this point, it could rebound to $9,300; however, if the price goes down, it could fall to the $3,000 level, Prokhorova said.", "NVIDIA is preparing a new GTX 20 series of graphics cards that should debut with the purported GeForce GTX 2080 in April under the new Ampere GPU family, a refresh of the industry-leading Pascal GPU family released in 2016.\n\nThis reveal would see the new GeForce GTX 2080 revealed, which would have to pack more performance than the GTX 1080 from nearly two years ago. But how much faster can it be before it beats the GTX 1080 Ti? What if the new GTX 2080 could beat the GTX 1080 Ti at a price point of $599 but it is not capable of cryptocurrency mining?\n\nNVIDIA will be shooting themselves in the foot with a refreshed GA104-based GeForce GTX 2080 that even comes close to the performance of the GTX 1080 Ti, because at that points gamers won't want to buy a graphics card from March 2017 when the new GTX 20 series is here. So NVIDIA has to find a way to make its GTX 1080 Ti relevant in a market where the GTX 2080 is out, and that could be from a GPU-level ban of crypto mining on the GTX 20 series cards.\n\nI don't think this purported ban on crypto mining on the GTX 20 series would last long, but 6-12 months would be enough time for NVIDIA to deplete its entire GTX 10 stock worldwide. NVIDIA has a considerable supply of cards on the market, with many more coming, and they're selling all of them. With a GPU-level crypto mining ban on the GTX 20 series, this would allow the GTX 10 series cards to cater to gamers who want to mine and game, or to miners who just want those important hashes.\n\nAfter 6-12 months of the release of the new GeForce GTX 2080, NVIDIA would need to announce and release the GTX 2080 Ti. At this time, NVIDIA would have enough GTX 10 series cards sold, and enough GTX 20 series inventory to announce at the GTX 2080 Ti reveal event that they are unlocking mining on the GTX 20 series.\n\nThis is purely my opinion, but it'll be enough to start an online comment fest between you guys and girls - our readers, and the companies and my sources involved. This would be an interesting step to take, and an easy way for NVIDIA to keep GTX 20 series stock under control in a mining-obsessed market.\n\nAlso remember that NVIDIA has recently said that GeForce graphics cards are for gamers, and not miners, with the company already making retailers aware of this.", "Forget traditional bank robberies, that's like the wild west... especially now that we have cryptocurrency exchanges that can be hacked and a huge $170 million can be stolen at today's lowered values.\n\nThis is what has happened to Italian cryptocurrency exchange BitGrail, with the company announcing on its website that it has lost $170 million to fraudulent transactions, and that they've approached authorities over the matter. BitGrail has since suspended all withdrawals and deposits \"in order to conduct further verifications\".\n\nBitGrail has said that it won't be refunding 100% of what users' lost, with BitGrail founder Francesco \"The Bomber\" Firano saying that there's no 100% way to refund users. Firano took to Twitter, where he tweeted: \"Unfortunately there is no way to give it back to you at 100% (we only got 4 MLN XRN right now)\".\n\nRussian scientists busted mining crypto in NUCLEAR facility\n\n6 x GPU packs now on sale for miners, GTX 1060s or GTX 1080s\n\nNVIDIA says cryptocurrency demand 'exceeded expectations'\n\nLedger owner? Your cryptocurrency can be easily STOLEN\n\n$4 trillion wiped off stock market, tech stocks are HURTING\n\nUS credit card companies block cryptocurrency purchases\n\nSamsung announces it's making cryptocurrency mining chips\n\nEthereum reaches new record all-time high price of $870\n\nRipple (XRP) value blows up, bypasses Ethereum's market cap\n\nCrypto expert kidnapped, had to pay $1 million BTC ransom\n\nUnikoinGold is now available on Bittrex\n\nBitcoin could be worth $0, according to Morgan Stanley\n\nFacebook Messenger malware mines Monero on users' PCs\n\nUsing 'blockchain' in new name, company shares rise 500%\n\nMiningSky 8-GPU Mining Rig V1 Review\n\nFrench dominatrix pimps clients out in 'Crypto Slave Farm'", "J.P. Morgan has called cryptocurrencies the \"innovative maelstrom\" around Blockchain and said they are \"unlikely to disappear\" in what appears to be an internal report from the company, published Feb. 8, 2018.\n\nIn an extract from what is allegedly the banking giant's executive summary on cryptocurrency, the company appears bullish on crypto's future.\n\n\"Cryptocurrencies are the face of the innovative maelstrom around the Blockchain technology that is bringing both massive price volatility and a constant trial-and-error of new product try-outs and failures,\" the report states.\n\nDespite the report's mixed tone, the distinction from J.P. Morgan's public position on cryptocurrency over the past six months is palpable.\n\nIn September, 2017 J.P. Morgan CEO Jamie Dimon became notorious after he called Bitcoin a \"fraud,\" triggering the very price volatility the bank now cites as a \"challenge\" crypto assets face.\n\nDimon subsequently claimed he was \"not going to talk about Bitcoin anymore,\" while last month publicly disclosing he \"regretted\" making the fraud comments.\n\nSpeaking to Cointelegraph at the World Economic Forum in January, 2018, Dimon flatly refuted the idea that he was a \"skeptic\" on Bitcoin.\n\nThe recently published report meanwhile offers ideas as to how cryptocurrencies could be used most effectively.\n\n\"CCs [Cryptocurrencies] are unlikely to disappear and could easily survive in varying forms and shapes among players who desire greater decentralization, peer-to-peer networks and anonymity, even as the latter is under threat,\" the summary continues in a positive vein.\n\n\"The underlying technology for CCs [cryptocurrencies] could have the greatest application in areas where current payment systems are slow, such as across borders, as payment, reward tokens or funding systems for other Blockchain innovations and the Internet of Things, as well as parts of the underground economy.\"\n\nLast week J.P. Morgan was one of several US banks to ban clients from purchasing cryptocurrency with credit cards.", "MOSCOW -- Two employees of Russia's top nuclear research institute have been arrested for using the facility's supercomputer for cryptocurrency mining.\n\nRussian news agencies cited the Russian Federal Nuclear Centre as confirming the arrests on Friday. But the reports did not indicate whether the employees had made any money from the computer use. In mining, computers are used to solve mathematical problems to verify transactions and are rewarded in cryptocurrency.\n\nREAD MORE: Bitcoin price falls below $6,000; half its value lost in 2018\n\nThe centre, in the closed-off city of Sarov, 400 kilometers (240 miles) east of Moscow, is a research and development facility for nuclear weapons.\n\nWATCH: Cryptocurrency concerns: could Bitcoin bankrupt you?\n\nThe Interfax and state RIA-Novosti news agencies cited the center as saying that criminal charges apparently were filed against the employees, but the charges were not specified.", "Bitcoin (BTC) is trimming gains, having set a six-day high above the $9,000 mark early Saturday, according to CoinDesk's Bitcon Price Index (BPI).\n\nThe cryptocurrency ran into bids at $8,608.62 at 00:14 UTC and jumped to $9,070.64 at 07:17 UTC - the highest level since Feb. 4. As of 12:00 UTC, the BPI is at $8,650 levels. Bitcoin has appreciated by roughly 5 percent in the last 24 hours, according to CoinMarketCap.\n\nStill, it's the broader context that might be most important in understanding why these small gains might tell a bigger story - BTC has now rallied more than $2,300 from Tuesday's low below $6,000.\n\nMeanwhile, other crypto market leaders have also witnessed solid gains in the last 24 hours. Ripple's XRP token has jumped 30 percent (this figure was as high as 50 percent) and was last seen changing hands at $1.10.\n\nMeanwhile, cardano and neo are also in the green, while ethereum's ETH token is reporting a solid 5 percent appreciation.\n\nDisclosure: CoinDesk is a subsidiary of Digital Currency Group, which has an ownership stake in Coinbase and Ripple.\n\nMarkets image via Shutterstock", "What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of $5,922 it touched on Tuesday, rebounding 53 per cent to $9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5 per cent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity US Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week US equities are beating the largest cryptocurrency on that field.\n\nSince the drop below $6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilise while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by US regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 per cent slump from Bitcoin's high of almost $20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature.", "The worry over bitcoin stemmed from its lack of backing by any central bank or government, or physical assets, as its value depends solely on people's confidence of the currency. -- Reuters picNEW YORK, Feb 10 -- What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of US$5,922 (RM23,432) it touched on Tuesday, rebounding 53 per cent to US$9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5 per cent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity US Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week US equities are beating the largest cryptocurrency on that field.\n\nSince the drop below US$6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilize while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by US regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 per cent slump from Bitcoin's high of almost US$20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature. -- Bloomberg", "Nvidia Corpâ\u0080\u0099s graphic processors, or GPUs, are so overwhelmingly popular that gamers and cryptocurrency miners are willing to pay up to three times the original list price to get their hands on its cards online\n\nThe companyâ\u0080\u0099s GeForce 1070 chip set, which retailed at $349 a year ago, was going for up to $900 from electronics wholesalers on Amazon.com yesterday, and the same demand stood behind a stellar set of corporate results on Thursday.\n\nThe companyâ\u0080\u0099s share price rose 6 percent in early trading on Friday after at least 14 Wall Street brokerages raised their price targets on the stock â\u0080\" a measure of the confidence around the stock among sector analysts.\n\nGamers use GPUs to play high-quality video games, but Nvidiaâ\u0080\u0099s high-performing cards are also now used by those building machines to solve the complex math puzzles used to validate transactions and earn more of cryptocurrencies like Ethereum and bitcoin.\n\nThe companyâ\u0080\u0099s chief financial officer Colette Kress said on a conference call on Thursday that inventory levels for gaming GPUs were at historically low levels due to cryptocurrency miners.\n\nâ\u0080\u009cWe do think that cryptocurrency has been a very significant factor in both revenue and pricing, creating a shortage environment that is boosting pricing,â\u0080\u009d Morgan Stanley analyst Joseph Moore said in a note after the results.\n\nAnalysts also say Nvidiaâ\u0080\u0099s competitive advantage is only likely to increase when it moves its Volta chip architecture, launched last year and only currently present in data-center GPUs, into gaming chips later this year.\n\nThe new GPU gaming chip, code named Turing, is expected to be unveiled next month. Even without it, Nvidiaâ\u0080\u0099s revenue from gaming rose 29% to $1.74bn in the fourth quarter, accounting for more than half of its total revenue.\n\nThe companyâ\u0080\u0099s quarterly data center revenue â\u0080\" powered by the Volta-based data centre GPU, Tesla V100 â\u0080\" more than doubled to $606m as companies such as Alibaba, Amazon, Alphabet, IBM and Microsoft adopted the new chip in their servers.\n\nData centres outperformed despite high expectations and Barclays analyst Blayne Curtis said they should do so again given that Volta is in the early stages of adoption.\n\nReuters", "Several elite universities in the U.S. have added -- or are rushing to add -- cryptocurrency courses that teach about Bitcoin and associated record-keeping technologies.\n\nThis semester, graduate-level courses are available at Carnegie Mellon, Cornell, Duke, the Massachusetts Institute of Technology, and the University of Maryland, among other schools. This helps highlight public interest in the technology across several academic fields, as well as the assumption that it will outlast the current speculative price bubble.\n\nDavid Yermack, a business and law professor at New York University, began offering one of the first for-credit courses on the topic back in 2014: \"There was some gentle ribbing from my colleagues when I began giving talks on Bitcoin,\" he said. \"But within a few months, I was being invited to Basel to talk with central bankers, and the joking from my colleagues stopped after that.\"\n\nLast month, students packed in to hear the first lecture of \"Blockchain, Cryptoeconomics and the Future of Technology, Business and Law,\" which considered the development of Bitcoin against the history of money. For his class this semester, Mr. Yermack originally booked a lecture hall that could fit 180 students, but he had to move the course to the largest lecture hall at N.Y.U. when enrollment kept going up -- he now has 225 students on board.\n\n\"This is a very precious opportunity for you to be able to sit in this class,\" Dawn Song, a computer science professor, told the students. \"There are a bazillion other students who are waiting for your spot.\"\n\nThe 75 spots in the Berkeley class were divided evenly among the law school, the business school, and the engineering department, and faculty from the three departments are teaching the course together. Ms. Song said she had around 100 students vying for the 25 places set aside for her department.\n\nBecause developments in the field are moving so fast, business school professor also teaching the class, Greg La Blanc, said the students would have to forgive the teachers if they got things wrong on occasion. \"We aren't waiting until we perfect it,\" he said. \"Don't compare it to the perfect blockchain course. Compare it to having no blockchain course at all.\"", "Bitcoin has rebounded 40 percent over the last three sessions, but Bitcoin Investment Trust (OTC: GBTC) won't ride the trend, according to Buckingham Research Group.\n\nAnalyst Chris Brendler initiated coverage with an Underperform rating and $8.35 price target.\n\nThe 42-percent downside forecasted for Bitcoin Investment Trust is based in part on expectations for sharp deflation.\n\n\"Despite a ~40-percent crash in Bitcoin prices YTD (and ~55 percent from peak), we believe the 4Q17 run-up had all the classic signs of an asset bubble that hasn't fully popped,\" Brendler wrote in a Friday note.\n\nCryptocurrency challenges are seen to be exacerbated by impending regulatory intervention and increasing investor awareness of their lacking utility.\n\nAt the same time, Buckingham considers the the trust's premium, afforded for its distinction as the only bitcoin-based equity on U.S. exchanges, unsustainable as competing cryptocurrency options emerge and bitcoin loses steam.\n\n\"At this early stage, it is nearly impossible to pick winners, but key structural disadvantages, we expect Bitcoin's leadership status to fade,\" Brendler wrote.\n\nWhile bearish on bitcoin and the GBTC, the analyst suspects cryptocurrencies, in general, will have long runs and recommends investors attend to the space.\n\nAt time of publication, GBTC shares were trading up 3 percent at $14.37.\n\nRelated Links:\n\nHow The Bitcoin Investment Trust Actually Works", "CryptoWatch Today: Arizona could soon accept bitcoin as payment for income taxes\n\nThe volatility on Wall Street put cryptocurrency markets in the back seat for another day as a wild session in equities saw the Dow Jones Industrial Average DJIA, -0.24% post a 500-point range before lunchtime Friday.\n\nThe price of bitcoin, the No.1 cryptocurrency, BTCUSD, +6.07% held steady above $8,000 after some selling pressure to start the day. News in the virtual currency and Blockchain market was quiet to finish the trading week.\n\nScientists arrested in Russia for mining bitcoin\n\nA number of Russian scientists were arrested Friday for allegedly mining bitcoin on computers that are used at a Russian nuclear warhead, the BBC said. In a news release, the centers press service said, \"there has been an unsanctioned attempt to use computer facilities for private purposes including so-called mining.\"\n\nA spokeswoman for the center, Tatiana Zalesskaya, told Interfax that as far as they were aware, a criminal charge has been launched against those bust mining.\n\nSee also: Here's proof that this bitcoin crash is far from the worst the cryptocurrency has seen\n\nArizona closer to accepting bitcoin as payment for income taxes\n\nLate Thursday the Arizona Senate passed a bill that would allow residents to pay their income taxes and interest using bitcoin. The bill passed the Senate 16-13 with one no-vote. The bill states a taxpayer can pay his or her taxes using a \"payment gateway such as bitcoin, litecoin, or any other cryptocurrency recognized by the department.\"\n\nCo-sponsor of the bill and Arizona Rep. Jeff Weninger recently told Fox News that \"Arizona is going to be the place to be for blockchain and digital currency technology in the future.\"\n\nCryptoWatch: Check bitcoin and cryptocurrency prices, performance, and market capitalization, in one dashboard", "Get Trading Recommendations and Read Analysis on Hacked.com for just $39 per month.\n\nA Russian company has launched a \"Bitcoin anxiety hotline\" targeted at cryptocurrency investors who find themselves struggling to stomach the market's recent downward trajectory.\n\nThe Moscow-based Blockchain Fund established the service and began answering calls from distraught investors earlier this week, according to a report from Russian-language publication Life.ru.\n\nThe service is a bit of a divergence from Blockchain Fund's core business model, which involves purchasing and storing cryptocurrencies on behalf of clients.\n\nHowever, the recent market downturn -- which saw the Bitcoin price crash from a peak of $18,981 on Bitfinex to a low near $6,000 -- has left many newer investors apprehensive about whether they made a mistake letting themselves become swept up in last quarter's buying euphoria. Bitcoin has since rebounded above $8,000, but some investors are still facing financial portfolios that have seen 50 percent or greater declines.\n\n\"Some people are in a panic, they don't understand what is happening. At first everything was so good in this market, and now it has faced such changes,\" Elena Pikhovkina, a psychologist who answers calls for the hotline, told the publication.\n\nThe report states that concerned investors can call the hotline for free but that the company also offers paid consultations for individuals who would like more in-depth assistance managing their financial anxiety.\n\n\"First of all, I will get acquainted with people in my work, listen to their stories and then give advice on how to calm down and recover. It is very important so that a person does not do anything stupid,\" Pikhovkina said, adding that Russian investors exhibited similar anxiety in 2014 when the ruble crashed against the value of the euro and US dollar.\n\nHopefully, the hotline will help prevent more occurrences of anecdotal, yet tragic, reports of investors who have committed suicide after finding themselves unable to cope with dramatic reductions in the value of their cryptocurrency holdings.\n\nThe cryptocurrency community itself has been incredibly proactive about spreading suicide prevention hotline numbers throughout social media channels during periods of intense market volatility. Last month, for instance, a Reddit post sharing the number for a free US hotline became the top-voted post on the Bitcoin subreddit.", "A small toy figure is seen on representations of the Bitcoin virtual currency in this illustration picture, December 26, 2017.Reuters/Dado Ruvic\n\nFor two years, I had owned a cryptomining machine and never even known it.\n\nI currently have two of the most powerful graphics cards you can buy at the moment - the GTX 1080, which I then upgraded to the GTX 1080 Ti - which just so happen to be some of the best graphic cards for cryptomining.\n\nCryptomining is basically the process of solving complex problems to verify digital transactions using computer hardware -- in this case, a graphics card. By mining, miners can either create a cryptocurrency, or they can get paid for their processing power in a cryptocurrency.\n\nThose graphics card cost me a pretty penny, even if I bought them before the massive graphics card price hikes caused by cryptominers buying up all the cards. And when I wasn't gaming, my GTX 1080 and GTX 1080 Ti just lay there, doing nothing, not making me money.\n\nNo more. One day, I randomly decided to try mining cryptocurrency with them.\n\nI was making some profit at first, but not very much. So I got curious. What if I added more graphics cards? How much could I make?\n\nCheck out my new messy mining rig experiment to see how much bitcoin I'm making:", "A small toy figure is seen on representations of the Bitcoin virtual currency in this illustration picture, December 26, 2017.Reuters/Dado Ruvic\n\nFor two years, I had owned a cryptomining machine and never even known it.\n\nI currently have two of the most powerful graphics cards you can buy at the moment - the GTX 1080, which I then upgraded to the GTX 1080 Ti - which just so happen to be some of the best graphic cards for cryptomining.\n\nCryptomining is basically the process of solving complex problems to verify digital transactions using computer hardware -- in this case, a graphics card. By mining, miners can either create a cryptocurrency, or they can get paid for their processing power in a cryptocurrency.\n\nThose graphics card cost me a pretty penny, even if I bought them before the massive graphics card price hikes caused by cryptominers buying up all the cards. And when I wasn't gaming, my GTX 1080 and GTX 1080 Ti just lay there, doing nothing, not making me money.\n\nNo more. One day, I randomly decided to try mining cryptocurrency with them.\n\nI was making some profit at first, but not very much. So I got curious. What if I added more graphics cards? How much could I make?\n\nCheck out my new messy mining rig experiment to see how much bitcoin I'm making:", "Nvidia reported a record fourth-quarter on Thursday, and shares are trading up more than 10% in early trading.\n\nWall Street was largely expecting the company to beat on earnings, but was worried good numbers would rely on unreliable and volatile cryptocurrency demand. Nvidia's earnings show it's more than just a crypto company though, soothing those investors fears.\n\n\"1) Data Center growth of 20% or more? (Check, 21.0%); 2) Gaming growth of 5-6% or more? (Check, 11.4%); 3) Gross margins in the 60s? (Check, 62.1%) and 4) Guidance of down 1-3% sequentially? (Check, flat at mid-point with margin expansion),\" Mitch Steves, an analyst at RBC Capital Markets said in a note to clients Friday.\n\nAhead of the report, some analysts were worried Nvidia would have trouble showing it could sustain growth outside of its graphics division. Cryptocurrency miners contributed about $US70 million in sales during the third quarter, and Steves estimates the miners added about $US180 million in sales during the fourth quarter.\n\nAMD, Nvidia's main rival in the space, said about one-third of its graphics division growth came from cryptocurrency miners, which led some investors to worry if the company would be growing without the wildly volatile cryptocurrency market. After it's earnings report, it looks like Nvidia isn't facing the same problems.\n\nThe one blip in Nvidia's stellar report came from the sluggish growth in its automotive division. Nvidia's chips for power infotainment systems and self-driving cars are off to a slow start, but the company could just be a bit too far ahead of the curve, Steves said. In a couple years, when autonomous cars become more popular and more advanced, the 3% growth will start to be a bigger problem.\n\nSteves rates Nvidia as an \"outperform\" and has a $US280 price target, about 22% higher than the current price.", "Bitcoin edges upwards as Barclays reveals plan to ban cryptocurrency trading using its credit cards Jasper HamillFriday 9 Feb 2018 11:55 am Share this article with Facebook Share this article with Twitter Share this article with Google Plus Share this article through email Share this article with Whatsapp Share this article through\n\nBarclays is likely to follow other major lenders in the United States in stopping customers from buying Bitcoin and other cryptocurrencies with its credit cards, according to an interview with a senior executive at its credit card unit.\n\n'We are making the decision that we will likely no allow cryptocurrency purchases on the card,' Paul Wilmore, managing director at Barclaycard, told the Bank Innovation blog.\n\nA spokeswoman for Barclays in London said that the bank is reviewing its policy on a country-by-country basis and that it had not yet changed its policy.\n\nBarclaycard is one of the biggest credit card providers in both Britain and the U.S. that is yet to formally announce a ban on card purchases of digital currencies.\n\nLloyds Banking Group, which issues just over a quarter of all credit cards in Britain, and Virgin Money announced such a ban last week, following the lead of JP Morgan Chase & Co and Citigroup.\n\nThe moves are aimed at protecting customers from running up huge debts from buying virtual currencies on credit, if their values were to plummet, a Lloyds spokeswoman said last week.\n\nBitcoin's price does not appear to have taken much of a battering from the news and is currently on the up, standing at about £5,950.\n\nIts value dropped earlier this week in a 'cryptopocalypse' before rebounding again after a US Senate cryptocurrency hearing reassured the market and boosted the value of Ethereum, Ripple, Litecoin and alt-coins.", "Nvidia reported earnings for the fourth-quarter 2017, noting that not only did the company benefit extensively from U.S. tax reform, but also the boom in demand for its Pascal-generation graphics cards. This was mainly due to an increase in cryptocurrency mining during the period, as the Bitcoin price surged. Its excitement surrounding the increase in revenues remain at odds with previous statements, claiming that it would work with retailers to curb sales of its consumer products to miners.\n\nThe company reported an increase of 34% in revenue terms compared to the same period a year prior. These results exceeded analyst's expectations, with gaming - the biggest category - contributing $1.74 billion in revenue. Nvidia launched the $3,000 Titan V during the quarter, in addition to the GeForce Now program that is currently in beta. Second to the aforementioned category was its Data Center products, with this adding another $606 million to its overall earnings.\n\nAlthough a big part of the revenue jump could be attributed to the surge in demand due to cryptocurrencies, Nvidia Chief Financial Officer, Colette Kress remained cautious:\n\n\"While the contribution of cryptocurrency mining to our business is hard to quantify, it is likely to have been higher than in previous years. However, we remain committed to our gaming demands as cryptocurrency trends are likely to remain volatile.\"\n\nThe Nintendo Switch - which sports Nvidia's Tegra chip - was a big driver behind growth as well. Earlier we reported that the handheld console outsold the Nintendo WiiU within its first ten months, with total sales coming in at 14.86 million units. According to Nvidia, its Tegra processor revenue totaled $450 million, growing 75% year-over-year.\n\nNet income for Nvidia was up 71% year-on-year, coming in at $1.118 billion. It also reported a net income for the fiscal year of $3.04 billion, which itself was up 83%. As mentioned earlier, the company had a net benefit thanks to tax reform being passed in the United States, to the tune of $133 million. The company expects a tax rate of 12% for the quarter, down 17% previously.\n\nSource: Nvidia", "For a fleeting moment, Cameron and Tyler Winklevoss, whom Mark Zuckerberg once promise to \"f--k . . . probably in the ear\" over their claim that Facebook was, in fact, their brainchild, achieved their comeuppance. While Zuck's company floundered, pinioned in the crosshairs of angry lawmakers and increasingly skeptical users, and quickly losing eyeballs, their early bitcoin investments catapulted them into the ranks of billionaires, landing them on Forbes latest iteration of its rich list: \"The Richest People in Cryptocurrency,\" published Tuesday.\n\nBut there's just one problem with the list, and it's directly tied to the problem inherent to the currencies themselves: the market is too volatile to be sustaining, and so are the fortunes of those who have profited from it. As soon as the list was published, major cryptocurrencies like bitcoin saw their values plummet, rendering it immediately out of date. As The New York Times noted, even though the magazine identified about 10 billionaires, many were no longer billionaires once the list went live:\n\nUnlike an ordinary list of billionaires whose fortunes are tied up in stocks, bitcoin billionaires (or millionaires, as it were) don't have to disclose who they are, much less their holdings. While Forbes's list is based on confirmed numbers and quantifiable data, it's also necessarily based on guesswork, thanks to the secretive and often paranoid nature of its users. And as the cryptocurrency market becomes more complex, and more like existing financial markets, it is only becoming more volatile. As of Thursday, bitcoin's price hovered just above $8,000, far below its December peak of $19,000.\n\nFortunately for the Winklevii twins, Larsen, and the rest of the members of Forbes's cryptocurrency list, the erratic nature of the most popular virtual currencies probably means they'll all regain billionaire status soon, if they haven't already. Cameron Winklevoss is certainly looking on the bright side: \"If you look at a $100 billion market cap today, now last week it might have been more like 200, so it's actually a buying opportunity, we think that there's a potential appreciation of 30 to 40 times,\" he told CNBC on Wednesday. \"A lot of people are starting to see that, they recognize the store of value properties. So we think regardless of the price moves in the last few weeks, it's still a very underappreciated asset.\"", "Ljubljana, 09 February (STA) - It was a busy week on the foreign policy front. The government postponed a debate on Palestine recognition yet again, fishermen sought legal recourse after being fined by Croatia in retaliation for Slovenian fines for Croatian fishermen, and PM Miro Cerar hosted a ...", "A new report by Reuters quotes internal documents that say that PDVSA has restarted imports to its Isla Curacao facility after a seven-month hiatus as Venezuela tries to staunch the bleeding of its dwindling fuel output.\n\nThe Isla refinery, capable of receiving VLCCs, is a hub for oil destined for the booming Asian market, but is struggling with a lack of crude oil to refine as years of underinvestment has restricted its own crude oil production.\n\nPDVSA is due to receive two cargoes full of American crude from China and two other vessels full of Russian Urals crude from Glencore in the coming weeks, the documents said. The per-barrel cost for all of the shipments will be at $66 per barrel, which is slightly above market rates, but cash payments from Venezuela are few and far between. Instead, PDVSA has agreed to deliver fuel oil and heavy crude in exchange for the imported oil.\n\nVenezuela is now in a \"deeper phase of economic stress,\" Moody's Investor Service said on Wednesday, according to The Oil and Gas Journal.\n\nFalling oil production and tough economic sanctions have increased pressures on the nation's financial capacity. Mismanagement and underinvestment in the country's oil and gas industry is causing defunct facilities to produce low quality oil that does not meet the requirements of its usual buyers. Venezuela's production is falling faster that high barrel prices can fill the revenue gap, the credit rating agency added.\n\nRelated: Oil Market Makes Major Shift As US Oil Heads To Middle East\n\nMoody's sees \"a negative feedback loop between declining production across all economic sectors, accelerating scarcity of hard currency, and an economic policy mix defined by price controls and forced discounting that exacerbate supply shortages and hyperinflation.\"\n\nPresident Nicolas Maduro is still intent on milking the digital currency fad to help alleviate its severe cash shortage and circumvent U.S. sanctions that prevent Citgo from repatriating profits. After proposing an oil-backed national cryptocurrency called the petro, Maduro is now calling for an OPEC-wide one that would also include other large producers.", "Creden.co, a local startup, is the latest fintech created to provide online authentication using eKYC (electronic Know Your Customer), paving the way for cryptocurrency and initial coin offerings (ICO).\n\n\"By the end of this year, we believe the online authentication of eKYC in Thailand will see early adopters and utilisation will be more extensive in 2019,\" said e-commerce pioneer Pawoot Pongvitayapanu, co-founder of Creden.co.\n\nSupported by DTAC Accelerate and Kongboonma, the owner of Chan Wanich Security Printing Co, the local startup received funding of 5 million baht.\n\nThe regulator has a policy to support secure online transactions, driving Thailand 4.0 through e-payment, and this encourages eKYC service.\n\nFranchise financial institutions also have strong demand for eKYC to increase customer convenience.\n\nThe eKYC service eliminates the traditional process of paper-based copies of ID cards and house registration documents, bank statements or approval letters from employers.\n\nFor businesses, eKYC can help reduce costs and time to verify identity.\n\n\"We can team up with interested banks who want to adopt eKYC by joining the Bank of Thailand's sandbox and audit its system security,\" Mr Pawoot said.\n\nCreden.co also provides online credit scoring by analysing multiple sources of data from social media and government agencies such as the Business Development Department to provide accurate results for financial loans for individual customers or corporations.\n\nWith blockchain technology and the power of big data analytics, combined with affiliate Thoth Zocial, the credit scoring system will have more dimensions and trustable data.\n\nThe company will provide eKYC and online credit scoring services based on a fee model. It will introduce a mobile app for end-users to check their own credit at an affordable price, Mr Pawoot said.\n\nThe service offers high potential for ICOs, as it can help the regulator to verify ICO investors.\n\nMr Pawoot said the company wants to expand its service to the full Asean market in the future.", "Cryptocurrency exchange Coincheck's signboard is pictured in front of a building where their office is located, in Tokyo January 29, 2018. -- Reuters picTOKYO, Feb 9 -- Japan's National Tax Agency has caught onto the cryptocurrency mania gripping the world and investors in digital coins are about to pay the price.\n\nHaving ruled last year that capital gains on these transactions are a form of \"miscellaneous income,\" investors are now required to declare their profits in annual tax filings due Feb 16-March 15.\n\nUnlike winnings on stocks and foreign currencies, which are taxed around 20 per cent, Japan's levy on profits from virtual money runs from 15 per cent to 55 per cent. The top amount applies to people with annual earnings of 40 million yen (RM1.44 million).\n\nWith no capital gains tax on long-term investments in virtual money in some jurisdictions including Singapore, a handful of cryptocurrency-rich investors have already left Japan, said Kengo Maekawa, chief executive of Shiodome Partners Tax Corp.\n\nMaekawa said his firm has had an influx of clients, most of them in their 30s and 40s, seeking tax advice on virtual-currency income.\n\nJapan isn't alone in taxing digital money. In the US, the Internal Revenue Service in 2014 declared cryptocurrencies to be property, like gold or real estate, making long-term capital gains on them subject to tax, though at rates lower than Japan.\n\nThe revenue-raising potential for the Japanese government could be significant. In recent months about 40 per cent of all trading in Bitcoin -- the most widely known virtual currency -- has been against the yen.\n\nSome parts of the new tax process in Japan remain unclear.\n\nHiroyuki Komiya, who runs a blockchain technology consulting firm in Tokyo, said he managed to cut back on \"a few million yen\" worth of taxable income by using an \"overall average\" rather than a \"moving average\" to do his calculations.\n\n\"The government hasn't clarified certain details, so you're left unsure whether you've got it right or not,\" said the 36-year-old.\n\nKomiya also complained that he might have to sell some of his digital coins to get the hard cash he needs to pay his taxes.\n\nIn the meantime, the tax agency is creating a data base on cryptocurrency investors and teams based in Tokyo and Osaka are maintaining a close watch electronic trading. -- Bloomberg"]