["Wall Street is known for being a cut throat place where shrewd business people play as tough as possible in order to make gains or their destroy opponents. However, the crypto ecosystem can be at times far more nasty than any other market. One company that had the audacity to rate everyone's favorite cryptocurrency somewhat poorly learned this recently, but it still stands by the rankings.\n\nWeiss Ratings, an independent U.S. rating agency which recently issued letter grades for cryptocurrencies has published a new report to explain its decision to score bitcoin a mere C+ (\"fair\").\n\nThe company obviously felt it needed to counter attack against critics after its rankings caused it to get hurled insults from many cryptocurrency people and opinion leaders on social media. It even suffered a cyber attack which took down the Weiss site temporarily. The 14-page report is meant to answer the outcry by revealing key factors and data behind the rating.\n\n\"For investors,\" explains Weiss Ratings founder Martin D. Weiss, PhD, \"an A rated crypto would be one that rarely crashes, and right now, there's no such thing. But we do understand where developers are coming from. They tell us they don't care about market fluctuations. They feel our ratings should reflect strictly the quality of their work and its relative success in the real world.\"\n\nAiming to address both investors and developers, the Weiss model combines a number of sub-models: Risk and Reward, adapted from its stock and ETF ratings, plus Fundamentals and Technology, which are unique to cryptocurrencies. Here's how they determined bitcoin performs on each:\n\nRisk and Reward-\"Bitcoin investors have recently made less than altcoin investors, while continuing to experience the risk of extreme volatility.\"\n\nFundamentals-\"Due credit is given for adoption and security, but Bitcoin loses points on network congestion with just four transactions per second and high fees of about $10 per transaction. In addition, the top five miners control some 70% of total hashpower, also a negative.\"\n\nTechnology-\"Bitcoin lacks the governance needed for prompt upgrades and is falling behind in a rapidly evolving industry.\"\n\nAnother criticism that was leveled at the agency is that Weiss overweights price volatility. \"Not so,\" he says. \"Our model accurately reflects an inconvenient truth about the market's extreme swings. But our ratings are continually updated. If prices stabilize or speed enhancements are rolled out successfully, an upgrade is possible.\"", "China will reportedly block anyone in the country from accessing websites that offer cryptocurrency trading services or initial coin offerings (ICOs). Advertisements relating to Bitcoin and other virtual currencies have also been scrubbed from search engines and social media in the country.\n\nThe authorities in China have already banned ICOs and shut down domestic exchanges, but that didn't solve the issue of people accessing foreign services within the country.\n\nNow, according to local media, China will block access to domestic and foreign services \"to prevent financial risk.\" China has a long tradition of blocking unwanted foreign websites using the so-called Great Firewall of China.\n\n\"Overseas transactions and regulatory evasion have resumed,\" said an article published Sunday night by the People's Bank of China-affiliated Financial News, as quoted by the South China Morning Post. \"Risks are still there, fueled by illegal issuance, and even fraud and pyramid selling.\"\n\nThe central bank reportedly said it would \"tighten regulations\" on Chinese people's participation in overseas cryptocurrency transactions and ICOs. According to SCMP, cryptocurrency ads have also now vanished from the Baidu search engine and the social media platform Weibo, much as recently happened with Facebook.\n\nICO: Everything You Need to Know\n\nNot to be confused with an IPO.\n\nThe latest Chinese news comes at a shaky point for Bitcoin. Having slid below the $8,000 mark on Friday, Bitcoin recovered slightly before falling again through Sunday and Monday. The price at the time of writing is $7,986.\n\nApart from regulatory moves around the world, the latest development spooking the market is the decision by major U.S. banks to ban the use of their credit cards for cryptocurrency purchases. The U.K.'s Lloyds Banking Group followed suit on Monday.", "The price of a single bitcoin briefly crossed $10,000 yesterday as details emerged about a mysterious buyer's bet on the cryptocurrency. (See also: Bitcoin Price Topped $10,000 Amid Cryptocurrency Rally.)\n\nAccording to a tweet, a bitcoin address bought almost $1 billion worth of bitcoin during a dip in its prices recently. The buyer first bought bitcoin worth $344 million between February 9 and February 12, when its price traversed the range between $8,500 and $8,900. The buyer doubled down on bitcoin by purchasing 41,000 coins, just before its price hit $10,000.\n\nThe tweet will provide further ammunition to critics of the cryptocurrency. In the past, detractors have noted that despite bitcoin's claims of being decentralized, its price is susceptible to being manipulated by \"bitcoin whales,\" or investors and traders who hold large stashes of the virtual currency.\n\nMeanwhile, noted cryptocurrency analyst Tom Lee, who has a $25,000 price target for bitcoin by the end of this year, has predicted a bump in its prices starting in July.\n\n\"In general, we see 2018 being a strong year but we see the larger and more established blockchains growing in dominance in 2018 - hence better upside for ETH and BTC over the FS CryptoFX indices,\" he wrote.\n\nAmong the top 10 most-traded cryptocurrencies, bitcoin cash was the biggest gainer and moved up by 11.32% from its price 24 hours ago. After rallying for two days, crypto markets mostly moved sideways this morning. At 15:11 UTC, they had a total market cap of $481 billion, up from $468 billion earlier this morning.\n\nAs the original cryptocurrency, bitcoin's price has mostly correlated with other coins. Or so it is assumed. According to analysis by Bloomberg, bitcoin's price correlation with other cryptos \"broke down\" when it rallied. But a fall in crypto prices re-established the lockstep movement.\n\nIn quantitative terms, bitcoin's price had a correlation of 0.57 with other cryptocurrencies when prices tumbled. When they rose, it declined to 0.19. A correlation of 1 translates to synchronous movements. This is interesting analysis for traders interested in diversifying their funds away from bitcoin towards other coins. (See also: Cryptocurrency Exchange Coinbase Accused of Overcharging Users.)", "Go big or go home. That's the motto of one mysterious investor who put his chips on the table, buying close to $400 million of the No.1 digital currency, bitcoin.\n\nThe purchase comes as cryptocurrencies are making a comeback after a dreadful start to 2018. Major digital currencies lost as much as 50% to start the year as growing regulation and security fears crippled the market, seeing traders bail on their positions. However, the tide has turned.\n\nCFTC: Beware cryptocurrency pump-and-dump schemes\n\nThe price of bitcoin BTCUSD, +0.81% has increased more than 60% since trading under $6,000 on February 6, pushing back above $10,000, helped by signs of growing recognition of digital currencies from officials in Washington.\n\n\"Not sure who that big buyer was but many have bought this dip and have added since the rebound and additional regulatory clarity in the U.S. and China,\" Alex Sunnarborg, Founding Partner of Tetras Capital said.\n\nThe unknown trader with the bitcoin address 3Cbq7aT1tY8kMxWLbitaG7yT6bPbKChq64 purchased the coins between Feb. 9 and Feb. 12, taking his bitcoin balance from 55,000 coins to more than 96,000.\n\nThe transaction, which was blasted all over social media and online chat forums emboldened bulls who had argued that $6,000 was a bottom.\n\n\"In the meantime, the $400 million whale is fuel for the Telegram channels where traders lay out their conspiracy theories,\" said Jeff Koyen, president of 360 Blockchain USA.\n\n\"However, I am willing to believe that, seeing bitcoin bottom around $6,000, Wall Street smelled blood and jumped back in,\" he said.\n\nWith bitcoin back above $10,000, the owner of the address is closing is on the bitcoin billionaires club.", "Speaking at the Munich Security Conference, the White House cybersecurity coordinator has stated that the U.S. government is nowhere close to regulating Bitcoin. He particularly emphasised the need to better understand the cryptocurrency's risks and benefits before embarking on any sort of regulatory regime.\n\nHundreds of world leaders and security chiefs are gathered at Munich's luxury Hotel Bayerischer Hof this weekend in what's been called the \"Academy Awards for security policy wonks.\" The Munich Security Conference comprises three days of debates, speeches, and sideline meetings regarding international defence policy, and is attended by top world leaders, as well as CEOs, human rights campaigners, and environmentalists.\n\nSpeaking with CNBC, Rob Joyce, special assistant to the President and White House cybersecurity coordinator, said there's a long way to go before the U.S. government starts regulating Bitcoin and other cryptocurrencies. Joyce emphasized the need to better understand the cryptocurrency's risks and benefits before moving forward with any sort of regulation: \"I think we're still absolutely studying and understanding what the good ideas and bad ideas in that space are,\" he said when asked about the potential for government regulation. \"So, I don't think it's close.\"\n\nBitcoin is a decentralized and digital, and unlike fiat currencies such as the dollar it's not backed by a central authority. And as transactions are anonymous, the coin has been accused of making it easier for those engaged in illicit activities to hide their money. But this ability that Bitcoin and other cryptocurrencies offer to avoid traditional restrictions on money and assets is part of what makes it so popular to those who use it. That decentralization is also much of the reason its price swings so wildly.\n\n\"We are worried. There are benefits to the Bitcoin concept -- digital cash, digital currencies,\" Joyce said. \"But at the same time, if you look at the way Bitcoin works after there is a criminal act that takes place, you can't rewind the clock and take back that currency.\" Joyce described the inherent problem with this lack of a trail, noting that in the case of credit card theft, for instance, individuals or companies can contact their banks and purchases can be undone and the cash retrieved.", "The first player to beat the PC game \"MonteCrypto: The Bitcoin Enigma\" will be awarded one whole bitcoin.\n\nAt the time of writing, a single bitcoin is priced at around $US10,100 - though, given the wild swings in bitcoin's price, who knows what it will be worth when the game officially comes out on February 20th. Motherboard reports that it will cost $US2.\n\nThe game developers, Gem Rose Accent, humorously claim \"this game must be amongst the hardest you've ever played.\" To beat the game and claim your cryptocurrency prize, players will have to navigate through a maze and solve 24 \"mind bending\" puzzles.\n\nThere's a multiplayer aspect to the game, as well, where you can team up with others to find clues and solve the puzzles.\n\nAt the same time, there are no rules as to how you or other players should conduct themselves, at least when it comes to beating the game. Other players could just as easily lead you down the wrong path - taking you away from the prize, and themselves closer.\n\nCheck out the YouTube video trailer for \"MonteCrypto: The Bitcoin Enigma:\"\n\nIt's still a few days before that February 20th release. But you can get a headstart by finding a clue in the game website's source code, according to the site's FAQ. To pull up the site's source code, just right-click anywhere on the site and click \"View page source.\" It will look like a lot of nonsense to anybody who's not familiar with HTML code:\n\nIt's not clear where the clue is hidden: It could be in the source code of either the Home page or FAQ page. The other two clickable links lead you to a press kit download and the Steam product page, so there's no source code to browse through there.\n\nI obviously pulled up the source code of both the Home and FAQ page and lazily searched for \"clue,\" and I was met with a message that's not visible on the regular FAQ page. It reads: \"haha you really thought this was going to work?\"\n\nWell, you have three days to divine that first clue before the hunt truly begins. And on a final note, in case you're wondering: The developers have provided apparent proof, in the form of a public bitcoin wallet address, that they have a bitcoin to give away.", "Shares in Castle Rock, Colo.-based Riot Blockchain Inc. fell by more than 30% Friday after an investigative report raised fresh concerns about the cryptocurrency-related company's business and recent executive share sales.\n\nOn Oct. 4, 2017, the company changed its name from Bioptix Inc. to Riot Blockchain, as it pivoted from a biopharma company to its newfound cryptocurrency strategy, sending its shares surging, as bitcoin and other digital currencies were rocketing in value, and mainstream interest in distributed-ledger technology, or blockchain, was surging.\n\nCNBC's report on Friday attempts to dig deeper into the executives behind Riot Blockchain RIOT, -30.52% recent insider stock sales that have raised eyebrows and the company's operations, including scheduled shareholder meetings that never happened.\n\nIn December, CEO John O'Rourke sold more than $800,000 of Riot shares, CNBC highlighted in its story. SEC filings show that O'Rourke sold 30,383 shares in the company at an average price of $28.61, or $869,000. O'Rourke has said in the past that the sale of shares was for tax purposes.\n\n\"Basically, I sold less than 10 percent of my overall position. And I was doing it for tax obligations,\" O'Rourke told the Denver Post on Feb. 8.\n\n\"I could have sold more stock, but at the time, I sold what I needed.\"\n\nFollowing O'Rourke's shares sale, Riot's stock fell eight of the following nine trading sessions, recorded five consecutive weekly losses, reaching a low of $10.40, representing a 63.6% plunge from early February.\n\nIt has been a busy two weeks for Riot. On Feb, 7, the company said it would buy Miami-based cryptocurrency firm Logical Brokerage Corp, which saw shares jump by 20% by the end of the trading.\n\nRiot Blockchain's stock jumps as company set to acquire digital-currency exchange\n\nFriday's decline has wiped out those post-acquisition gains and then some.\n\nCalls to Riot Blockchain's Colorado office yielded no return.", "Just a month after Berkshire Hathaway CEO Warren Buffet expressed his doubts over digital currencies, his number two in the company weighed in on the debate with similar comments.\n\n\"I never considered for one second having anything to do with it. I detested it the moment it was raised. It's just disgusting. Bitcoin is noxious poison,\" Charles Munger, vice-chairman of the company reportedly said.\n\nMunger, paying little attention to Bitcoin's current market value and its long-term perspectives, believes that the government should oversee a massive crackdown on cryptocurrencies, similar to one the Chinese authorities have undertaken.\n\n© REUTERS/ Dado Ruvic/Illustration/File PhotoBitcoin Bandit: Chicago Trader on Trial For Stealing $2 Mln in Cryptocurrency\n\n\"Our government's more lax approach to it is wrong. The right answer to something like that is to step on it hard,\" he said.\n\nIn January, China introduced a string of additional regulations to crush the mining industry, prompting China's bitcoin mining giants to branch out to open new facilities abroad -- in Iceland, Canada, the US and elsewhere.\n\nREAD MORE: Coinbase Attempts to Fix the Error That 'Drained' Clients Bank Accounts\n\nAs of a leaked January 2 memo from the 'Leading Group of Internet Financial Risks Remediation', the country's internet finance regulator which conducted the clampdown on bitcoin -- bitcoin miners should make an \"orderly exit\" from China since they have consumed \"huge amounts of resources and stoked speculation of virtual currencies.\"\n\nREAD MORE: 'American Intelligence' Project Bitcoin Could Fall to $300 -- Russian Lawmaker\n\nTo say adieu to the miners, the group asked its local reps to look into policies around price, tax, land usage and environmental concerns, most prominently, energy consumption issues.", "The U.S. Securities and Exchange Commission said Friday that it has temporarily suspended the trading of three companies as it looks into statements they made regarding the purchase of cryptocurrency and blockchain-related assets.\n\nThe regulator announced that the trade of securities for the companies - Cherubim Investments, Inc., PDX Partners, Inc., and Victura Construction Group, Inc. - will be suspended between 9:30 a.m. EST Friday and March 2.\n\nThe agency explained:\n\n\"The SEC's trading suspension orders state that recent press releases issued by CHIT, PDXP and VICT claimed that the companies acquired AAA-rated assets from a subsidiary of a private equity investor in cryptocurrency and blockchain technology, among other things. According to the SEC order regarding CHIT, it also announced the execution of a financing commitment to launch an initial coin offering.\"\n\nA release published by the agency cites additional reasons for the suspensions. In the case of Cherubim, the trading halt came as a result of \"its delinquency in filing annual and quarterly reports.\"\n\nThe suspensions represent the latest move by the agency to halt trading of companies that have publicly stated some kind of pivot or business focus on the technology. In at least one case, the public suspension followed a significant run-up in the price of a stock in light of those remarks.\n\nIn August, the agency issued a warning to investors about the risk of pump-and-dump schemes that use statements about initial coin offerings (ICOs) in order to drive market action.\n\n\"Fraudsters often try to use the lure of new and emerging technologies to convince potential victims to invest their money in scams,\" the SEC said at the time.\n\nSEC emblem image via Shutterstock", "The Securities and Exchange Commission suspended trading on Friday in Cherubim Interests, Inc. CHIT, -25.00% PDX Partners, Inc. PDXP, -8.16% and Victura Construction Group, Inc. VICT, +4.55% because of questions surrounding similar statements they made about the acquisition of cryptocurrency and blockchain technology-related assets. The SEC said recent press releases issued by the three companies claimed that the companies acquired AAA-rated assets from a subsidiary of a private equity investor in cryptocurrency and blockchain technology, among other things. Cherubim Interests, Inc. also announced the execution of a financing commitment to launch an initial coin offering. The SEC has questions regarding the nature of the companies' business operations and the value of their assets, including in press releases issued beginning in early January 2018. The SEC also said Cherubim Interests, Inc is delinquent in filing annual and quarterly reports. The SEC has been warning investors to be on alert for companies that may publicly announce ICO or coin/token related events for the sole purpose of moving the price of the company's common stock.", "The third-largest cryptocurrency by market cap has seen a volatile start to the year, with price swings well over 40% in either direction. Bitcoin cash was trading at $1,476 per coin early Friday, up 65% in the last three months, but well off its December high of $4,053.\n\nBitcoin cash, which split from bitcoin in August 2017 has been accused of misleading investors by piggy-backing off the bitcoin name. It is completely unrelated in every aspect except its name.\n\nVocal bitcoin cash supporter Roger Ver, who owns bitcoin.com and refers to bitcoin as \"bitcoin core,\" has appeared on numerous alternative internet talk shows like InfoWars to promote the coin.\n\nLitecoin founder Charlie Lee tweeted many of these concerns Wednesday, using Ver to stop calling bitcoin \"bitcoin core.\"\n\nTwitter\n\nLee has also spoken out against a litecoin fork scheduled to happen later this weekend to form \"litecoin cash.\"\n\nBitcoin is down 2.54% Friday morning, Ethereum and Ripple's XRP are down 0.14% and 1.24% respectively.", "The third-largest cryptocurrency by market cap has seen a volatile start to the year, with price swings well over 40% in either direction. Bitcoin cash was trading at $US1,476 per coin early Friday, up 65% in the last three months, but well off its December high of $US4,053.\n\nBitcoin cash, which split from bitcoin in August 2017 has been accused of misleading investors by piggy-backing off the bitcoin name. It is completely unrelated in every aspect except its name.\n\nVocal bitcoin cash supporter Roger Ver, who owns bitcoin.com and refers to bitcoin as \"bitcoin core,\" has appeared on numerous alternative internet talk shows like InfoWars to promote the coin.\n\nLitecoin founder Charlie Lee tweeted many of these concerns Wednesday, using Ver to stop calling bitcoin \"bitcoin core.\"\n\nLee has also spoken out against a litecoin fork scheduled to happen later this weekend to form \"litecoin cash.\"\n\nBitcoin is down 2.54% Friday morning, Ethereum and Ripple's XRP are down 0.14% and 1.24% respectively.", "The price of bitcoin has surged past the £7,000 just hours after Warren Buffett's investment chief called the cryptocurrency a \"noxious poison\".\n\nThe notoriously volatile cryptocurrency touched a high of $10,293 (£7,319) on Friday as confidence rallied after a series of shocks that saw prices plummet below $6,000 (£4,267) earlier this month.\n\nThe stabilisation of the beleaguered digital token above the psychological barrier of $10,000 came after the vice-chairman of Warren Buffett's investment firm Berkshire Hathaway spoke out against it.\n\nSpeaking at the annual meeting of the US publishing firm Daily Journal in Los Angeles, Charles Munger said: \"I never considered for one second having anything to do with it. I detested it the moment it was raised. It's just disgusting. Bitcoin is noxious poison.\"\n\nAdding that he thought the cryptocurrency was \"totally asinine\", he called for US government action to crack down on bitcoin - similar to measures taken in China.\n\n\"Our government's more lax approach to it is wrong. The right answer to something like that is to step on it hard,\" he said.\n\nBitcoin's recovery follows weeks of turbulence as the value of bitcoin rose and plummeted in cycles that left investors on the edges of their seats.\n\nThe cryptocurrency hit a record high in mid-December as prices soared to $19,850 (£14,310) - but tumbled in the first month of 2018.\n\nIt finally plummeted to $6,000 (£4,325) in early February as a series of high-profile thefts and fears of regulation demolished its gains.\n\nSouth Korea recently barred people from trading bitcoin and other cryptocurrencies anonymously, but said it is not planning to ban digital currency exchanges.\n\nMeanwhile, Theresa May hinted that the UK government may introduce similar measures, while the US government has fretted over the cryptocurrency's popularity with criminals.\n\nThe European Central Bank this week however ruled out a ban on cryptocurrencies, saying such a move would not be in its remit.", "Bitcoin was trading at $9,908.34 in India today on CoinDesks's Bitcoin Price Index (BPI) at the time of reporting. Earlier in the day, Bitcoin price was recorded at a high of $10,277.99. On Thursday, the digital currency touched crossed $9,000 - a psychologically key level for the virtual currency.\n\nBitcoin was trading at $9,908.34 in India today on CoinDesks's Bitcoin Price Index (BPI) at the time of reporting. Earlier in the day, Bitcoin price was recorded at a high of $10,277.99. On Thursday, the digital currency touched crossed $9,000 - a psychologically key level for the virtual currency. However, Bitcoin is still far from reaching the figure of $19,783 that it touched on December 17, 2017. Bitcoin was under intense pressure in the last two months amid a series of negative headlines around increased scrutiny by regulators worldwide. However, sentiments related to Bitcoin have improved substantially over the last few weeks. Even in India, Reserve Bank has issued repeated warnings to the investors who have invested in digital currencies especially Bitcoin. In the budget 2018 speech, Finance Minister Arun Jaitley said that cryptocurrency is not a legal tender in India. However, the government will explore blockchain to usher in the digital economy, he said.\n\nThe rise in Bitcoin last year has almost coincided with the bull rally observed in the global stock markets, Reuters quoted Miles Eakers, chief market analyst, at FX brokerage Centtrip saying. Just like Bitcoin, other cryptocurrencies namely Ethereum and Ripple also surged in the last few weeks. Bitcoin's rise to $10,000, first time in more than 2 weeks, has raised hopes among the investors as they purchased back the virtual currency after it fell 70 percent from the all-time high reported in mid-December.\n\nAs Bitcoin observed a steady recovery, Yves Mersch, European Central Bank executive board member, issued a warning during his speech in Paris that Bitcoin is a speculative digital asset, Market News International reported. These currencies are devoid of any trusted issuer and hence, will become worthless at any point in time, he added. There is no surprise that these digital currencies are not accepted widely as means of payment, he further said. Nouriel Roubini, the famous American economist who rightly predicted the housing crash of 2008 in the US, had termed Bitcoin mania as mother of all bubbles that will burst anytime soon.", "AMD's new processors provide a great performance at a budget price.\n\nTwo new AMD Ryzen processors have arrived for desktops boasting some impressive inbuilt graphics - the fastest ever built into a desktop processor.\n\nThe AMD Ryzen 5 2400G features 4 cores 8 threads with a base clock of 3.6GHz and a boost of up to 3.9Ghz, while also containing the Vega 11 architecture to power the graphics.\n\nThe AMD Ryzen 3 2200G boasts 4 cores 4 threads, with a base clock of 3.5Ghz boosting up to 3.7Ghz, and holds the Vega 8 architecture on the graphics side.\n\nBoth processors offer impressive pricing at £149.99 ($169) and £89.99 ($99) respectively and are placed nicely in the entry level space for gamers or creators on a budget, as these chips are going to punch well above their weight in terms of price/performance.\n\nAMD vs Intel - what is the best for you?\n\nIt's an interesting move as the Ryzen 3 and 5 lines are certainly mid-range processors and the power they can put out is nothing to be sniffed at, especially when the price is taken into consideration.\n\nWhile this move would make a lot of sense for laptop based hardware, one would think anyone putting together a desktop system and buying a Ryzen 5 would also be purchasing a graphics card along with it - as anything you'd want a Ryzen 5 for would probably need a stand-alone graphics card as well.\n\nOn the other hand, considering the price of graphics cards at the moment is so high due to cryptocurrency mining, these new processors could do extremely well for people who are looking for a budget desktop that they can play some games on.\n\nIs it worth picking one up now? As ever, that depends on your budget - if you want a modest gaming PC to play League of Legends, Hearthstone, or another game that isn't going to be too graphically intensive then this will be ideal for you. However, don't expect to run PUBG or any of the latest AAA title on max settings.\n\nIf you don't want to buy a stand-alone graphics card at the moment (which is very understandable) then this could be a good short term solution while you wait for the prices to drop back down to something more reasonable.", "Chinese New Year is here along with more believers that Bitcoin's dips in January were due to Asian crypto investors cashing out their positions to fund their gift spending for the holiday season.\n\nIn the crypto world, there are many oddities that set it aside from any other investment space. For example, we recently reported to you that cryptocurrency miners and their demand for GPUs are interfering with the search for alien life!\n\nWhile that seems to be a bit of stretch, there's another interesting observation that there is a correlation between the Chinese New Year and cryptocurrencies' price movements. This is especially the thought about Bitcoin.\n\nOn Feb. 15, which is the day before the festive holiday began, Bitcoin punched through $10,000. Bitcoin hadn't been that high since the beginning of February when it was $1081.69.\n\nAt the time of writing, it was roughly $10,180. Also at the time of writing, Chinese New Year had officially begun.\n\nAlso known as Spring Festival and Lunar New Year, Chinese New Year is the most important holiday in China. For 2018, the festivities officially started on Friday, Feb. 16., which marks the beginning of the Year of the Dog. It is considered to be East Asia's most important holiday season.\n\nIn addition to feasting with family and friends, many Asians see the holiday as a way to lavish their loved ones with gifts. If not gift giving, many take the weeklong holiday to vacation and travel.\n\nGiven that so many chose Bitcoin to grow their financial coffers, many have plenty of extra of money to spend thanks to the crypto's meteoric rise in 2017. There is a train of thought that so many crypto holders cashed out of their investments to have money to buy gifts that it caused Bitcoin's price to tumble.\n\nIt's interesting that Chinese New Year spending can be correlated with Bitcoin's price crash because so many were cashing out their positions. While that's slightly plausible, it cannot be chalked up to be the main culprit behind Bitcoin's price fall. Bitcoin, the face of the cryptocurrency space, slid from around $17,000 at the beginning of the year to less than $5,900 a month later\n\nMany believe the fall was a long time in the making considering Bitcoin's lightning speed take off from $1,000 at the beginning of 2017, to $20,000 at the end of 2017. A correction was long overdue.\n\n\"In every year since 2015, Bitcoin has shed value in January and gained it in February,\" according to The Street. It reported that:", "The US derivatives regulator warned investors on Thursday about cryptocurrency \"pump-and-dump\" scams that aim to rip off investors by inflating the price of volatile virtual tokens through spreading bogus information.\n\nThe Commodities Futures Trading Commission said in a statement that it had received complaints from investors who had lost money in such schemes, and warned against buying cryptocurrencies based on tips found on social media.\n\n\"As with many online frauds, this type of scam is not new - it simply deploys an emerging technology to capitalize on public interest in digital assets,\" CFTC director of public affairs Erica Elliott Richardson said in the statement.\n\nThe CFTC's warning comes as financial regulators worldwide intensify their scrutiny of cryptocurrencies, which are virtual coins not backed by governments. Cryptocurrency trading has been booming over the past year, with the price of coins such as bitcoin and ethereum hitting record levels in volatile markets.\n\nBitcoin topped $10,000 on Thursday for the first time in more than two weeks, as investors bought the digital currency after it had fallen 70 percent from its record peak in December.\n\nCryptocurrencies are traded on largely unregulated and anonymous online exchanges, many of which have been plagued by problems such as hacks and technical glitches. The CFTC considers bitcoin a commodity and has anti-fraud and manipulation enforcement authority over virtual currency markets.\n\nCryptocurrency \"pump-and-dump\" schemes are generally carried out anonymously on public chatrooms or on mobile chat apps.\n\nIn the \"pump\" phase, organizers typically post fake or misleading information enticing other investors to buy a token and thus inflate its price. The organizers then quickly sell their holdings of that token - the \"dump\" - and make a profit at the expense of other investors.\n\n\"The price falls and victims are left with currency or tokens that are worth much less than what they expected,\" the CFTC said in its statement.\n\nThe CFTC has been expanding its reach over cryptocurrencies, having authorized two large U.S. exchanges to list bitcoin futures late last year.\n\nAt a Senate hearing this month, CFTC Chairman Christopher Giancarlo noted that the regulator was focused on cracking down on manipulation of cryptocurrency markets.\"What we will do and we are doing is looking for fraud and manipulation,\" Giancarlo said. \"And we intend to be very aggressive.\"", "NEW YORK: The U.S. derivatives regulator warned investors on Thursday about cryptocurrency \"pump-and-dump\" scams that aim to rip off investors by inflating the price of volatile virtual tokens through spreading bogus information.\n\nThe Commodities Futures Trading Commission said in a statement that it had received complaints from investors who had lost money in such schemes, and warned against buying cryptocurrencies based on tips found on social media.\n\n\"As with many online frauds, this type of scam is not new - it simply deploys an emerging technology to capitalize on public interest in digital assets,\" CFTC director of public affairs Erica Elliott Richardson said in the statement.\n\nThe CFTC's warning comes as financial regulators worldwide intensify their scrutiny of cryptocurrencies, which are virtual coins not backed by governments. Cryptocurrency trading has been booming over the past year, with the price of coins such as bitcoin and ethereum hitting record levels in volatile markets.\n\nBitcoin topped US$10,000 on Thursday for the first time in more than two weeks, as investors bought the digital currency after it had fallen 70 percent from its record peak in December.\n\nCryptocurrencies are traded on largely unregulated and anonymous online exchanges, many of which have been plagued by problems such as hacks and technical glitches. The CFTC considers bitcoin a commodity and has anti-fraud and manipulation enforcement authority over virtual currency markets.\n\nCryptocurrency \"pump-and-dump\" schemes are generally carried out anonymously on public chatrooms or on mobile chat apps.\n\nIn the \"pump\" phase, organizers typically post fake or misleading information enticing other investors to buy a token and thus inflate its price. The organizers then quickly sell their holdings of that token - the \"dump\" - and make a profit at the expense of other investors.\n\n\"The price falls and victims are left with currency or tokens that are worth much less than what they expected,\" the CFTC said in its statement.\n\nThe CFTC has been expanding its reach over cryptocurrencies, having authorized two large U.S. exchanges to list bitcoin futures late last year.\n\nAt a Senate hearing this month, CFTC Chairman Christopher Giancarlo noted that the regulator was focused on cracking down on manipulation of cryptocurrency markets.\n\n\"What we will do and we are doing is looking for fraud and manipulation,\" Giancarlo said. \"And we intend to be very aggressive.\"", "Moody's - CME Group Inc. (CME, Aa3 stable) and Cboe Global Markets, Inc. (Cboe, Baa1 positive) recent launch of Bitcoin Futures contracts is not anticipated to affect the creditworthiness of either entity, owing to strong risk management at central counterparty clearing houses (CCPs), low futures' volumes and the futures' exchanges conservative approach to managing Bitcoin exposure, Moody's Investors Service says in a new report. The price volatility of Bitcoin presents risk management challenges for CCPs which makes it more difficult to close out a defaulting clearing member's exposures. To manage this risk, both CME and Cboe set relatively high margins for Bitcoin futures trades to mitigate counterparty exposure, and have increased margin requirements from those they first presented to regulators in October 2017. \"We expect the CME and Cboe to make conservative adjustments to these margins in response to changing market conditions -- namely, a sudden rise in the volatility of Bitcoin prices -- as a risk and credit control measure,\" Moody's Analyst Fadi Abdel Massih says. Risk is contained for retail brokers as well.\n\nThe firms that offer the products, such as TD Ameritrade Holding Corporation (TD Ameritrade, A2 stable) and E*TRADE Financial Corp. (E*TRADE, Baa3 review for upgrade) maintain conservative policies and margining to account for Bitcoin's high price volatility. The cautious approach from retail brokers includes pre-qualification for customers to trade Bitcoin futures as well as an adherence to high margins. This risk management tool protects the brokers' exposure at the clearing house in a scenario where a customer defaults on a position. \"The margin that a broker requires from its customers is typically at least 10% more than the margin required by the clearing house from the broker, an important risk mitigation,\" Massih says.\n\nHowever, operational risk is introduced to the underlying price of future contracts due to the use of unseasoned cryptocurrency spot exchanges. CME and Cboe use different methodologies to determine the reference rate for Bitcoin futures, and they both rely for price discovery on newly established cryptocurrency exchanges that have historically lacked meaningful regulatory oversight.\n\nPowered by Capital Market - Live News", "Ripple has signed partnerships with the central banks of England and Saudi Arabia. GEOFFROY VAN DER HASSELT/AFP/Getty Images\n\n\"I try not to check [cryptocurrency prices] more than once a day,\" Brad Garlinghouse, CEO of Ripple, commented on the wild fluctuations of cryptocurrencies lately in an interview with Bloomberg on Wednesday after the Goldman Sachs Technology and Internet Conference in San Francisco.\n\nLike many cryptocurrency advocates' unconvincing views on the matter, Garlinghouse said digital currencies are an emerging asset class that should be treated as a long-term investment rather than speculative gambling.\n\n\"At its core, all of this comes down to if we are solving real problems for real customers. If the cryptocurrency market overall or a digital asset is solving a problem, it's going to drive some value,\" Garlinghouse said.\n\nThe problem that Ripple is trying to solve is cross-border payments.\n\nCurrently, most cross-border transactions take at least two business days to complete.\n\n\"Today, when you are moving money, say from San Francisco to Paris, it's literally faster to buy an airplane ticket to fly it over there than it is to use the corresponding banking system,\" he said.\n\nWith Ripple currencies, or XRP, cross-border transactions can be completed within three seconds.\n\nAs such, it's not surprising that Ripple, in stark contrast with rival cryptocurrency companies, highly values its relationships with governments and central banks. The central banks of England (The Bank of England) and Saudi Arabia (Saudi Arabia Monetary Authority) have both signed partnerships with Ripple to install its blockchain software to process international transactions.\n\nLast week, Ripple sealed a deal with LianLian, one of China's largest digital wallet companies.\n\nThat's why Garlinghouse is an advocate for more regulation on the cryptocurrency market.\n\n\"I hope there's more regulation,\" he said. \"If we want this whole asset class to grow up and mature, of course there should be more regulation.\"\n\n\"Some of the bitcoin community come from that kind of anarchistic, libertarian view. But, one reason why I think Ripple has been very successful is because we work with the system,\" he added.\n\nThat said, the dollar price for Ripple has been on the same roller coaster ride as Bitcoin and Ethereum in the past few months. After rising more than 1,000 percent in December 2017, Ripple has lost two-thirds of its value since the beginning of this year.", "The price of Bitcoin appears to be recovering well from the dramatic fall it experienced at the end of last year. The cost to buy a single unit of the world's most popular cryptocurrency reached a two week high on Thursday, topping out at just above the $10,000 point. The second time passing, the five-digit psychological barrier seemed to offer little resistance as the price barely paused between $9,000 and the two week high.\n\nThe recent price surge seems largely driven by various news events clearing the fear and uncertainty surrounding the space of late. So far in 2018, doubt was cast over the market thanks to South Korea's musing over a cryptocurrency ban. The government there had mentioned the possibility of them taking such a harsh step but have since stated that there is no intention to eradicate the crypto-craze that's been sweeping the nation for some time. One report suggests that instead of the government there are others seeking to license cryptocurrency exchanges. This would serve to further legitimise the industry, as well as making the environment safer for investors.\n\nElsewhere, the latest round of SEC Senate hearings about Bitcoin is doing their fair share to dispel the doubt about cryptocurrencies that's been creeping in since late December. During the hearing, the chairman of the Commodity Futures Trading Commission, Christopher Giancarlo, said:\n\n\"We owe it to this new generation to respect their enthusiasm for virtual currencies, with a thoughtful and balanced response, and not a dismissive one.\"\n\nWhat's good news for Bitcoin is usually good news for the entire space. This was highlighted by similar gains across all major cryptocurrencies. Many within the top 20 by market cap have seen price leaps between two and 25 percent in the last 24 hours. This is according to industry price website Coinmarketcap.\n\nMeanwhile, Tom Lee of Fundstrat Global Advisors believes that the price per BTC should exceed the previous all-time high by July of this year. The longtime Bitcoin advocate noted in a report earlier today that during \"bull\" periods of upward trends, Bitcoin recoveries take 1.7 times the amount of time the initial decline lasted for. For Lee, this \"implies that 85 days are needed to recover prior highs -- this is July 2018.\" His end of 2018 price call remains $25,000.\n\nMati Greenspan, senior market analyst of eToro, spoke to CNBC via phone interview about the recent breakout of prices:", "Bitcoin bulls arguing that the popular cryptocurrency could surpass gold as a flight to safety investment have gotten some discouraging market feedback in the past several weeks. When the S&P 500 experienced its largest sell-off in years this month, it coincided with bitcoin's lowest price dip in months, indicating investors don't yet see cryptocurrency as a safe way to preserve value.\n\nThe numbers suggest that the GBTC bitcoin fund does have a relatively low 0.07 correlation with the SPY ETF. In fact, the GBTC ETF has even less of a correlation to stocks than the GLD ETF, which has a negative 0.19 correlation. The negative correlation likely comes in part by the fact that investors tend to buy gold on days of market weakness.\n\nThose arguing for bitcoin being its own asset class would point to the fact that the GBTC has very low correlation to stocks, gold, oil, treasury bonds or even market volatility, according to the table.\n\nUnfortunately, there's one key component of a safe haven investment that bitcoin is sorely lacking -- stability. Traders use a metric called average true range (ATR) to determine daily asset volatility.\n\nOver the past 14 days (as of Feb. 13), amid all the stock market turmoil, the ATR of the SPY ETF as a percentage of its trading price has been about 1.7 percent, according to Stockcharts.com. In that same period, the ATR of the GLD as a percentage of its share price has been a relatively stable 0.8 percent. The ATR of the GBTC as a percentage of its share price, however, has been an incredibly volatile 14.2 percent.\n\nWith a volatility that high, investors simply can't feel safe in bitcoin-related investments in the near-term, even if the cryptocurrency has near zero correlation with stock prices. For now, bitcoin traders can feel good knowing that the stock market doesn't appear to be influencing bitcoin prices in any major way. But stock investors will likely stick to the relative stability of gold and other traditional safe-haven plays until the cryptocurrency market settles down.\n\nRelated Links:\n\nGoldman Sachs Predicts The Current Generation Of Cryptocurrencies Likely Won't Survive", "The largest U.S.-based cryptocurrency exchange, Coinbase, is releasing a PayPal-like service of its own.\n\nOn Wednesday, Coinbase wrote about its new platform that will make it easier for merchants to accept payments with Bitcoin, Bitcoin Cash, Ethereum, and Litecoin through Coinbase Commerce.\n\nUsing the platform on an e-commerce website adds a PayPal-like button to the checkout screen.\n\n\"Coinbase Commerce can be directly integrated into a merchant's checkout flow or added as a payment option on an e-commerce platform,\" the blog post continued.\n\nShopify, which allows users to launch their own online stores, is already giving its users the option to accept payments via Coinbase Commerce.\n\nSome cryptocurrency aficionados immediately took to the platform.\n\nStill, don't expect a mass surge of merchants gearing up to accept cryptocurrency. Questions about whether or not the platform addresses issues that have barred many other merchants and consumers from accepting cryptocurrency still exist. The volatile price of Bitcoin, for instance, has made it difficult to nail down a price on payments. Gaming platform Steam cited that as an issue when it stopped accepting cryptocurrency.\n\nCoinbase is not the only company with such a platform. Bitpay, which is used by Microsoft, also makes a cryptocurrency payments program -- though notably, it only accepts Bitcoin.\n\nCoinbase's announcement comes at a time when the firm itself is having issues with payments. Several major banks no longer allow consumers to buy Bitcoin using credit cards. More recently, users reported issues withdrawing from their wallets using PayPal, prompting Coinbase to say it would disable PayPal transactions in two weeks, and overhaul the \"entire experience.\"", "Ripple prices have come full circle with the broad based rally in cryptocurrencies this week paring the early-February losses. The advance takes prices into monthly open resistance and while prices may be vulnerable here near-term the broader outlook remains constructive.\n\nTechnical Outlook: Ripple prices are up over 100% off the February lows with the advance now testing monthly open resistance at 1.1407. An ascending pitchfork formation extending off the January lows keeps the focus higher while above near-term support at ~9646 where the 100-day moving average converges on the 50-line. Broader bullish invalidation remains steady at the 2018 low-day close at 7600.\n\nNew to Forex Trading? Get started with this Free Beginners Guide\n\nNotes: A closer look at Ripple price action sees the cryptocurrency breaking above basic trendline resistance extending off the record highs late-last week with a pullback and defense of this slope further validating the near-term breakout. Interim resistance targets eyed at 1.2203 backed by the median-line / 61.8% extension at 1.2956 - a breach there would be needed to fuel the next leg higher in price with such a scenario targeting subsequent resistance objectives at 1.5457 backed closely by 1.6177.\n\nBottom line: The immediate advance looks a bit vulnerable here but the broader focus remains weighted to the topside while above the monthly / yearly low-day close. From a trading standpoint, I'll favor fading weakness into structural support OR buying a break and retest of the median-line (1.2956) as support for a move back towards the 1.6177.\n\nFor a complete breakdown of Michael's trading strategy, review his Foundations of Technical Analysis mini-series\n\n- Written by Michael Boutros, Currency Strategist with DailyFX", "Up another 7% today, Bitcoin has pushed all the way to $10,150.\n\nHas the crypto become just another risk asset? Bitcoin's bounce at the moment happens to be coinciding rather nicely with the rebound in stock prices.\n\nThe bears, meanwhile, are dragging out charts of the Nikkei circa 1989, the Nasdaq circa 2001, and the homebuilders circa 2006 to show the Bitcoin price pattern (parabolic to $20K, plunge to $6K, now retrace to $10K) fits in rather nicely with the collapse of other asset bubbles.\n\nRelated tickers: OTCQX:GBTC, COIN, RIOT, OSTK, SSC, MARA, UEPS, OTC:BITCF, XNET, GROW, OTCPK:BTSC, OTCQB:BTCS, OTCQB:MGTI, OTCPK:BTLLF SRAX, OTCPK:GAHC, OTC:ARSC, OTCPK:USTC, OTCPK:BLKCF, COINB, LFIN\n\nSee all stocks on the move \"\n\nNow read: 'Work On The Activities': How The IMF Chief Plans To Regulate Cryptocurrency \"", "Other cryptocurrencies are also up as crypto recovers from its early-February slump.\n\nBitcoin passed $10,000 a coin Thursday afternoon, making for the first time in just over two weeks its trading above the psychological hurdle.\n\nThe flagship cryptocurrency, which still accounts for 35% of the total value of all coins, is up 5.7% Thursday.\n\nBitcoin slumped at the start of February, but has been gaining steam again over the last week or so. It remains well off its all-time highs of over $19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent rally. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world.\n\nCharlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $40,000.", "Atari has become the latest company to pivot to cryptocurrency, launching a digital coin in a bid to revive the gaming pioneer's fortunes.\n\nAtari, the creator of some of the most iconic video games consoles of the 1970s and 80s, is to launch \"Atari Token\", its own cryptocurrency.\n\nThe French-listed company, which faded from the gaming industry and filed for bankruptcy in 2013, has now joined the growing list of companies jumping on the blockchain technology trend. Atari's shares have jumped more than 60pc since it announced the launch of its cryptocurrency last week.\n\nWhile Atari is best known for games like Pong, Pac-Man and Space Invaders, it is now turning to digital currencies. It is working on a blockchain-based digital entertainment platform, the company said in a statement, and online casinos that will accept cryptocurrency.\n\n\"Blockchain technology is poised to take a very important place in our environment and to transform, if not revolutionise, the current economic ecosystem, especially in the areas of the video game industry and online transactions,\" said Atari CEO Frederic Chesnais, according to Bloomberg.\n\n\"Our aim is to take strategic positions with a limited cash risk, in order to best create value with the assets and the Atari brand.\"\n\nBlockchain technology, which records data in a digital ledger, has been touted as a way to transform digital industry, from financial services to healthcare. But dozens of companies have jumped on the trend, launching their own cryptocurrencies or adding the word \"Blockchain\" to their name, often followed by a stock price jump.\n\nEstablished companies have turned to cryptocurrencies, attempting to draw on the success of the digital currency Bitcoin, and so-called Initial Coin Offerings, which see companies selling digital tokens as a form of crowdfunding.\n\nIn June last year, Atari confirmed it was working on a new games console, its first in 20 years. The Atari Box project would allow gamers to play a number of classic Atari games, but it has since been postponed indefinitely. The last update on the console was in December. The Telegraph has contacted Atari for comment on the future of the project.\n\nAtari is not the only company trying to regain former glories by turning to crypto. Kodak, the camera company which, like Atari also went bankrupt, has also turned to cryptocurrency, developing its Kodak Token coin and hosting an ICO.", "Other cryptocurrencies are also up as crypto recovers from its early-February slump.\n\nBitcoin passed $10,000 a coin Thursday afternoon, making for the first time in just over two weeks its trading above the psychological hurdle.\n\nThe flagship cryptocurrency, which still accounts for 35% of the total value of all coins, is up 5.7% Thursday.\n\nBitcoin slumped at the start of February, but has been gaining steam again over the last week or so. It remains well off its all-time highs of over $19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent rally. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world.\n\nCharlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $40,000.", "The last notable time bitcoin, the number one cryptocurrency by market capitalization, passed this threshold was in December of last year as it charted a course to record highs around $20,000.\n\nSince the Feb. 6 low around $6,116 (as per CoinMarketCap) - a correction that saw bitcoin lose 69.5 percent of its value from the all-time high and its lowest point since November - the cryptocurrency has slowly gained altitude despite media headlines and prominent figures in finance calling the correction a bubble in collapse.\n\nAs of press time, the price of bitcoin had hit $10,007.86 before settling back to $10,002.17, according to CoinDesk's Bitcoin Price Index (BPI). Overall, the price of bitcoin has risen more than $500 since the day's open.\n\nAccording to CoinDesk's Bitcoin Price Index, bitcoin opened the session today at $9,477 and climbed steadily through the day, bar a brief drop around 10:00 UTC. The $10,000 mark was reached at around 17:25 UTC.\n\nMarket data indicates that price action on exchanges like GDAX saw the push above $10,000, with a notable green candle emerging. Bitstamp, itBit and Kraken, among others, also saw the price pop past $10,000.\n\nBitcoin's recovery is also reflected across the wider markets, with cryptos across the board also seeing gains after major losses through January and February.\n\nAmid the rebound, tokens like litecoin and ripple (XRP) are doing especially well in the top 10 by market cap.\n\nLitecoin is up 50 percent over the week, while XRP is up 48 percent.\n\nBalloon and flame image via Shutterstock", "According to Warren Buffett, the US government should destroy cryptocurrencies especially Bitcoin. He claims that Cryptocurrencies are a \"poison.\"\n\nCharlie Munger, a 94-years old criticized the various digital currencies when he was making an address to the crowd during a meeting in downtown LA. Charlie Munger is a successful chairman of the daily journal corporation.\n\nWhile answering a question from one of his listeners, he characterized the cryptocurrencies as stupid. He said: \"I regard the Bitcoin craze as totally asinine.\"\n\nThe businessman also described the digital currencies and money to be a \"noxious poison.\"\n\nBitcoin, Ethereum, and Ripple have been the major currencies which have become popular in the world for the past 12 months in history. Additionally, the original Cryptocurrency improved in price up to 2017 with a 1,500% increase. Its price was just under 15,000 euros.\n\nWhile the Cryptocurrency has seen its price drop below the 7,000 euros level this January, it still costs more than what it was last year January.\n\nMr. Munger in his criticism on cryptocurrencies said the following statements;\n\n\"I expect the world to do silly things from time to time because everybody wants easy money.\"\n\n\"It's just disgusting that people are taken in by something like this.\"\n\n\"Our government's lax approach to it is wrong.\"\n\n\"The right answer with stuff that bad is to step on it hard.\"\n\nHowever, this is not the first time that Bitcoin has been criticized by finance professionals. Last year, investors questioned the long-term viability of the currency. To ensure that the digital currencies are reliable and also to offer investor protection, countries in the world are looking for ways for the regulation of cryptocurrencies.\n\nTherefore, central bank governors of Germany and France and the finance minister have called for talks about monetary and policy implications of cryptocurrencies which is a section of the G20 talks.\n\nTherefore, they want the world leaders to initiate a global strategy for dealing with cryptocurrencies. Countries such as South Korean have started the regulation of Bitcoin, Ethereum, and Ripple. Additionally, Asia banned anonymous trading for tracking of criminal activities.", "LONDON -- The number of hedge funds focused on trading cryptocurrencies more than doubled in the four months to Feb. 15, despite sharp falls in the value of the virtual coins in recent weeks, data from fintech research house Autonomous NEXT showed on Thursday.\n\nThe firm recorded a record high of 226 global hedge funds with such a strategy, up from 110 global hedge funds as of Oct. 18. That itself was up from 55 funds at Aug. 29 and just 37 at the start of 2017.\n\nAssets under management hit between $3.5 and $5 billion, according to the firm.\n\nThe surge in funds comes at a volatile time for the cryptocurrencies they trade in. After hitting a record high close to $20,000 in December, bitcoin lost 70 percent of its value to slip below $6,000 in January, posting its worst monthly performance in three years.\n\nBitcoin has since recovered some of those falls, but at just below $10,000 is still only worth around half what it was a month ago.\n\nRival cryptocurrencies have also seen sharp declines. The so-called \"market cap\" of all virtual currencies -- their price multiplied by the number of coins issued -- currently stands at around $465 billion, according to trade Web site Coinmarketcap, down from more than $830 billion in early January.\n\nAgainst that backdrop, cryptocurrency hedge funds lost an average of 4.6 percent in January, according to data from industry tracker Eurekahedge.\n\nThe funds made an average of 1,477.85 percent in 2017, showed Eurekahedge data.", "The financial services provider Western Union (WU) is testing transactions with the use of Ripple's (XRP) Blockchain-based settlement system, the company's Chief Financial Officer Raj Agrawal said in an interview with Bloomberg Feb. 14.\n\nThe globally known money transfer company Western Union confirmed that it is testing Ripple following more than a month of rumor-fuelled speculation that began in early January. The announcement comes after Western Union reported its 2017 results, claiming a revenue of $1.4 bln - a 5 percent increase over the previous year.\n\nAs Ripple's CEO Brad Garlinghouse told Bloomberg, WU has decided to look into their platform in order to facilitate money transfers, particularly cross-border ones. Garlinghouse explained their choice by claiming that Ripple allows for transactions that are \"a thousand times faster and a thousand times cheaper than Bitcoin's.\"\n\nAccording to Bloomberg, Western Union's Chief Executive Officer Hikmet Ersek also confirmed that testing is taking place during a conference call Tuesday, Feb. 13.\n\n\"We are looking especially in the processing settlement and working capital optimization, also in the regulation part, on the compliance part on the blockchain capabilities,\" Ersek said, adding \"we do have some tests with Ripple.\"\n\nRipple (XRP) is a Blockchain-based settlement protocol and a cryptocurrency that has reached almost half of Bitcoin's market capitalization in early January 2018, when its price rallied to over $3.00 per coin. By the middle of January, however, the XRP price has bounced back to a little over $1.00.\n\nWednesday, Feb. 14, Cointelegraph reported on a partnership signed between Ripple and the Saudi Arabian Monetary Authority (SAMA) to provide the technology for cross-border payments to banks in the Kingdom of Saudi Arabia (KSA).", "Haobtc's bitcoin mine site manager, Guo-hua, checks mining equipment inside their bitcoin mine near Kongyuxiang, Sichuan, China.\n\nBitcoin mining is costing South Koreans a lot of money.\n\nMining just one bitcoin in one of the world's biggest digital currency markets costs $26,170, according to data released by lighting and furniture firm Elite Fixtures.\n\nSo-called bitcoin miners are vital to keeping the underlying blockchain, or distributed ledger, network tick. A blockchain network is essentially a huge decentralized database that maintains a continuously growing record of transactions or other data. Miners solve complex mathematical problems to validate transactions and add them to the blockchain.\n\nThe Elite Fixtures data also showed that Venezuela is the cheapest country in which to mine bitcoin. It costs $531 to mine the world's best known virtual currency there. Some Venezuelans have turned to bitcoin mining for survival in the economically struggling South American country.\n\nAnd Venezuela President Nicolas Maduro is banking on a cryptocurrency called \"petro,\" backed by the country's oil, gas, gold and diamond reserves, as a way to get around U.S. sanctions.\n\nMining digital currency uses up a lot of electricity, as miners utilize huge rigs of computers for the process. However, in return for their work, voluntary miners are rewarded with a sum of bitcoin as well as a transaction fee paid by people who transact with the cryptocurrency.\n\nAccording to Blockchain.info data, the total revenue earned by all bitcoin miners hit an all-time high of $53 million on December 17, the same day that bitcoin notched its highest price ever of $19,783.21.\n\nThe Elite Fixtures study analyzed electricity prices from 115 different countries, using data provided by governments, utility firms and the International Energy Agency. It worked out the price of power consumption based on averages from three popular cryptocurrency mining rigs.", "More impressive is that ETFs now deliver active management for nearly the same price as passive investing. The asset-weighted average expense ratio for passive ETFs -- those that track a market capitalization-weighted index -- is 0.21 percent. By comparison, the average expense ratio of smart beta ETFs -- those that replicate traditional styles of active management such as value, quality and momentum -- is 0.26 percent.\n\nETFs aspire to more than just low fees, however. The industry is also about democratizing investing -- bringing investing styles to ordinary investors that have traditionally been available only to institutional and high-net-worth investors -- and nurturing new ideas. It's no accident that smart beta and hedge fund replication, for example, have found homes in the ETF space, or that many of the proposed cryptocurrency funds are looking to launch as ETFs.", "Even if they did, the network effect of major currencies is too strong.\n\nCryptocurrencies are a bad store of value and a bad unit of account. As such, they're a bad form of money.\n\nJPMorgan made that case in a wide-ranging note on cryptocurrencies sent out to clients on Friday. While the bank said it may make sense for some investors to include digital currencies in their portfolios as a hedge, it doesn't view any cryptocurrency as a \"legitimate competitor\" to sovereign currencies.\n\n\"The huge volatility of the price of cryptocurrencies-with respect to either traditional currencies or to a basket of goods and services-has made use of cryptocurrencies as a unit of account impractical,\" the bank said. \"Only hobbyists are using cryptocurrencies as a medium of exchange, at least for conventional transactions for goods and services.\"\n\nThis point has been made by some of the most notable Wall Streeters, including Bridgewater's Ray Dalio and OakTree Capital's Howard Marks. But JPMorgan goes one step further. The bank notes that even if a cryptocurrency were to meet the criteria of a currency, it still would have a very difficult time giving a national currency a run for its money because of the network effect of fiat. Here's the bank's reasoning (emphasis their own):\n\n\"At any rate, even a hypothetically stable-value cryptocurrency is unlikely to compete with the dollar for transactions in goods and services, in say, Chicago, or to compete with the euro in Stuttgart. Economists have long viewed successful, i.e. relatively price-stable, currencies as natural monopolies in a given geographic area. This particular natural monopoly arises as a result of the inherent network externalities: pricing a New York meal in yen makes little sense as almost all customers will be holding dollars.\"\n\nThe only area where cryptocurrencies could compete with national currencies as a medium of exchange, according to the bank, is in the black market.\n\nThe bank's argument echoes that of its chief executive Jamie Dimon, who in September 2017 famously called bitcoin \"a fraud.\" The billionaire banker, who has since stepped away from those comments, also once said bitcoin is only useful for criminals and \"a kind of novelty.\"", "Even if they did, the network effect of major currencies is too strong.\n\nCryptocurrencies are a bad store of value and a bad unit of account. As such, they're a bad form of money.\n\nJPMorgan made that case in a wide-ranging note on cryptocurrencies sent out to clients on Friday. While the bank said it may make sense for some investors to include digital currencies in their portfolios as a hedge, it doesn't view any cryptocurrency as a \"legitimate competitor\" to sovereign currencies.\n\n\"The huge volatility of the price of cryptocurrencies-with respect to either traditional currencies or to a basket of goods and services-has made use of cryptocurrencies as a unit of account impractical,\" the bank said. \"Only hobbyists are using cryptocurrencies as a medium of exchange, at least for conventional transactions for goods and services.\"\n\nThis point has been made by some of the most notable Wall Streeters, including Bridgewater's Ray Dalio and OakTree Capital's Howard Marks. But JPMorgan goes one step further. The bank notes that even if a cryptocurrency were to meet the criteria of a currency, it still would have a very difficult time giving a national currency a run for its money because of the network effect of fiat. Here's the bank's reasoning (emphasis their own):\n\n\"At any rate, even a hypothetically stable-value cryptocurrency is unlikely to compete with the dollar for transactions in goods and services, in say, Chicago, or to compete with the euro in Stuttgart. Economists have long viewed successful, i.e. relatively price-stable, currencies as natural monopolies in a given geographic area. This particular natural monopoly arises as a result of the inherent network externalities: pricing a New York meal in yen makes little sense as almost all customers will be holding dollars.\"\n\nThe only area where cryptocurrencies could compete with national currencies as a medium of exchange, according to the bank, is in the black market.\n\nThe bank's argument echoes that of its chief executive Jamie Dimon, who in September 2017 famously called bitcoin\"a fraud.\" The billionaire banker, who has since stepped away from those comments, also once said bitcoin is only useful for criminals and \"a kind of novelty.\"", "Zero Edge Raised 5 million USD from Private Investors\n\nZero Edge is set to fully revolutionize the online casino industry with its brand new cryptocurrency-based online gambling model. In its run-up to Pre-ICO and ICO, Zero Edge has already attracted widescale global investment, giving it the impetus it needs to push through with their plans to turn the online gambling industry inside out.\n\nAt the time of writing, the Zero Edge online gambling model, which includes a unique cryptocurrency-based money system known as Zerocoin, has raised in excess of 5 million USD from a broad cross-section of private investors. However, more is predicted to stream in on the heals of pre-sale demand and an ever-increasing global interest in the Zero Edge 0% house edge casino model.\n\nZeroEdge.bet offers 0% edge Casino games. World first 0% edge games attract demand for Zerocoin, because of this, its value rises. Players can play 0% games while Zerocoin price rises. Simply put, the ultimate solution to the problem is creating a platform where playing games is \"free\". Players are not required to pay any fixed amount of money to be able to play at the casino. This can only be achieved by creating a closed loop economy with its own token where players purchase the token with fiat or crypto. Since the supply of ZERO is limited, its value is directly proportional to demand.\n\nBlockchain & Smart contract technology allows to create a fully transparent and truly fair gambling environment where players have more opportunities to participate, can completely trust the platform, and have a real chance of winning while at the same time being a part of a bigger community which fosters social inclusion and mutual values.\n\nZero Edge is introducing its own unique cryptocurrency known as Zerocoin, the only way that gamblers will be able to participate in true 0% house edge online casino games through the Zero Edge online casino network. The value of Zerocoin is set to rise rapidly, as more and more people flock to Zero Edge to enjoy true 0% house edge games.\n\nThis is also the perfect opportunity to learn about the pre-ICO or Initial Coin Offering which is set to start on the 28 of February 2018, closing out on the 15 of March 2018. During the Zerocoin pre-ICO, Zero Edge is presenting a no soft cap, while the hard cap is initially set at 1000 ETH. Visit Zero Edge", "The value of bitcoin has surged once again, leading to predictions it will rise to $10,000 (£7,118) by the weekend.\n\nIt comes after the price of the notoriously volatile cryptocurrency rallied on Wednesday morning, touching $8,900 (£6,417) according to CoinDesk, as the European Central Bank ruled out a ban on digital currencies.\n\nIt then made strong gains on Wednesday afternoon, peaking at $9,496 (£6,763) shortly before midnight GMT, then continued to climb on Thursday morning reaching $9,870 (£7,029).\n\nChristopher Keshian, chief executive of $APEX Token Fund, said: \"The current prices of many cryptocurrencies, including Bitcoin, are at levels similar to what we saw last year, prior to the incredibly aggressive bull market in the latter part of 2017.\n\n\"We are now observing healthy support levels and pull backs as part of the normalisation from an outlying and momentarily unsustainable growth curve.\"\n\nHe added: \"Ultimately, we believe cryptocurrencies are in a bull market - but that the upward curve will be jagged one.\"\n\nThe stabilisation follows weeks of turbulence as the value of bitcoin rose and plummeted in cycles that left investors on the edges of their seats.\n\nRussian company the Blockchain Fund launched a hotline to help support investors suffering anxiety as the price crashed below $6,000 (£4,272) earlier this month.\n\nThe move came amid concerns that the huge changes in the crypto market could spark severe stress for investors, and even lead to suicides.\n\n\"Some people are in a panic, they don't understand what is happening. At first everything was so good in this market, and now it has faced such changes,\" Elena Pikhovkina, a psychologist working on the hotline, told Russian site Life.ru.\n\nBitcoin hit a record high in mid-December as prices soared to $19,850 (£14,310) - but tumbled in the first month of 2018.\n\nIt finally plummeted to $6,000 (£4,325) in early February as a series of high-profile thefts and fears of regulation demolished its gains.\n\nSouth Korea recently barred people from trading bitcoin and other cryptocurrencies anonymously, but said it is not planning to ban digital currency exchanges.\n\nMeanwhile, Theresa May hinted that the UK government may introduce similar measures, while the US government has fretted over the cryptocurrency's popularity with criminals.", "Saudi Arabia and Ripple, the company behind the XRP coin, will cooperate by using xCurrent, software that enables banks to instantly settle cross-border payments with end-to-end tracking.\n\n\"Central banks around the world are leaning into blockchain technology in recognition of how it can transform cross-border payments, resulting in lower barriers to trade and commerce for both corporates and consumers,\" said Dilip Rao, Ripple's global head of infrastructure innovation.\n\nThe Saudi central bank will be the first to use Ripple's blockchain network.\n\nRipple is being traded as a cryptocurrency, but it is more of a token than digital money. It peaked at $3.31 in January, but is trading at around $1.15 this week. The idea of the token is to act as a bridge between international bank transactions, not to become an alternative for fiat currencies. The majority of ripple tokens are held by the parent company, meaning that it can regulate their price.\n\nRipple is often criticized by cryptocurrency enthusiasts, who say XRP undermines the whole idea of digital assets being deregulated and decentralized. The company's CEO Brad Garlinghouse has publicly said that Ripple \"works within the system,\" and is not opposed to the traditional financial system.", "LONDON -- Bitcoin is climbing on Thursday morning and closing in on $10,000 per coin for the first time in just over two weeks.\n\nBitcoin is up 3.6% against the dollar to $9,825.91 at 7.55 a.m. GMT (2.55 a.m. ET). As the chart at the top shows, bitcoin slumped at the start of February but has been picking up again over the last week or so. It still remains far off its all-time highs of over $19,000 reached just before Christmas.\n\nIt's hard to pin an exact reason on bitcoin's recent form. The price dip and then recovery has matched rather tightly the recent drama in the US stock markets, but this may be simply a correlation rather than a causal link.\n\nThe London Block Exchange, a startup building a UK-based crypto exchange, writes in its Thursday market update: \"Tomorrow is the first day of the Lunar New Year and some families are replacing their red envelopes of cash for bitcoin gifts.\n\n\"In each of the past three years, the crypto markets have experienced corrections three weeks before this important day.\"\n\nMeanwhile, bitcoin continues to be a topic of discussion for many in the financial world. Charlie Munger, the 94-year-old vice chairman of Warren Buffett's Berkshire Hathaway, called bitcoin \"noxious poison\" on Wednesday, while Llew Claasen, the executive director of the Bitcoin Foundation, forecast that the cryptocurrency will go to $40,000.\n\nHere's how the other top 10 cryptocurrencies by trading volume are doing this morning:Markets Insider", "San Francisco-based Ripple has not had the best of starts to 2018. Its cryptocurrency, XRP, has been on a downward slide since the first week of January and has lost almost 70% of its value. However, things could be about to turn around for the company as Western Union is now test driving its transfer technology.\n\nThe list of banks and financial institutions that are using and testing Ripple's products is growing by the week. Fortune has reported that global payments giant Western Union can be added to that list this week. CFO Raj Agrawal told media that efforts were in a 'testing phase' and there was nothing so far in the process that would be a 'big unlock.'\n\nRegardless, it is still a huge boost for the blockchain company that has seen the price of its cryptocurrency plummet in recent months. On Tuesday, CEO Hikmet Ersek told analysts that Western Union is experimenting with Ripple and XRP for settling transactions and for capital optimization. The move comes a month after Ripple's dealings with rival company Moneygram, which was also testing XRP transfers.\n\nRipple has made more progress with partners than any other cryptocurrency. Just last week, it signed a deal with foreign exchange giant UAE Exchange, and it has also made moves into the Chinese online shopping market. The Asian arm of the company, SBI Ripple Asia, has made a lot of headway with Japanese and South Korean banks in adopting blockchain solutions for money transfers.\n\nRipple has two primary products: xCurrent, which over 100 financial institutions are currently using, and xRapid, which is based on XRP. This is the one that Western Union is now testing. A Ripple spokesperson tells Yahoo Finance:\n\nWe've been testing different products with Western Union for a while. We're excited about our work towards a pilot implementation of xRapid, which uses XRP in payment flows.\n\nWestern Union CTO Sheri Rhodes told media:\n\nWe continue to explore possible blockchain applications for our business, and we are piloting some settlement tests with Ripple for certain corridors. For blockchain in general, we're looking at areas such as transaction processing and settlement, working capital optimization, regulatory technology, and digital identity.\n\nXRP is up 10% in the past 24 hours but has yet to take off on the news and is currently trading around the $1.15 mark. Almost 50% of the global trade is in South Korean won on major exchanges in the country. Market capacity is $45 billion, and it is the third most popular cryptocurrency.", "There are no underpinning fundamentals, so the technical pattern is Key, and savvy traders are solely focused on technicals.\n\nThe $9,000 mark is Bullish because it marks the break above the top of the most recent downtrend channel, or the Psych mark\n\nThe next upward price mark to watch is $11,000, which represents the Top of a more extended downtrend channel.\n\nNotably, $11,000 was a Key support and resistance mark in December and again mid-January, so I expect it to act as resistance when it is tested again in the near future.\n\nGot questions on Bitcoin, Ethereum, Ripple or BitConnect? G-BiTX has the answers, the company has launched a channel on Telegram to help people navigate the world of CryptoCurrencies.\n\nCryptoCurrencies is not about Tax Evasion or Money Laundering, real hardcore fundamental CryptoCurrency Exchanges like G-BiT have seriously tackled the Money Laundering and Tax issues, that's why they have such a bright future. While the Establishment still wants you to be hit with heavy fees and delays sending money around the world the reality is that is legalized theft built in to the Banking Sector and is not a product of cost or reality, CryptoCurrencies have proven that!", "Good news for those who jumped on the Bitcoin bandwagon around the Thanksgiving holidays as family members talked up their new riches from crypto-trading. It seems to have found a bottom right around the levels reached in that holiday week.\n\nCoinbase, the largest bitcoin exchange in the U.S., added roughly 100,000 accounts between Wednesday and Friday of Thanksgiving week, bringing the total of 13.1 million, estimates show.\n\nBitcoin was trading at $9,300 near the end of the trading day on Coinbase Wednesday. Given it was trading around $8,100 on Thanksgiving day, Nov. 23., investors are up 15 percent.\n\n\"It's a good sign for bulls that this level was able to hold earlier this month,\" Bespoke Investment Group wrote in a note Wednesday. \"Bitcoin seems to have found an initial bottom around $6,000, which is right at the levels it was trading at prior to the post-Thanksgiving parabolic move.\"\n\nSource: Bespoke Investment Group\n\nBitcoin's gains accelerated to a record high in mid-December above $19,000, but the cryptocurrency then plunged in the last few weeks amid regulatory concerns to below $7,000 last Monday.\n\nBespoke said Wednesday's price move back above $9,000 \"is also bullish because it marks the break above the top of the most recent downtrend channel. It's important that $9,000 now holds as support going forward.\"\n\nThe next level to watch from a technical perspective is $11,000, which Bespoke said represents the top of a more extended downward trend and was a level of support and resistance in December and again in mid-January.\n\n\"We'd expect it to act as resistance if it is tested again in the near future,\" the investment group said, adding that they expect selling pressure to come in at the $11,000 level.\n\nBut if $9,000 isn't able to hold in the coming days/weeks, bitcoin could \"easily move right back down to support at $6,000 again\".\n\nThe final upside target is the $13,500-$14,000 range, Bespoke said, which represents a roughly 45 percent increase from Wednesday's levels.", "The digital photo of a red rose sold to a group of 10 collectors who split the cost evenly in cryptocurrency. This is thought to be the highest price ever paid for virtual artwork.\n\nThe project, called the Forever Rose, was produced by artist Kevin Abosch and GIFTO, virtual gifting platform on blockchain -- a digital ledger. It's the technology that supports cryptocurrencies such as bitcoin, but in this case it's hosting a digital picture.\n\nCrypto-art is a new market. While you can't touch the artwork or hang it in your home, collectors can choose to hold their \"rose token,\" sell it or give it to someone for a special occasion.\n\nIt's an abstract concept designed to get people thinking about how blockchain technology could be applied to the art world, according to a press release from both parties.\n\nRelated: These Valentine's Day roses cost $39 each but last an entire year\n\n\"People traditionally have valued things they can see and feel. But some of the most valuable things -- like love, for example -- can be felt but not seen,\" Abosch told CNN. \"Art reduced to its core essence is about the idea.\"\n\n\"When the potato [photograph] sold for a lot of money, there was discussion. Is it really worth so much?\" he said. \"People now might say why is cryptocurrency worth anything? People do that with art in general.\"\n\nThe artist recently launched another crypto-art project called IAMA Coin, which combines both physical and virtual art. He has created 100 physical artworks and 10 million virtual artworks. The physical works are stamped using the artist's own blood.\n\nRelated: Long Island Iced Tea wants to be a blockchain company\n\nMore than 150 potential buyers from around the world showed interest in the Forever Rose. The 10 collectors who bought the artwork include leaders and investors in the crypto world, such as ORCA Fund, Future Money and Ink and TLDR Capital.\n\nThe proceeds from the sale will be donated to the CoderDojo Foundation, an organization that offers free computer programming clubs for young people.", "A new payment system, Litepay, is being rolled out later this month which will allow businesses to accept Litecoin and customers to spend the currency anywhere debit cards are taken\n\nLitecoin prices surged by more than a third on Wednesday as the fifth largest cryptocurrency took another step closer to mainstream use.\n\nLitepay - a new payment system for Litecoin - will allow businesses to accept Litecoin payments, while it will also offer users the ability to \"spend dollars anywhere debit cards are accepted, or withdraw cash from any compatible ATM\".\n\nWe started because the people asked @Bitpay to accept LTC. They wouldn't, so we took the challenge. Infrastructure for LTC February 26 ????#PayWithLitecoin #LitePay -- LitePay, Inc. (@LitePayInc)\n\nFebruary 13, 2018\n\nIt is due to be rolled out at the end of this month and the price of Litecoin reached an intraday high of US$216 on Wednesday, representing a 35% daily rise.\n\nThat move dragged the other cryptocurrencies higher as well, with the number one digital currency, Bitcoin, rising almost 10% to trade above US$9,200.\n\nShare Facebook Twitter Google+ LinkedIn Email Print Download PDF version Tom Howard\n\nRegister here to be notified of future PROAC Company articles", "It's been a volatile start of the year for Bitcoin with the cryptocurrency plummeting a staggering 70% off the record highs set in December before rebounding sharply last week. The recovery is now approaching initial resistance and our focus over the next few days will be on breakout of the February opening range.\n\nTechnical Outlook: Bitcoin prices rebounded sharply early in the month off the 76.4% retracement of the July advance at 6039 with the rebound attempting to breach above confluence resistance today at 9164. A close above this threshold would alleviate further downside pressure near-term with such a scenario targeting monthly open resistance at 10149 backed by the 12/22 swing low / 38.2% retracement at 11171.\n\nNotes: A closer look at price action sees Bitcoin trading within the confines of a near-term ascending channel formation with interim confluence resistance eyed around 9557-9715. The immediate advance may be vulnerable heading into this region near-term, but the focus remains higher for now while above 8337.\n\nWhy does the average trader lose? Avoid these Mistakes in your trading\n\nNear-term bullish invalidation rests at 8135 with a break there shifting the focus back towards the monthly lows. Bottom line: the focus remains higher near-term while above 8135 with a breach above a 9715 needed to fuel the next leg higher in price. From a trading standpoint, I'm looking higher near-term with the rally to ultimately offer better short-entries higher up near 10990-11171.\n\nFor a complete breakdown of Michael's trading strategy, review his Foundations of Technical Analysis mini-series\n\n- Written by Michael Boutros, Currency Strategist with DailyFX", "The leading bank in Australia, the Commonwealth Bank mostly known as CommBank, did announce that it is going to ban its customers from purchasing cryptocurrencies using credit cards that are issued by the Commonwealth Bank, as from February 14. This ban still holds for those individuals who possess the Bankwest credit cards. Payments from the cryptocurrency exchanges to the credit cards, however, are going to be processed.\n\nClients of these two institutions will still continue using the debit cards or their transaction accounts in order to purchase cryptocurrencies.\n\nCommBank comes out to explain why they made such a decision with the simple fact that cryptocurrencies in most cases are unregulated as well as being highly volatile in nature. We opted to make this choice since we have a strong belief that virtual currencies in most cases do not meet the minimum standard for regulation, reliability as well as reputation as compared to the currencies which we provide our customers with. Due to the dynamic and volatile nature of the virtual currency markets, its position is reviewed more often, the bank stated.\n\nCommBank becomes the first bank in Australia to put a ban on its credit card owners from purchasing cryptocurrencies; however, it isn't the first bank to do so in the whole world. It was just last week when three major banks in the United States Citi, the Bank of America & J.P. Morgan Chase did announce the same measures. The United Kingdom's Lloyds Banking Group & Virgin Money did the same thing also.\n\nThe reasons behind these decisions were the same: high price, volatile nature of cryptocurrencies & the risk of the customers getting trapped into very serious debt. Several other banks have actually blocked the purchases of credit card cryptocurrency, in most cases to get rid of any possibilities of their clients piling up the cryptocurrency debt that goes unpaid when the market crashes.", "Bitcoin is up more than 8% Wednesday morning. You can track its price in real-time here.\n\nBitcoin is up more than 8% Wednesday morning, mirroring the broader cryptocurrency market, after the South Korean government appeared to backpedal on its reported plans to ban crypto mining and exchanges in the country.\n\nIn a video posted to the presidential website Wednesday, South Korea's minister of Governmental Policy Coordination, Hong Nam-ki, said the government would look at making cryptocurrency trading more transparent, instead of banning it outright, as previously feared, Bloomberg reported.\n\nIn January, news reports of a potential ban fueled selloffs that wiped out hundreds of billions of dollars of value from cryptocurrency markets around the world. Since then, more than 200,000 South Korean citizens signed an official government petition denouncing the proposed ban.\n\nBitcoin today remains the largest digital currency by market cap, and is now trading at $9,160 at the time of writing. That's up more than 50% from its trough just below $6,000 on February 6. Bitcoin currently accounts for 35% of the total cryptocurrency market value, according to CoinMarketCap.com.\n\nThe total market value for cryptocurrencies is up 7% in the last 24 hours.", "Bitcoin is up more than 8% Wednesday morning. You can track its price in real-time here.\n\nBitcoin is up more than 8% Wednesday morning, mirroring the broader cryptocurrency market, after the South Korean government appeared to backpedal on its reported plans to ban crypto mining and exchanges in the country.\n\nIn a video posted to the presidential website Wednesday, South Korea's minister of Governmental Policy Coordination, Hong Nam-ki, said the government would look at making cryptocurrency trading more transparent, instead of banning it outright, as previously feared, Bloomberg reported.\n\nIn January, news reports of a potential ban fuelled selloffs that wiped out hundreds of billions of dollars of value from cryptocurrency markets around the world. Since then, more than 200,000 South Korean citizens signed an official government petition denouncing the proposed ban.\n\nBitcoin today remains the largest digital currency by market cap, and is now trading at $US9,160 at the time of writing. That's up more than 50% from its trough just below $US6,000 on February 6. Bitcoin currently accounts for 35% of the total cryptocurrency market value, according to CoinMarketCap.com.\n\nThe total market value for cryptocurrencies is up 7% in the last 24 hours.", "Millions of idiots trying to mine so they can be part of the latest, stupidest and most irresponsibly hyped get-rich-quick tech craze are hindering the actual important work of finding out if aliens exist. This revelation, first reported by the BBC, has ruined my Wednesday.\n\nI generally stay quiet on the cryptocurrency and Bitcoin front, not because I hold any strong position in either (I own zero cryptocurrency) but because I think it's a stupid, feverish fad that is only encouraged by allowing it any kind of oxygen whatsoever. But the fever doesn't appear to be abating, and meanwhile GPUs used for cryptocurrency mining are high demand, meaning they can't be used for other purposes for which they're well suited, including parsing data gathered by observatories to help find signs of extraterrestrial life.\n\nThe BBC notes that a UC Berkeley team of researchers were hoping to expand their GPU capability at their telescope lab, and that they went to spend a National Science Foundation grant but realized their money wouldn't go as far as planned because the cost of their target GPU hardware had doubled.\n\nIf we miss out on finding other sentient lifeforms because someone spent the last of their 2018 beer budget on a cryptocurrency minor, driving up the price of GPUs in service of chasing an imaginary payday, then I'm gonna be even more pissed off. But maybe said sentient beings will just obliterate us anyway, since we'll just register as a substandard intelligence that has a bizarre fascination with running high-powered PCs around the clock in search of meaningless data with only fictional value.", "Increased interest in trading cyrptocurrencies such as bitcoin has helped spreadbetting firm Plus500 attract a rush of new customers eager to take a gamble.\n\nThe London-listed business said its net profits rose 70pc to $199.7m (£144m) during 2017 after a surge in new and active investors led to a record year of revenue growth.\n\nAlthough cryptocurrency trading accounted for less than 15pc of revenues, chief executive Asaf Elimelech said the market's popularity had drawn people to the company even if they went on to use more traditional products.\n\nThe group offers a derivative product known as contracts-for-difference (CfD), which allows investors to speculate on price movements without owning the underlying shares. That means someone betting on a cyptocurrency CfD could gamble on the price of a digital currency such as bitcoin without ever owning it.\n\nHowever the EU markets watchdog warned last month that it may limit trading in crytocurrencies as part of a wider crackdown to protect amateur investors who are losing too much money on these bets.\n\nMr Elimelech brushed off the potential veto, saying that while a ban \"won't be the most pleasant thing\" the group was not dependent on the market and could still let customers gamble on cyrptocurrencies in other jurisdictions such as Australia.\n\nPlus500 also gave shareholders a dividend per share of $1.7 for the period, up 91pc on the year before. Shares in the firm shot up 12pc in early trading on Tuesday.\n\nSpreadbetting firms are eager to profit from the soaring interest in digital currencies, despite the City's watchdog, the Financial Conduct Authority, warning UK investors that getting involved in these bets was \"extremely high-risk\" and \"speculative\".\n\nBitcoin was worth just a few dollars in 2013, when Plus500 first started offering trading in cryptocurrencies, but hit a high of $20,000 in December. It is extremely volatile, however, falling below $7,000 last week.", "Crypto-mania has been a boon for Nvidia's graphics card business.\n\nStore shelves have been wiped clean of the company's GPUs as would-be miners of bitcoin and other cryptocurrencies seek out the chips that were once only popular among PC gamers, but are extremely effective at running the algorithms behind the digital coins.\n\nShares of Nvidia exploded throughout 2017, gaining 112% in the past year. It was one of the best-performing stocks in the S&P 500, thanks in part to unexpected revenue from newly minted crypto-enthusiasts snapping up Nvidia cards.\n\nHowever, 2018 hasn't been as kind to cryptocurrencies so far. That's where the downdraft kicks in.\n\nSince January 1, bitcoin has fallen 35% while the total market for cryptocurrencies has lost 30% of its value, or roughly $182 billion.\n\n\"With crypto likely contributing larger-than-expected revenue, it is unclear if Q1 will be flattish next quarter,\" RBC Capital Markets analyst Mitch Steves said in a note to clients following Nvidia's record fourth quarter earnings release.\n\n\"We think it is still doable without material crypto exposure given that GPUs are difficult to purchase due to pent-up gaming demand.\"\n\nDespite the fears, Steves maintains an outperform rating for shares of Nvidia, with a target price of $280 -- 22% above where the stock was trading early Tuesday.\n\nGaming makes up just over 18% of Nvidia's total GPU revenue, behind data centers (60%) and automotive (22%), according to Bloomberg's financial analysis.\n\nOthers on Wall Street aren't as optimistic as RBC.\n\n\"We think that there is a growing risk that Nvidia could be impacted by a downdraft in cryptocurrency-related demand at some point in the future,\" Wells Fargo analyst David Wong said this week. He has an extremely bearish price target of $100 for Nvidia -- less than half where shares were trading Tuesday.\n\nNvidia has gained 13% since January 1. Analysts polled by Bloomberg say on average the stock could rise another 10% above current prices.", "Bitcoin was trading at $8,844 in India today on CoinDesks's Bitcoin Price Index (BPI) at the time of reporting. The highest price of Bitcoin for today was recorded at $8,897.81. On Tuesday, Bitcoin's highest price was $8, 915.26.\n\nBitcoin was trading at $8,844 in India today on CoinDesks's Bitcoin Price Index (BPI) at the time of reporting. The highest price of Bitcoin for today was recorded at $8,897.81. On Tuesday, Bitcoin's highest price was $8, 915.26. Still, the popular digital currency that was the flavor of the season for the most part of the last year is a long way from touching its high of $19,783 that it touched on December 17 last year. As per various cryptocurrency experts worldwide, Bitcoin will take good amount of time to recover the record highs that it touched in the second half of the last year. Earlier today, Mario Draghi, President of the European Central Bank (ECB), said bringing about regulation of Bitcoin is not the job of his organisation. He was answering the questions about whether ECB will ban Bitcoins or regulate them in any way. \"I have to say it's not the ECB's responsibility to do that,\" he announced.\n\nA few weeks back Nouriel Roubini, the economist who had rightly predicted the US housing crash in 2008 that Bitcoin mania will end soon as it's just a bubble on the similar lines as Mississippi bubble, tech bubble, and Tulip mania. He also said, \"Bitcoin as mother of all bubbles that will burst anytime soon.\" Nouriel Roubini also said that popular digital currency is on its way down to zero since it lacks any fundamental value. Bitcoin price reached $9,000 over the last weekend. However, it soon plunged below $8,000 briefly on Sunday only to take a climb once again.\n\nLast week, Forbes, the popular American business magazine introduced a list of Bitcoin millionaires, a first of its kind list published by a reputed media platform. It resulted in getting the heads talking sense all across the world. Back in India, a substantial amount of investments have been parked in the popular digital currency especially after the record highs that is touched in the second half of the last year.", "Stellar now added to Bitcoin, Ethereum, Bitcoin Cash, XRP, Litecoin, Ethereum Classic and Dash.\n\neToro, the trading platform that allows investors to view, follow and copy the network's top traders automatically, has added Stellar, bringing the total number of cryptocurrency assets available on the site to eight.\n\neToro, which boasts some nine million users, is bullish on crypto. Stellar, an open-source protocol for exchanging money, will now be available alongside Bitcoin, Ethereum, Bitcoin Cash, XRP, Litecoin, Ethereum Classic and Dash.\n\nIn July of last year, eToro announced that users on its platform would own the actual asset, rather than a CFD, recognising the growing interest among users to buy and hold the asset, rather than speculate on price movements.\n\nThe cryptocurrency will also be added to eToro's Crypto CopyFund, which uses CFDs to enable investors to diversify across all available cryptocurrencies (weighted by market cap) with just one click. eToro users benefit from eToro's verification procedures, security processes and established reputation within the crypto community, added a statement.\n\nYoni Assia, Co-founder and CEO at eToro, said:\"If 2017 was the year of Bitcoin, 2018 will be the year of altcoins. As investors seek new opportunities and diversification within their portfolios, attention will shift away from the mainstream cryptos towards new challengers in the market.\n\n\"We're constantly identifying and assessing new concepts as they emerge and are committed to bringing the best crypto assets onto our platform for our users to invest in. We're excited to have Stellar now available and we look forward to seeing how the market develops in 2018 following a very successful 2017 for the crypto community.\"\n\nJed McCaleb, co-founder of Stellar Development Foundation, added: \"The development of blockchain technology is bringing new innovations to the market almost daily. Platforms such as eToro are an essential component in bringing together innovative projects and early-adopters. We are delighted to be working with a leading crypto platform to make Stellar available more widely.\"", "Bitcoin is heading lower -- much lower -- if the go-go years of the dot-com bubble are any indication.\n\nAlready slashed by more than half since hitting a record near $20,000 in December, the cryptocurrency could plunge a further 90 percent in an environment of unsustainably growing supply, according to Bloomberg Intelligence commodity strategist Mike McGlone. Using Amazon.com Inc. and the Nasdaq Composite Index's spectacular rise and retreat at the turn of the millennium as a proxy, he said the currency could plunge to $900.\n\n\"I spend a lot of time reading about this, and the more research I do, the more bearish I get,\" McGlone said in an interview. \"It's very similar to these Internet companies we saw in the late nineties.\"\n\nWhile the creators of Bitcoin intended to limit supply to 21 million coins, forks mean that there are already more than 50 million outstanding coins based on the original blockchain. There's also nothing preventing rivals from spawning an infinite amount of clones, he said. The number of tradable cryptocurrencies jumped 120 percent in the past year.\n\n\"Parabolically increasing supply is the primary limitation to cryptocurrency market-price appreciation,\" McGlone said. \"There's strong gravitational pull toward $900, the average price since inception and the start of 2017.\"", "By Francesco Canepa\n\nFRANKFURT, Feb 13 (Reuters) - It is not the European Central Bank's job to regulate Bitcoin, its President Mario Draghi said on Tuesday, while warning the public about the risks associated with the volatile cryptocurrency.\n\nCalls are growing for authorities, including central banks, to step in and regulate the market for digital tokens, which has seen wild price swings and a series of heists as well as a rapid proliferation in the number of coins on offer.\n\nBut Draghi said in a video response to questions from the public that banning or regulating such tokens was not one of the ECB's tasks.\n\n\"Many of you posted questions about whether the ECB is going to ban Bitcoins or it's going to regulate Bitcoins,\" Draghi said. \"I have to say it's not the ECB's responsibility to do that.\"\n\nThe head of the Bank for International Settlements, Agustin Carstens, called last week for central banks to end what he described as the \"Ponzi scheme\" of cryptoacurrencies, by restricting their access to banks and financial infrastructure.\n\nThe world's largest central bank chiefs are expected to discuss the matter at a G20 meeting in Buenos Aires in March.\n\nAnswering a question from a member of the public about whether he should buy Bitcoin, Draghi struck a cautious tone.\n\n\"Frankly I would think (about) it carefully,\" he said.\n\nDraghi pointed out that the value of Bitcoin had oscillated much more wildly than that of the euro and that cryptocurrencies were not backed by any public institution.\n\nHe added blockchain, the distributed ledger technology used to record Bitcoin transactions, was \"quite promising\" and expected it to bring \"many benefits\", citing its possible use to settle payments.\n\nHe cautioned, however, it was not yet safe enough for use by central banks.\n\n\"We're very interested in this technology but it's still not secure for central banking and therefore we need to look through it and investigate it more,\" he said.\n\nThe ECB and the bank of Japan have been looking into using blockchain for financial market infrastructure for over a year, reporting in September \"promising results\" but \"no direct conclusion\" for its practical use. (Reporting by Francesco Canepa; Editing by Robin Pomeroy)", "The Commonwealth (CBA), Australia's largest retail bank, has announced that it will no longer allow customers to use its credit cards to buy virtual currencies such as Bitcoin.\n\n\"Due to the unregulated and highly volatile nature of virtual currencies, customers will no longer be able to use their CBA credit cards to buy virtual currencies,\" the CBA announced on its website today.\n\n\"Our customers can still buy and sell virtual currencies using other Commonwealth Bank transaction accounts, and their debit cards, as long as they comply with our terms and conditions and all relevant legal obligations.\"\n\n\"Our position on virtual currencies remains firm - we do not use or endorse any of the existing virtual currencies because we do not believe they have met a minimum standard of regulation, reliability, and reputation when compared to currencies that we offer to our customers.\n\n\"Given the dynamic, volatile nature of virtual currency markets, this position is regularly reviewed.\"\n\nThe ban will also apply to Bankwest customers, and begins from today, Wednesday, February 14..\n\nThe decision follows similar moves from the likes of JP Morgan Chase, Bank of America, Citigroup and Lloyds Banking Group who all announced bans on purchases of cryptocurrencies using credit cards last week.\n\nThe move from the Commonwealth Bank breaks ranks with Australia's remaining Big 4 banks -- Westpac, ANZ and the NAB -- who told the ABC last week that they had no plans to block cryptocurrency purchases using credit cards.\n\nNow that the Commonwealth Bank has moved, there's a chance they too may follow suit.\n\nThe news has had little impact on the Bitcoin price today which currently sits up 2.92% at $US8,784.99.", "NEM is a smart asset blockchain which was built from scratch using Java script\n\nNEM is a \"smart asset\" blockchain which supports the cryptocurrency XEM.\n\nDigital currencies are dominating the world of investing following the surge in the price of Bitcoin in late 2017.\n\nNEM, or New Economy Movement, has the currency symbol XEM and was launched on March 31, 2015.\n\nAnd while most other cryptocurrencies are developed or \"forked\" from other codes, NEM was written from scratch using Java script.\n\nAround 1,500 early investors bought XEM stakes with one stake being the equivalent of 2.25million XEM coins.\n\nA blockchain is a digital ledger where all transactions created using cryptocurrencies are recorded.\n\nA \"smart asset\" blockchain allows users to customize their own blockchain creating their own specific \"smart contract\".\n\nThis means users can create places on the NEM blockchain where they can safely put their digital assets.\n\nOn February 12 NEM was priced at $0.54 (£0.39).\n\nLike many cryptocurrencies, it has suffered slightly after a dramatic high at the start of 2018, when NEM's price approached $2 on January 4.\n\nIt appears that there are many sites online which offer to help people buy NEM (XEM).\n\nBut anyone thinking of investing in NEM (XEM) or another cryptocurrency should be very careful.\n\nTheir values are volatile, with the ability to plummet as quickly as they shoot up.", "Dubai: 'Is the Future of Cryptocurrencies Gold or Dust?' was the theme of a breakout session held on day three of the sixth World Government Summit (WGS 2018) in Dubai on Tuesday.\n\nFeaturing a strong lineup of industry experts including Jesse Powell, founder and CEO of Kraken Bitcoin Exchange; Kian Lon Wong, president of NEM.io; Nick Spanos, founder and CEO of Blockchain Technologies Corporation; and Lawrence Wintermeyer, co-founder and principal of Elipses, the panel explored the context of cryptocurrencies and suggested possible scenarios for augmenting their use in the near future.\n\nPowell initiated the dialogue by addressing the recent surge in the interest around cryptocurrencies. \"Positive regulatory outcomes and the media have been key influencers for the increase in the use of cryptocurrencies over last year. Any time you have a massive surge in price, inevitably there is higher media attention. We also saw more retail and institutional investors enter the space.\n\n\"When the prices rise, more people get interested and try to find out what they are,\" added Spanos. \"What cryptocurrencies are doing is establishing a certain peer-to-peer trust that did not exist before. People are enamoured by the technology and have started purchasing it.\"\n\nSpanos also rebuked criticisms that cryptocurrencies have received from seasoned global investors. He said: \"Cryptocurrency is the people's currency of monetary independence, it is much more than a financial currency. Bitcoin is not a bubble, it is the pin that is popping the bubble of the legacy financial systems since it has been created.\"", "Bitcoin mining is becoming more expensive, according to JPMorgan.\n\nBitcoin miners are in an arms race and it is driving the cost of minting new bitcoin to all-time highs.\n\nThat's according to a big report on cryptocurrency out Friday by financial giant JPMorgan.\n\nMiners are the folks who unleash new bitcoin into the universe by running computationally intensive algorithms on systems called rigs. The miners pumping out the most computing power -- or \"hash rate,\" referring to how many cryptographic calculations the machines can do per second -- have the best chance of earning a new bitcoin. As such, miners are building more and more rigs to one-up their competition.\n\n\"The industry is currently in a hash rate arms race, as the current bitcoin price is incentivizing the addition of more and more mining capacity,\" the report said.\n\nThat doesn't mean more bitcoin are being created. The coin's network is designed to increase the difficulty of successfully mining a coin as the total hash power increases in order to maintain a more or less steady rate of bitcoin creation. More hash power means higher energy costs. As such, the cost to mine one bitcoin has increased dramatically.\n\n\"If this growth in hash rate continues (as it likely will if margins stay positive) without an offsetting increase in energy efficiency of miners, average costs globally will continue to rise,\" the bank found.\n\nAlready, the bank estimates the price of mining one bitcoin has jumped 10-fold over the last year.\n\nThe bank estimates that the price to mine a single bitcoin is approximately $3,920 a coin. That varies depending on geography and energy costs, however. Take a look at the chart:", "Price manipulation in the cryptocurrency space is \"unavoidable\" but will disappear once the market has matured, the head of cryptocurrency firm NEM said Tuesday.\n\n\"Price manipulation is not something new. You see it in mainstream markets as well. We are in a very nascent, growing phase of our industry and these things are unavoidable,\" Lon Wong, president of NEM, told CNBC.\n\n\"Based on that fact, it will be a thing of the past, perhaps maybe when it is more mature. But as far as manipulation is concerned and as far as what we are concerned (about) as NEM, we are more interested in the promotion of our technology than the prices.\"\n\nWong was referring to a report in The New York Times in January that said an increasing number of cryptocurrency investors were concerned about the price of bitcoin and other virtual assets being propped up by cryptocurrency Bitfinex. He added that he is \"not concerned\" about price manipulation.\n\nNEM's cryptocurrency XEM was involved in a huge cryptocurrency heist recently, when hackers stole around $530 million worth of the digital asset from Japanese crypto exchange Coincheck.\n\nWong told CNBC that regulators should work to form coherent regulation for digital currency exchanges.\n\n\"Regulators today are in a learning curve and many of them, I would say, have insufficient knowledge and experience to actually look at how to regulate cryptocurrencies, particularly in exchanges,\" he said.\n\n\"At the end of the day we should see both sides of the divide, the exchanges and the regulators, coming together worldwide and coming to a conclusion about how to get to the next step.\"", "Bitcoin mining is becoming more expensive, according to JPMorgan.\n\nBitcoin miners are in an arms race and it is driving the cost of minting new bitcoin to all-time highs.\n\nThat's according to a big report on cryptocurrency out Friday by financial giant JPMorgan.\n\nMiners are the folks who unleash new bitcoin into the universe by running computationally intensive algorithms on systems called rigs. The miners pumping out the most computing power -- or \"hash rate,\" referring to how many cryptographic calculations the machines can do per second -- have the best chance of earning a new bitcoin. As such, miners are building more and more rigs to one-up their competition.\n\n\"The industry is currently in a hash rate arms race, as the current bitcoin price is incentivizing the addition of more and more mining capacity,\" the report said.\n\nThat doesn't mean more bitcoin are being created. The coin's network is designed to increase the difficulty of successfully mining a coin as the total hash power increases in order to maintain a more or less steady rate of bitcoin creation. More hash power means higher energy costs. As such, the cost to mine one bitcoin has increased dramatically.\n\n\"If this growth in hash rate continues (as it likely will if margins stay positive) without an offsetting increase in energy efficiency of miners, average costs globally will continue to rise,\" the bank found.\n\nAlready, the bank estimates the price of mining one bitcoin has jumped 10-fold over the last year.\n\nThe bank estimates that the price to mine a single bitcoin is approximately $3,920 a coin. That varies depending on geography and energy costs, however. Take a look at the chart:", "© REUTERS/Dado Ruvic/Illustration/File Photo FILE PHOTO: Bitcoin (virtual currency) coins placed on Dollar banknotes are seen in this illustration picture Less than 100 people out of the 250,000 individuals who have already filed federal taxes this year through company Credit Karma reported a cryptocurrency transaction to U.S. tax authorities, the company said on Tuesday.\n\nThis is despite nearly 57 percent of the 2000 Americans surveyed by the credit score startup and research firm Qualtrics last month saying they had realized some gains from cryptocurrencies, according to a Credit Karma study.\n\nRoughly the same percentage said they had never reported cryptocurrency gains to the Internal Revenue Service, while nearly half of those polled said they understood how owning cryptocurrencies affected their taxes, the study said.\n\nThe IRS considers cryptocurrencies such as bitcoin as property for federal tax purposes, meaning any profits or losses from the sale or exchange of the virtual coins should generally be reported as capital gains or losses.\n\nTrading of cryptocurrencies, digital tokens whose value is not backed by central banks and hard assets, surged in 2017 amid a rally in their price. A single bitcoin is worth more than $8000, compared with $1000 a year ago.\n\nDespite the surge it remains unclear how many Americans hold cryptocurrencies as these are bought and sold on online platforms, sometimes anonymously or using pseudonyms. US-based cryptocurrency exchange Coinbase says it has 10 million users, although it is unclear how many of these are in the U.S.\n\nJagjit Chawla, general manager for Credit Karma Tax said the company was not too surprised that few people had reported cryptocurrency gains as Americans with more complex tax situations tend to file closer to the deadline.\n\n\"However, given the popularity of bitcoin and cryptocurrencies in 2017, we'd expect more people to be reporting,\" Chawla said in a statement.\n\nThe deadline for filing taxes this is year is April 17.\n\nThe IRS projects that around 156 million individuals will file this year.\n\nAround 1 million people filed their taxes with Credit Karma's service last year.", "HARARE,- Zimbabwe Stock Exchange extended losses on Tuesday, shedding 0,15 percent to close at 89,5 points on Tuesday weighed down by BAT and Econet.\n\nMarket capitalisation stood at $8,53 billion while turnover amounted to $6,97 million.\n\nBAT eased 0,22 percent to settle at 2,440 cents while Econet lost 0,16 percent to settle at 69,89 cents.\n\nOK Zimbabwe and African Sun also eased 3,03 percent and 19,56 percent to settle at 16 cents and 3,62 cents respectively while Nampak lost 1,16 percent to close at 17 cents.\n\nGains were in Fidelity and Meikles, which added 20 percent and 1,67 percent to trade at 9,6 cents and 30,5 cents respectively.\n\nInnscor and PPC picked up 0,61 percent and 0,66 percent to settle at 85,41 cents and 85,56 cents respectively.\n\nUnfreight also advanced 0,69 percent to close at 1,46 cents.\n\nForeigners purchased shares worth $480,770 compared to sales amounting to $1,5 million.\n\nCryptocurrency, Bitcoin is currently trading at $14,250 on the local exchange, Golix, representing a 67 percent premium on the global price of $8,547. - Source", "Bitcoin is one of the most popular digital currencies in the world and while it's a long way from completely replacing the real currencies we've known forever, it's now accepted in a lot more places than it was just a few years ago. Could you use bitcoin to pay your taxes? Lawmakers in Arizona are debating that very question and might end up allowing residents to pay their taxes in bitcoin.\n\nThe state Senate passed a bill on February 8th, if Senate Bill 1091 turns into law it would allow people to pay their taxes in cryptocurrency. The state's House of Representatives is now gearing up to debate this bill and it can't be said for sure right now if it's going to be passed.\n\nIf the bill becomes law, it will enable residents of Arizona to settle their tax payments through \"a payment gateway, such as Bitcoin or other cryptocurrency, using electronic peer-to-peer systems.\"\n\nThe change won't be implemented immediately, though, as systems would have to be put in place to ensure that everything runs smoothly. The state could start accepting the cryptocurrency as a tax payment as early as 2020, according to Cointelegraph.\n\nIf Arizona does allow this, what would it do with all of the bitcoin it ends up with? \"The Department shall convert cryptocurrency payments to United States Dollars at the prevailing rate within twenty-four hours after receipt and shall credit the taxpayer's account with the converted dollar amount,\" the bill explains.\n\nWith price volatility being a big risk, one could find themselves with the short end of the stick after having made the payment in bitcoin only to see the price suffer a sharp drop before the state has converted their payment into USD and credited their account.\n\nMany in the United States and abroad will be watching closely to see whether or not this bill makes it through the state's House of Representatives.", "After a week of robust gains in the cryptocurrency market, the No.1 digital asset, bitcoin, has run into resistance as industry headwinds put its recent rally in jeopardy.\n\n\"Bitcoin seems to be facing difficulties in moving beyond $9,000. The increase in mining complexity and the peak output of new capacities to the market at the end of 2017 have led to miners facing several issues after price correction,\" FX Pro said in a morning report Tuesday.\n\nThe price of a single bitcoin BTCUSD, -3.26% reached an overnight high of $8,973.12 but have since retraced to a session low of $8,370.48, according to CoinDesk.\n\nElsewhere, Ether, which runs on the Ethereum network, is down 4.3% at $832.52, bitcoin cash is lower by 6.3% at $1,213.31, Litecoin is down 4.9% at $155.12 and Ripple is down 6.1% at $1.02.\n\nRegulatory issues are back in the spotlight after news that seven of the largest cryptocurrency companies have come together to form a self-regulatory body in the U.K. CryptoUK, whose members include the popular Coinbase exchange and various trading platforms said it has produced an industry code of conduct that they hope will be widely adopted.\n\n\"We're extremely proud to have brought together some of the leading players in the sector. This association is not only about exchanges, we represent the whole crypto sector, apart from ICOs. All of us are unified by a desire to grow in the U.K. and for the need for collaboration with government on what our future operating environment looks like,\" Iqbal V Gandham, chair of CryptoUK, said in a statement.\n\nOn the futures front, the February bitcoin contract on Cboe Global Markets XBTG8, -3.68% opened the U.S. session down 3.4% at $8,510, while the CME Group Inc. contract BTCG8, -3.89% last traded at $8,500, down 4%.", "Litecoin cash is not affiliated with litecoin in anyway, and litecoin founder Charlie Lee has warned it could be a scam.\n\nLitecoin is down 2.2% Tuesday morning after the cryptocurrency's first hard fork, Litecoin Cash, was announced.\n\nLitecoin holders will receive 10 tokens of litecoin cash for every one litecoin they own, the newly minted Litecoin Cash foundation said Monday.\n\nThe goal of the new currency is to increase the \"block speed\" at which the network can process transactions. The foundation says litecoin cash has a goal block time of 2.5 minutes -- faster than litecoin. Like bitcoin and most other major cryptocurrencies, but unlike the existing Litecoin network, litecoin cash will use the more energy intensive, but potentially more secure, proof-of-work mining method.\n\nThe fork will occur precisely at block 1371111. The Litecoin network is currently on block 1368028 at the time of writing, according to BlockCypher. The fork is expected to occur sometime around 9 p.m. ET on Monday, February 19.\n\nLitecoin, which was designed to be less energy intensive than bitcoin, saw an astronomical rise in 2017. The cryptocurrency skyrocketed from just $3.73 a year ago, to as high as $365 in December, leading founder Charlie Lee to warn investors about the possibility of losing everything. He also sold his entire stake after being accused of price manipulation.\n\nOne week before litecoin cash was announced, Lee tweeted a warning that any fork of litecoin was \"a scam trying to confuse you to think it's related to litecoin.\"\n\nTwitter\n\nForks aren't uncommon in the cryptocurrency world, although they are not without controversy. Bitcoin cash famously split from the flagship bitcoin in August 2017, but the forked cryptocurrency has been accused of merely riding the coattails of the more established bitcoin.\n\nBusiness Insider could not verify any individuals behind the Litecoin Cash Foundation, which does not claim to be related to litecoin in anyway. The organization's website lists four team members, with no credentials or last names.\n\nLitecoin holders who wish to claim their share of litecoin cash can follow instructions listed on the litecoin cash website.", "Chechen president Ramzan Kadyrov, already a strong supporter of the blockchain technology, reportedly said he intends to purchase a fraction of Bitcoin to be part of the evolution of the cryptocurrency market.\n\nThe Head of the Chechen Republic has been a strong advocate of the blockchain technology, which underlies Bitcoin and other cryptocurrencies, and plans to introduce the technology in the Chechen Republic.\n\nHowever, the Chechnya leader's new-found love for the cryptocurrency is also not without any conditions. He wants to see the investment and trading in cryptocurrencies to be strongly regulated in order to protect citizens from financial pyramids and other fraudulent schemes.\n\nHe had in the past also warned cryptocurrency investors on the evils of the fledgling industry. He believes that the price of cryptocurrencies grow at the expense of investors' greed.\n\nEarlier on January 25, the Russian Finance Ministry had drafted a bill for the regulation of cryptocurrencies and initial coin offerings (ICOs).\n\nThe Russian Government had planned to ban crypto-currencies as they could be used to launder money and finance terrorism. But the Finance Ministry later decided that the ban would only create conditions for its illegal use. It also has plans for a state-issued cryptocurrency, the cryptoruble.\n\nThe new legislation would permit trade in cryptocurrencies through digital exchanges which meet certain conditions. It includes imposing tax on cryptocurrency transactions.\n\nMeanwhile, a new study has found that Cryptocurrency investments in Russian startups have increased 10 times in 2017 when entrepreneurs set in motion more than 100 crypto-funded projects.\n\nby RTT Staff Writer", "Crypto-mania has been a boon for Nvidia's graphics card business.\n\nStore shelves have been wiped clean of the company's GPUs as would-be miners of bitcoin and other cryptocurrencies seek out the chips that were once only popular among PC gamers, but are extremely effective at running the algorithms behind the digital coins.\n\nShares of Nvidia exploded throughout 2017, gaining 112% in the past year. It was one of the best-performing stocks in the S&P 500, thanks in part to unexpected revenue from newly minted crypto-enthusiasts snapping up Nvidia cards.\n\nHowever, 2018 hasn't been as kind to cryptocurrencies so far. That's where the downdraft kicks in.\n\nSince January 1, bitcoin has fallen 35% while the total market for cryptocurrencies has lost 30% of its value, or roughly $182 billion.\n\n\"With crypto likely contributing larger-than-expected revenue, it is unclear if Q1 will be flattish next quarter,\" RBC Capital Markets analyst Mitch Steves said in a note to clients following Nvidia's record fourth quarter earnings release.\n\n\"We think it is still doable without material crypto exposure given that GPUs are difficult to purchase due to pent-up gaming demand.\"\n\nDespite the fears, Steves maintains an outperform rating for shares of Nvidia, with a target price of $280 -- 22% above where the stock was trading early Tuesday.\n\nGaming makes up just over 18% of Nvidia's total GPU revenue, behind data centers (60%) and automotive (22%), according to Bloomberg's financial analysis.\n\nOthers on Wall Street aren't as optimistic as RBC.\n\n\"We think that there is a growing risk that Nvidia could be impacted by a downdraft in cryptocurrency-related demand at some point in the future,\" Wells Fargo analyst David Wong said this week. He has an extremely bearish price target of $100 for Nvidia -- less than half where shares were trading Tuesday.\n\nNvidia has gained 13% since January 1. Analysts polled by Bloomberg say on average the stock could rise another 10% above current prices.", "NEW YORK (Reuters) - Less than 100 people out of the 250,000 individuals who have already filed federal taxes this year through company Credit Karma reported a cryptocurrency transaction to U.S. tax authorities, the company said on Tuesday.\n\nThis is despite nearly 57 percent of the 2000 Americans surveyed by the credit score startup and research firm Qualtrics last month saying they had realized some gains from cryptocurrencies, according to a Credit Karma study.\n\nRoughly the same percentage said they had never reported cryptocurrency gains to the Internal Revenue Service, while nearly half of those polled said they understood how owning cryptocurrencies affected their taxes, the study said.\n\nThe IRS considers cryptocurrencies such as bitcoin as property for federal tax purposes, meaning any profits or losses from the sale or exchange of the virtual coins should generally be reported as capital gains or losses.\n\nTrading of cryptocurrencies, digital tokens whose value is not backed by central banks and hard assets, surged in 2017 amid a rally in their price. A single bitcoin is worth more than $8000, compared with $1000 a year ago.\n\nDespite the surge it remains unclear how many Americans hold cryptocurrencies as these are bought and sold on online platforms, sometimes anonymously or using pseudonyms. US-based cryptocurrency exchange Coinbase says it has 10 million users, although it is unclear how many of these are in the U.S.\n\nJagjit Chawla, general manager for Credit Karma Tax said the company was not too surprised that few people had reported cryptocurrency gains as Americans with more complex tax situations tend to file closer to the deadline.\n\n\"However, given the popularity of bitcoin and cryptocurrencies in 2017, we'd expect more people to be reporting,\" Chawla said in a statement.\n\nThe deadline for filing taxes this is year is April 17.\n\nThe IRS projects that around 156 million individuals will file this year.\n\nAround 1 million people filed their taxes with Credit Karma's service last year.", "A pedestrian walks past the Bithumb exchange office in Seoul, South Korea, on Feb. 2, 2018.\n\nIn a turnaround from its hardline approach to Bitcoin and other cryptocurrencies, South Korea is mulling a licensing system to help regulate the country's virtual currency exchanges.\n\nAuthorities may introduce a system based on the Bitlicense model, developed in New York, Business Korea reports, but a final decision isn't expected until June.\n\nThe system only allows exchanges that have applied for a license, known as a \"Bitlicense,\" from New York State's Department of Financial Services to trade cryptocurrencies. The system imposes detailed reporting regulations and a minimum capital requirement, limiting the number of firms and currencies that qualify, according to Business Korea. Adopting such a system would help bring cryptocurrency trading into a more familiar institutional framework and help the government supervise a notoriously volatile market, the government says.\n\nSouth Korea's new management-minded approach is a dramatic turnaround from its energetic regulatory crackdown on cryptocurrency exchanges this past year, alarmed at a heated market that saw local prices of Bitcoin and other virtual currencies in South Korea trade for higher than international levels.\n\nThe government responded by established more restrictive measures in December last year to curb anonymous transactions and allow regulators more leeway to shutter virtual currency exchanges. The price of Bitcoin, the world's largest digital currency, dropped 12% last month, partly on fears that South Korea would ban trading outright.\n\nFor more on cryptocurrencies in South Korea, watch Fortune's video:\n\nBut the recent decline in cryptocurrency prices since their feverish peak last year -- when Bitcoin, now hovering around $8,700, nearly touched $20,000 -- has convinced the government that safely regulated markets could be viable, according to Business Korea.\n\nAdditionally, banning cryptocurrencies outright would prevent South Koreans from investing in the revolutionary blockchain technology that sustains the virtual coin markets. Deputy Prime Minister Kim Do-yeon echoed the government's softening stance recently, suggesting that South Korea doesn't need to \"get rid of or suppress digital currencies.\"", "\"We know that there are countries with important economies within OPEC, many of them are closely linked to US economy and politics. Let's see how the proposal of President Maduro about the use of Petro will be accepted in the framework of OPEC. I think that it will be difficult enough, as it is known that the US carried out terrible actions at the international level to prevent this event. Let's see what the reaction of the countries will be, but the United States will resist in every possible way,\" the ambassador said in an interview.\n\nAccording to the ambassador, OPEC's Secretary General Mohammed Barkindo was interested in the proposal.\n\n\"The proposal seemed interesting to him. Of course, he does not represent the country, but only an organization, so he needs to transfer the Venezuelan proposal to the OPEC member countries, directly to their presidents,\" the diplomat said.\n\nVenezuelan President Nicolas Maduro said last week after a meeting with Barkindo that he considered it possible to work out a joint cryptocurrency mechanism for all members of the OPEC and other major oil producers.\n\nREAD MORE: Venezuela's Cryptocurrency, the Petro, to Be Backed by Oil Reserves -- Maduro\n\nIn December, Maduro announced the idea to create a cryptocurrency system, called Petro and backed by the country's oil reserves, which is expected to help the country to overcome the financial blockade. The Venezuelan Finance Ministry noted that cryptocurrency was necessary for carrying out financial transactions and searching for new financing options.\n\nVenezuela has allocated five billion barrels of oil to back its cryptocurrency. The authorities reportedly plan to set the initial price of their national cryptocurrency at $60 per one Petro.", "Crypto-mania has been a boon for Nvidia's graphics card business.\n\nStore shelves have been wiped clean of the company's GPUs as would-be miners of bitcoin and other cryptocurrencies seek out the chips that were once only popular among PC gamers, but are extremely effective at running the algorithms behind the digital coins.\n\nShares of Nvidia exploded throughout 2017, gaining 112% in the past year. It was one of the best-performing stocks in the S&P 500, thanks in part to unexpected revenue from newly minted crypto-enthusiasts snapping up Nvidia cards.\n\nHowever, 2018 hasn't been as kind to cryptocurrencies so far. That's where the downdraft kicks in.\n\nSince January 1, bitcoin has fallen 35% while the total market for cryptocurrencies has lost 30% of its value, or roughly $US182 billion.\n\n\"With crypto likely contributing larger-than-expected revenue, it is unclear if Q1 will be flattish next quarter,\" RBC Capital Markets analyst Mitch Steves said in a note to clients following Nvidia's record fourth quarter earnings release.\n\n\"We think it is still doable without material crypto exposure given that GPUs are difficult to purchase due to pent-up gaming demand.\"\n\nDespite the fears, Steves maintains an outperform rating for shares of Nvidia, with a target price of $US280 - 22% above where the stock was trading Monday afternoon.\n\nGaming makes up just over 18% of Nvidia's total GPU revenue, behind data centres (60%) and automotive (22%), according to Bloomberg's financial analysis.\n\nOthers on Wall Street aren't as optimistic as RBC.\n\n\"We think that there is a growing risk that Nvidia could be impacted by a downdraft in cryptocurrency-related demand at some point in the future,\" Wells Fargo analyst David Wong said Monday. He has an extremely bearish price target of $US100 for Nvidia - less than half where shares were trading Monday.\n\nNvidia has gained 13% since January 1. Analysts polled by Bloomberg say on average the stock could rise another 10% above current prices.", "Stellar is an online cryptocurrency system that uses Lumens as units of value\n\nSTELLAR is one of a host of cryptocurrencies springing up in the wake of Bitcoin's roaring popularity among amateur and professional investors.\n\nBut how much is it worth, how do you invest in it and how does it work?\n\nStellar describes itself as a \"distributed, hybrid blockchain\" allowing transfers of value \"for a fraction of a cent\".\n\nSimilar to Bitcoin, it can work as a decentralised currency whose value is not based on anything tangible - just the value that investors place on it.\n\nThe digital currency is based on Lumens - one Lumen is one unit of the currency and has the shorthand name XLM.\n\nLumens are available for purchase on several known markets and exchanges.\n\nBut users should be aware that there is a risk in investing in digital currency as the prices can fluctuate wildly and could lose value completely.\n\nThey are also not insured by regulatory bodies.\n\nThe trading price of a Lumen can be measured on several cryptocurrency monitors.\n\nAs of February 12, 2018, Lumen is priced at $0.38 (£0.27).\n\nSo far, more than 8billion Lumens have been distributed across the world.\n\nThe legal status of cryptocurrencies varies substantially from country to country and is still undefined or changing in many of them.\n\nAnyone thinking of investing in Bitcoin or another cryptocurrency should be very careful.\n\nTheir values are volatile, with the ability to plummet as quickly as they shoot up.\n\nAnd investors are frequently targeted by hackers and other criminals who seek to steal their crypto-cash online.\n\nBe especially careful if you are using direct, peer-to-peer platforms to sell and buy cryptocurrencies.\n\nThese are the equivalent of something like Gumtree - you never know who you might be dealing with.", "HARARE,- Zimbabwe's stock market continued its slow decline on Monday, shedding off 0,467 percent to close at 89,63 points on losses by Delta and Old Mutual.\n\nMarket capitalisation stood at $8,54 billion while turnover amounted to $683,687.\n\nDelta eased 2,41 percent to settle at 162 cents while Old Mutual eased 1,1 percent to settle at 530 cents. OK Zimbabwe also eased 0,3 percent to settle at 16,5 cents.\n\nGains were in Innscor, which added 0,83 percent to trade at 84,89 cents while Zimre and Barclays picked up 15 percent and 4,65 percent to settle at 2,99 cents and 4,5 cents respectively.\n\nForeigners purchased shares worth $305,013 compared to sales amounting to $118,375.\n\nCryptocurrency, Bitcoin is currently trading at $13,151 on the local exchange, Golix, representing a 53 percent premium on the global price of $8,574.", "A small toy figure is seen on representations of the Bitcoin virtual currency in this illustration picture, December 26, 2017. Reuters/Dado Ruvic\n\nBitcoin has had a rough start to 2018, but things may get even worse before they get better.\n\nWhile the cryptocurrency avoided the historic selling pressure that swept much of the markets last week, it is still down more than 35% year-to-date.\n\nBitcoin gripped the attention of Wall Street and Main Street as it soared to an all-time high close to $20,000 in mid-December. Investor anxieties about a frothy market, cryptocurrency hacks, and the potential of a regulatory crackdown in some Asian countries have since dragged the entire market for digital coins to half of its peak worth.\n\nNow, conditions may be forming for a sell-off towards $4,605, according to chart-readers at JPMorgan. That would be a nearly 50% decline from its current price of $8,682 a coin.\n\n\"The question is whether we go there straight away, indicated on a failure to clear 10128 and 10776, or at a later stage after a stronger countertrend rally,\" technical analysts at the bank wrote in a note to clients on Friday.\n\nJPMorgan\n\nBitcoin's recovery from a low above $5,900 earlier this month was \"impressive,\" according to the bank. Still, JPMorgan sees a \"fairly high risk\" of a sell-off towards the $4,605 level if the digital currency doesn't break through its resistance level between $10,128 and $10,776.\n\n\"Above 10776 though, the door for a broader countertrend rally to 14334 if not to 16304 (76.4% on different scales) would be wide open,\" the bank concluded.\n\nBitcoin hasn't traded above $16,000 since early January 2018, according to CoinMarketCap data.", "Over the weekend the price of Bitcoin rambled its way up to over $9k, coming up on a set of stairs from its recent plunge below $7,500 just this past week. That's quite a drop below its nearly-$20k high in December of 2017 - and it looks a whole lot like chaos to most users that haven't been paying close attention to the market past a half year ago.\n\nBitcoin went from around $9k on Saturday to below $8k on Sunday. Now it's back up to nearly $8.7k - and it appears to be madness. For those that are capable of spreading the monthly charts out properly, there's a lot to be said for where and when this bounce will happen - and where it'll continue to happen.\n\nOne thing remains true: negative comments continue to blast forth from the mouths of traditional investor talking heads. They've got their cash in stores of money that have little to do with cryptocurrency, and they're not quite prepared enough to support Bitcoin or any other blockchain-based tech. As such, they'll no doubt continue to spread FUD (fear, uncertainty, and doubt) until cryptocurrency prices start stabilizing in a way with which they're familiar.\n\nRegulatory fears seem to be falling by the wayside, just as it is with every other piece of seemingly important news. This is the way of the world, at the moment. Something that seems important in the moment isn't important in a few days because something else took its place in the meantime. And the technology remains in play.\n\nHave a peek at our brief history of Bitcoin and cryptocurrency articles to find the source of the blockchain. SlashGear will continue to cover everything in this new space as we enter a new age in code. As it is always, nothing posted to SlashGear should be considered financial advice or investment advice. SlashGear takes no responsibility for any action done by any user before, during, or after reading anything on SlashGear.", "Bitcoin speculators are claiming that the cryptocurrencies are now in recovery mode\n\nCryptocurrency traders were probably feeling hopeful on Monday as the price of Bitcoin rallied.\n\nBitcoin gained US$680 per coin, up 8.43%, changing hands at US$8,750 which gives the entire circulation a market value of US$148bn.\n\nAt the same time, the Ethereum price gained US$49 or 6% to trade at US$865 which meant its market cap was US$84.4bn. The Ripple XRP token, meanwhile, was up 3.7% changing hands at US$1.09.\n\nAmid the apparent rally, speculators are claiming that the cryptocurrencies are now in recovery mode following a New Year trading period that saw the value of Bitcoin fall around 60% to the earlier mid-December highs.\n\nShare Facebook Twitter Google+ LinkedIn Email Print Download PDF version Proactive Investors\n\nRegister here to be notified of future BLOCK Company articles", "WILLEMSTAD - The Curaçao-based Dutch Caribbean Securities Exchange (DCSX) has given the approval to list its first cryptocurrency and digital assets investment fund. Curaçao Digital Assets Holding B.V. (CDAH) comes from fintech venture firm Zinica Group, and says the fund has a focus on compliance.\n\nCrypto Fund Approved to List on Dutch Caribbean DCSX\n\nAccording to Zinica's homepage, the fund will provide exposure to the daily price fluctuations of bitcoin, as measured by the Bitcoin Real Time Index (BRTI), supplied by the Chicago Mercantile Exchange (CME).\n\nDCSX logoCDAH, which got approval on February 5th but is not yet listed, previously received an official exemption from the Central Bank of Curaçao and Sint Maarten.\n\nAn announcement on the DCSX homepage said local partners for the fund include Amergeris as Listing Advisor, EY Curaçao (Dutch Caribbean), Amicorp Fund Services, HBN Law, SAI Bank and Baroud Group.\n\nThe exchange added that Amergeris and Zinica Group have several additional projects, and looks forward to further cooperation.", "The company reported that around 17 million nano coins belonging to investors had been stolen through unauthorised transactions. Trading above $11 a token at the time, the stolen amount totaled about $200 million. It is ranked as the number 24 cryptocurrency by value, according to Coinmarketcap.\n\n\"We extend our sincerest apologies to our customers and to all those involved in the illegal transfer of Nano on our platform,\" BitGrail wrote.\n\n\"Today a charge about those fraudulent activities has been submitted to the competent authorities and now is under police investigation.\"\n\nThe announcement was greeted with suspicion fueled by the company's recent moves. In January BitGrail halted all withdrawals and deposits of nano, as well as the lisk and cryptoforecast tokens. The exchange said it would introduce obligatory identity verification and anti-money laundering protocols for its clients, in spite of claiming that it doesn't work with governments or banks. Some users accused the exchange of planning a so-called \"exit scam\", prompting the price of nano to drop 20 percent at the time.\n\nThis is not the first major heist from cryptocurrency exchanges in recent years:\n\nCOINCHECK: Last month the Japanese crypto exchange saw over $500 million stolen in NEM cryptocurrency.\n\nBITFINEX: The Hong Kong exchange claimed about $72 million worth of bitcoin was stolen in 2016\n\nMT. GOX: The Tokyo-based exchange filed for bankruptcy in 2014 after claiming hackers stole nearly half a billion US dollars' worth of bitcoin.\n\nCRYPTSY: Last July, a US federal judge ordered the defunct exchange to pay $8.2 million to customers after it failed to respond to a class-action lawsuit. The court ruled that 11,325 bitcoin were stolen in 2014 and the thief was not found.\n\nReuters cites other notable heists including Bter which lost 7,170 bitcoins in 2015; BitMarket.eu (18,788 bitcoins lost in 2012); Bitfloor (24,000 bitcoins lost in 2012) and Bitcoinica, which lost a total of 102,101 bitcoins in three hacks during 2012.", "Bitcoin clocked six-day highs above $9,000 over the weekend, but a long-term bull market revival may not be on the cards, yet.\n\nHaving clocked a high of $9,070.64 on Saturday, prices again fell back below $8,000 briefly on Sunday before climbing again. CoinDesks's Bitcoin Price Index (BPI) was last seen at $8,772.\n\nThe cryptocurrency has appreciated by 9.70 percent in the last 24 hours, as per data source CoinMarketCap. Bitcoin (BTC) is also close to 40 percent above last week's low of $5,947.40.\n\nSo has the cryptocurrency bottomed out?\n\nBTC has a history of rallying to fresh record highs after the relative strength index (RSI) has bottomed out at, or below, 30.00 (oversold region). However the daily chart throws some doubt on that pattern today.\n\nThe situation today looks similar. The RSI has recovered sharply from below 30.00 and BTC is up close to 40 percent from lows below $6,000. So, going by the historical pattern, BTC should rise to fresh record highs above $20,000.\n\nHowever, the weekly chart indicates it will be easier said than done.\n\nHence, the historical pattern may not occur this time round. That said, BTC seems to have found a short-term bottom, as indicated by the sharp recovery from the lows around $6,000.\n\nLights on highway image via Shutterstock", "You may soon be able to make money by selling your own genetic data, thanks to a US-based startup that is offering a service to sequence a customer's genome. Customers can have their genome sequenced for under USD 1,000, which could then be sold to scientists or pharmaceutical manufacturers.\n\nThe transactions would occur using cryptocurrency technology used for secure valued transactions such as Bitcoin.\n\nThe company called Nebula Genomics is headed by George Church, who suggests that the approach is the wave of the future. Most other genome sequencing companies retain ownership of user data derived from spit swab genetic samples, leaving customers out of the proceeds when they sell the data to other companies. Due to price and privacy issues, the number of people taking part in personal genome sequencing is low, the start-up claims.\n\nTo best make use of genomic data, researchers need samples from more people, which would help reveal trends underlying currently unknown hereditary disease factors, 'TechXplore' reported.\n\nAlso read: Reliance JioPhone Now on Sale Through MobiKwik\n\nThe only way to get many more people involved is by guaranteeing that their data will only go where they decide and by bringing the cost down, the startup claims.\n\nCustomers would be using a cryptocurrency sold by the start-up. Those wishing to have their genome sequenced would buy a token, which they in turn could sell to another buyer, thereby recovering their initial expenditure. The value of tokens can change depending on a variety of factors.\n\nThe tokens can only be redeemed by purchasing someone's DNA data, their value will depend on the willingness of big companies to use them to pay for data.\n\nWatch: Sonam Wangchuk, Engineer And Education Reformist | Interview", "The volatile world of cryptocurrency investment is one hell of a rollercoaster ride. It has seen both astronomical highs and cavernous lows in the last two months, and Bitcoin price varies from the sublime to ridiculous on a daily basis.\n\nWe're tracking its value day by day. The blockchain technology has endured a terrible 2018, but keeps showing signs of a fightback. Some analysts say this is a perfect time to invest, but national governments are now beginning to clampdown on \"digital cash\". Here's how it is currently performing:\n\nOne Bitcoin = $8,405.69 / R100,500\n\nAfter much talk of regulation in he US, Bitcoin actually received a double boost last week. Not only did a Senate hearing play down the risks of investing in the currency, but the state of Arizona have moved to allow taxes to be paid via the cryptocurrency.\n\nIn fact, one market's joy is another's misery. Bitcoin has somewhat profited from the uncertainty surrounding Wall Street, and the Dow Jones. Stocks plummeted in record numbers last week, and have been slow to respond. BC has slowly clawed its way back onto a stable footing after all this.\n\nIn fact, it has been a great week all round for the crypto market...\n\nIt's a digital currency that can be transferred from one electronic device to another. It's like sending money via email. It's completely decentralised, meaning that there are no banks involved and no charges for sending or transferring money.\n\nA quick google search for 'Bitcoin exchanges' will bring you to websites that will allow you to swap some of your money for an amount of the currency.", "It was only a few hours ago when I reported that the UK government has been hit with cryptocurrency mining malware, but now a bunch of Australian government websites have been compromised.\n\nDown Under, the cryptojacking affected the \"the Victorian parliament, the Queensland Civil and Administrative Tribunal, the Queensland ombudsman, the Queensland Community Legal Centre homepage, and the Queensland legislation website, which lists all of the state's acts and bills\", reports The Guardian.\n\nHackers used the same browser plug-in that the UK government was exposed with, Browsealoud, with the developers of the extension, Texthelp, confirming hackers infused crypto mining software Coinhive into their extension.\n\nRussian scientists busted mining crypto in NUCLEAR facility\n\n6 x GPU packs now on sale for miners, GTX 1060s or GTX 1080s\n\nNVIDIA says cryptocurrency demand 'exceeded expectations'\n\nLedger owner? Your cryptocurrency can be easily STOLEN\n\n$4 trillion wiped off stock market, tech stocks are HURTING\n\nUS credit card companies block cryptocurrency purchases\n\nSamsung announces it's making cryptocurrency mining chips\n\nEthereum reaches new record all-time high price of $870\n\nRipple (XRP) value blows up, bypasses Ethereum's market cap\n\nCrypto expert kidnapped, had to pay $1 million BTC ransom\n\nUnikoinGold is now available on Bittrex\n\nBitcoin could be worth $0, according to Morgan Stanley\n\nFacebook Messenger malware mines Monero on users' PCs\n\nUsing 'blockchain' in new name, company shares rise 500%\n\nMiningSky 8-GPU Mining Rig V1 Review\n\nFrench dominatrix pimps clients out in 'Crypto Slave Farm'", "HIGH FEES | The average fee paid to process bitcoin transactions has soared over the past year, outpacing even the staggering price increase of the cryptocurrency itself. Each bitcoin transaction now costs around $7.30 to process, up from around 30 cents at the start of the year, according to trade website BitInfoCharts.\n\nThousands of websites, including ones run by US and UK government agencies, were infected for several hours on Sunday with code that causes web browsers to secretly mine digital currencies, technology news site The Register reported.\n\nMore than 4,200 sites were infected with a malicious version of a widely used tool known as Browsealoud from British software maker Texthelp, which reads out webpages for people with vision problems, according to The Register.\n\nThe news comes amid a surge in cyber attacks using software that forces infected computers to mine crypto currencies on behalf of hackers. The prevalence of these schemes has increased in recent months as the volume of trading in bitcoin and other crypto currencies has surged.\n\nThe tainted version of Browsealoud caused inserted software for mining the digital currency Monero to run on computers that visited infected sites, generating money for the hackers behind the attack, The Register said.\n\nRepresentatives of the US and British law enforcement agencies and Texthelp could not immediately be reached for comment.Texthelp told The Register that it had shut down the operation by disabling Browsealoud while its engineering team investigated.", "A bitcoin logo is seen on a cryptocurrency ATM in Santa Monica, California January 4, 2018. -- Reuters picNEW YORK, Feb 12 -- What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of US$5,922 (RM23,409) it touched on Tuesday, rebounding 53 per cent to US$9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5 per cent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity US Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week US equities are beating the largest cryptocurrency on that field.\n\nSince the drop below US$6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilise while the selloff in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by US regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 per cent slump from Bitcoin's high of almost US$20,000 has prompted finance heavyweights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature. -- Bloomberg", "The graphics card shortage caused by demand from cryptominers is showing no signs of abating, but Nvidia says it is doing \"everything we can\" to increase supply. CEO Jensen Huang reiterated that it is retailers who are setting the current exorbitant prices of GPUs but confirmed the company is asking them to prioritize gamers over miners.\n\nNvidia's relationship with cryptomining is a complicated one. The company just reported record quarterly revenue of $2.91 billion, up 10 percent from the previous quarter, thanks partly to miners rushing to buy its GPUs, often in bulk quantities. Nvidia's executive vice president and chief financial officer, Colette Kress, said: \"Strong demand in the cryptocurrency market exceeded our expectations.\"\n\nBut the firm values its core market of gamers and understands how they tie into Nvidia's other products, such as its G-Sync monitors. Brand loyalty is another important factor -- something not usually associated with miners -- and it knows the mining craze is likely to slow down in the future.\n\nNvidia said it expected the situation to remain the same over the coming quarter but reaffirmed its commitment to gamers. \"Our main focus remains on our core market, as cryptocurrency will likely remain volatile,\" added Kress.\n\nExactly how Nvidia plans to prioritize gamers wasn't made clear. Its request that retailers limit the maximum number of GPUs they sell to each miner isn't something the company can enforce. Hopefully, more sellers will follow in the footsteps of Micro Center and reduce the price of cards that are sold for gaming purposes.\n\n\"We're working really hard to get GPUs out into the marketplace for the gamers. We're doing everything we can, but I think the most important thing is, we just got to catch up with supply,\" said Huang on an earnings call.\n\nIt's also likely that Nvidia is facing supply problems caused by GDDR5 and HBM2 memory component shortages. AMD has confirmed it has had to contend with the industry-wide component shortfall, but Nvidia wasn't as forthcoming about the situation.", "By Kang Seung-woo\n\nThe price of bitcoin more than halved this year so as to generate concerns the value of the first and representative cryptocurrency might go down even more. But the number of cryptocurrencies continues to go up.\n\nAccording to CoinMarketCap, which tracks prices and other data on bitcoin and other virtual currencies, the number of coins it deal with topped 1,500 this month. As of Sunday, it was 1,523.\n\nObservers point out that the number will keep rising as more businesses are ready to spend money to take advantage of underlying technologies of the coins, called blockchain.\n\n\"The values of bitcoin and other cryptocurrencies may fluctuate in the future and I don't know which direction will be the long-term trend. Without regard to their movement, however, what we should really care about is blockchain,\" said a Seoul analyst who asked not to be named.\n\n\"That's why we are seeing more types of digital money and this phenomenon will not change. We have yet to find killer applications based on blockchain but once we do, the investments on it will surge.\"\n\nThe analyst urged the Korean government to realize the big upside potential of blockchain.\n\n\"The Seoul administration appears to care just about the negative influence of massive investments of bitcoin. It should watch what's behind the fever in order not to lag behind,\" he said.\n\nThe government has agonized over regulating cryptocurrency exchanges as reckless investments in them have led to various problems. For example, two investors killed themselves this year after facing big losses on the cryptocurrency market.", "By Camila Russo\n\nWhat's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of $5,922 it touched on Tuesday, rebounding 53 percent to $9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5 percent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity U.S. Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week U.S. equities are beating the largest cryptocurrency on that field.\n\nSince the drop below $6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilize while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by U.S. regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 percent slump from Bitcoin's high of almost $20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature.", "It was announced yesterday that BitGrail, the Italian cryptocurrency exchange, lost 17 million of the cryptocurrency NANO (XRB). To date, the hack is worth over $170 million USD.\n\nA week ago, RaiBlocks rebranded to Nano and jumped in price nearly 40% in 24 just hours.The rebranding was highly anticipated by most in the project's community but not all were certain it would be the best move. Non-the-less, it seemed to have been a positive move until now.\n\nNano provides fast, easy and free transactions on its blockchain. These transactions can be done on an app or your desktop computer, making it extremely convenient to use.\n\nBitGrail's primary purpose was to act as an exchange that facilitates the trading of the digital currency XRB. This exchange has been offline for a few weeks, and many had feared the worst. Today, the exchange's main operator confirmed the devastating news. \"Francesco The Bomber,\" Firano said that the developers on the BitGlass and Nano project were unwilling to collaborate and BitGrail is unable to give the digital tokens back 100% to the coin users.\n\nThe Nano team developers responded to the issue via a Medium post:\n\n\"From our own preliminary investigation, no double spending was detected on the ledger, and we have no reason to believe the loss was due to an issue in the Nano protocol. The problems appear to be related to BitGrail's software,\"\n\nThe Nano team published the transcripts of all the conversations and informed the law enforcement.\n\nThis is bad news for coin owners, as the two parties once held a strong bond. Currently, BitGrail has suspended all of its activity and is expected to announce a public statement shortly.\n\nThere have been other rumors that BitGrail's owner ran away with almost 13% of the total XRB supply. That has yet to be confirmed but due to the friction between the two groups, not surprising.\n\nCurrently, XRB is trading at $9.57 a coin, down -2.67%, in 24 hours time.", "What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin clawed its way back from the four-month low of $5,922 it touched on Tuesday, rebounding 53 percent to $9,069. The S&P 500 Index and the Dow Jones Industrial Average both fell more than 5 percent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while shorter maturity U.S. Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week U.S. equities are beating the largest cryptocurrency on that field.\n\nSince the drop below $6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilize while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by U.S. regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 percent slump from Bitcoin's high of almost $20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature.", "MOSCOW -- Two employees of Russia's top nuclear research institute have been arrested for using the facility's supercomputer for cryptocurrency mining.\n\nRussian news agencies cited the Russian Federal Nuclear Centre as confirming the arrests on Friday. But the reports did not indicate whether the employees had made any money from the computer use. In mining, computers are used to solve mathematical problems to verify transactions and are rewarded in cryptocurrency.\n\nREAD MORE: Bitcoin price falls below $6,000; half its value lost in 2018\n\nThe centre, in the closed-off city of Sarov, 400 kilometers (240 miles) east of Moscow, is a research and development facility for nuclear weapons.\n\nWATCH: Cryptocurrency concerns: could Bitcoin bankrupt you?\n\nThe Interfax and state RIA-Novosti news agencies cited the center as saying that criminal charges apparently were filed against the employees, but the charges were not specified.", "In a CNBC interview on Feb. 7, 2018, the cryptocurrency billionaire said Bitcoin is still a \"very underappreciated asset.\" He didn't give a time frame, but he said Bitcoin prices could be worth up to 40 times more than what Bitcoin prices were trading for on Feb. 7.\n\nAt the time of his bold prediction, Bitcoin prices were trading for roughly $8,500.\n\nThat places his bold Bitcoin price prediction at $340,000.\n\nAnd as bold as that sounds, his reasoning why one Bitcoin today could net gains of 3,900% is not as far-fetched as it sounds...", "Reuters\n\nAs bitcoin and other cryptocurrencies rise in popularity and their prices swing wildly, so too are they entering the consciousness of mainstream financial institutions.\n\nNot only are big banks looking at the applications of bitcoin and the blockchain technology attached to it, so too are they worrying about the impact the volatility could have on their customers.\n\nThis is particularly true when it comes to people using credit cards to speculate on bitcoin.\n\nAlthough there is only anecdotal evidence of this, there is believed to be a growing number of people maxing out their credit cards to buy cryptocurrencies in the hope that their price will appreciate.\n\nBanks are concerned that wild swings in cryptocurrency prices will expose their customers to heavy losses, making them unable to repay their credit card debts.\n\nAs such, some lenders have barred their customers from using credit cards to buy cryptocurrencies, with American banks JPMorgan Chase, Bank of America, and Citigroup leading the way. A number of UK banks have now followed suit, but which ones?\n\nBusiness Insider asked all the UK's major high street banks for their positions on allowing customers to buy cryptocurrencies on credit. Check them out below.", "NEW YORK : Bitcoin and other digital currencies have, so far, not been formidable competition for cash, checks or credit cards as a payment method in the United States and other major economies, according to two economists at New York Federal Reserve.\n\nVirtual currencies usually thrive as an alternative form of payment during times of suspicion around traditional forms of payment, they said in a blog post published on Friday.\n\nCryptocurrency rivals snap at Bitcoin's heels\n\nFor example, in 2015, as Greece struggled with its debt problem, Greek interest and trading in bitcoin jumped amid worries over capital controls and a possible exit from the euro zone, the New York Fed economists, Michael Lee and Antoine Martin said.\n\n\"Cryptocurrencies arguably solve the problem of making payments in a trust-less environment, but it is not obvious that this is a problem that needs solving, at least in the United States and other advanced economies,\" the post said.\n\nIndeed, bitcoin, ethereum, ripple and other digital currencies, while they have grown in use and popularity, have notable drawbacks, the economists said.\n\nWith bitcoin, extreme volatility tends to undermine its function of storing value. This is unlike a traditional currency that is managed by a central bank, they said. Bitcoin transactions also consume a lot of electricity and it takes time to validate transactions, the economists said.\n\nBitcoin suffers dramatic price plunge in Asia\n\nRight now, bitcoin transactions are estimated to use 48 terawatt hours of energy a year, an amount which could power 4.4 million US homes, according to Digiconomist, a blog about cryptocurrencies that Lee and Martin cited in their post.\n\nCash and other traditional payment methods also offer convenience, a formidable advantage relative to cryptocurrencies, the economists said.\n\n\"Fundamentally, we wonder whether a payment method designed to function where trust in institutions is completely absent can ever be as convenient as one where trust is required, but also already exists,\" Lee and Martin wrote.\n\nBitcoin has seen its value tumble as much as 70% from a record peak near $20,000 in mid-December.", "Apple Inc. (AAPL) co-founder Steve Wozniak has sold off his bitcoin holdings. He made the announcement at the Nordic Business Forum in Sweden recently. (See also: Apple Co-founder Steve Wozniak Bought Bitcoin At $700.)\n\nAlthough he became interested in bitcoin when it was at $70, Wozniak was put off by the cumbersome process for investing in bitcoin. Instead, he bought into bitcoin when it was at $700 price levels. Considering current price levels, he must have made a tidy profit during the sale.\n\nWozniak said he bought bitcoin as an experiment. But he dumped the cryptocurrency because he did not want to worry about its erratic price movements.\n\n\"When it shot up high, I said, 'I don't want to become one of those people that watches it, watches it, and cares about the number,'\" Woz said. \"I don't want that kind of care in my life. Part of my happiness is not to have worries, so I sold it all -- just got rid of it -- except just enough to still experiment with.\"\n\nWozniak has mostly been bullish on bitcoin and blockchain. He joined the board of a fintech startup that used blockchain to develop bitcoin ATMs in 2015.\n\nAt the Money 20/20 conference in October 2017, Wozniak said bitcoin is better than gold or the U.S. dollar because it had a finite supply. According to him, gold's finite supply could be increased, if humans came up with a more efficient way to mine it. Similarly, the supply of U.S. dollars could be controlled (i.e., increased or decreased) for political reasons by a governing authority.\n\nBut bitcoin's supply was mathematically constrained to 21 million. \"Gold gets mined and mined and mined,\" he said. \"Maybe there's a finite amount of gold in the world, but bitcoin is even more mathematical and regulated and nobody can change mathematics.\"\n\nWozniak assessed bitcoin as a store of value back then and compared it to owning a house. \"Your house has value. And it is a house today, 40 years from now, it still is a house in value,\" he said. At the Nordic Business Forum, he said he expected bitcoin to become a medium of transaction next.\n\nBitcoin has come a long way from its $700 price levels. The cryptocurrency almost touched $20,000 in December 2017 on the back of online chatter and media mentions. Since the start of this year, however, it has been in a prolonged swoon and has lost almost half of its value. (See also: Bitcoin Price Continues Plunge As Congressional Hearings Loom.)", "Bitcoin billionaires Cameron and Tyler Winklevoss are the 4th richest in the world of cryptocurrency.REUTERS/Brian Snyder\n\nThe life of a bitcoin and crypto-billionaire is stressful.\n\nAfter seeing unprecedented gains over the last year, driving bitcoin, ethereum, and Ripple's XRP token up 1,300%, 8,000%, and 32,000% respectively, the last few weeks have seen a coming back down to earth.\n\nAs of Friday afternoon, bitcoin was down 28% since late January. On Monday, bitcoin hit $7,000, 64% down from its all-time high of nearly $20,000 in late December.\n\nThe total value of all digital currencies has dropped 61% from its January 7 peak at $826 billion to $320 billion as of Tuesday.\n\nBut don't tell that to the crypto-billionaires.\n\nWhile stories abound of regular people making fortunes in crypto, the world's richest crypto and bitcoin-billionaires are primarily the people making the pans and shovels in the digital gold rush.\n\nOn Wednesday, Forbes Magazine released its first-ever list of the richest people in cryptocurrency, a similar list to its Forbes 400 annual list, which dates back to 1982. The numbers are estimates based on the price of cryptocurrencies as of January 19.\n\nIn his letter explaining why Forbes created the list, editor Randall Lane said such transparency could help the crypto industry move out of its shadowy beginnings to financial maturity.\n\nMeet the kings of crypto and the world's richest bitcoin billionaires:", "What's supposed to be the most volatile asset in the universe is proving to be a bastion of stability compared with wild swings and carnage in global equities this week.\n\nBitcoin is clawing its way back from the four-month low of $5,922 it touched on Tuesday, rebounding 47 percent to $8,650. The S&P 500 Index and the Dow Jones Industrial Average are both down more than 6 percent this week, wiping out gains for the year. Emerging markets stocks and currencies also plunged, while U.S. Treasuries climbed as investors fled from risky assets to safe-havens.\n\nBitcoin's supporters are quick to extol the cryptocurrency' virtues as an asset that's uncorrelated to the broader market -- independent from any single country, company or central bank -- which can serve as a haven in times of market turmoil. And while that turmoil can usually be found in Bitcoin prices and headlines, this week U.S. equities are beating the largest cryptocurrency on that field.\n\nSince the drop below $6,000, Bitcoin has been on a steady climb, causing volatility measures on the digital asset to stabilize while the sell-off in the S&P 500 triggered the biggest jump on the Chicago Board Options Exchange Volatility Index ever.\n\nThe \"do no harm\" approach to cryptocurrencies taken by U.S. regulators at a Senate hearing Tuesday sparked the rebound, while negative headlines from regulatory crackdowns in China and South Korea that have weighed on prices subsided.\n\nThe 70 percent slump from Bitcoin's high of almost $20,000 has prompted finance heavy weights to say the crypto bubble had finally popped. Judging from price action this week at least, maybe those calls were premature.", "KuCoin is extremely proud to announce yet another great project coming to our trading platform. Centra (CTR) is now available on KuCoin. Supported trading pairs including CTR/BTC, CTR/ETH.\n\nCentra aims to bridge the gap between crypto and fiat currencies and make purchasing with a range of cryptocurrencies as easily available as paying with a credit card. The foundation of their ecosystem is a smart wallet for storing multiple cryptocurrencies, and a card that allows you to spend those cryptocurrencies anywhere in the world where they accept MasterCard.\n\nThis gives cardholders access to over 36 million points of sale around the world. The conversion into fiat currencies is done by the proprietary Currency Conversion Engine (CCE), avoiding most exchange fees and credit card handling charges.\n\nThey have also developed a coin (CTR), which acts as the gas and utility currency of the Centra ecosystem, and the foundation for the pre-paid cards. You need to freeze a set amount of CTR in your smart wallet to be issued a card of a certain colour. The colour of the card is what determines your purchasing limit. There are three cards available:\n\nCurrently, the CTR has been created on the Ethereum blockchain, but Centra has developed a proprietary blockchain called Centrachain launching soon.\n\nICO Price: 1CTR = 1.78 USD\n\nCentra Tech(CTR) Official Website: https://www.centra.tech/\n\nCentra Tech(CTR) Telegram: https://t.me/centratech\n\nCentra Tech(CTR) Whitepaper: click here\n\nRisk Warning: The cryptocurrency investment is a venture capital deal, it has 7 x 24 hours trading business model with no market close time. Please pay more attention to risky investment. KuCoin holds a strict system of censorship about all tokens deal, but we never take any liability for the investment behavior.\n\nImages courtesy of KuCoin", "Cointelegraph (CT) is pleased to announce the launch of its Italian version Cointelegraph Italia, today, Feb. 9.\n\nCointelegraph Italia provides all the latest information from Cointelegraph in Italian, including updates on the cryptocurrency markets, Blockchain technology, decentralized applications, and fintech from the global community, as well as locally-focused updates for Italy.\n\nCointelegraph offers breaking news briefs, as well as longform stories, guides, coin price indices, analysis and key digital currencies and fintech trends.\n\nWe hope that our platform will help bring the Italian Blockchain community together - from Milan to Sicily.\n\nFollow Cointelegraph Italia on Facebook or Twitter to stay updated, and share opinions and ideas, in Italian.", "Jensen Huang, CEO of Nvidia, shows the Drive Pegasus robotaxi AI computer at his keynote address at CESRick Wilking/Reuters\n\nNvidia reported a record fourth-quarter on Thursday, and shares are trading up more than 10% in early trading.\n\nWall Street was largely expecting the company to beat on earnings, but was worried good numbers would rely on unreliable and volatile cryptocurrency demand. Nvidia's earnings show it's more than just a crypto company though, soothing those investors fears.\n\n\"1) Data Center growth of 20% or more? (Check, 21.0%); 2) Gaming growth of 5-6% or more? (Check, 11.4%); 3) Gross margins in the 60s? (Check, 62.1%) and 4) Guidance of down 1-3% sequentially? (Check, flat at mid-point with margin expansion),\" Mitch Steves, an analyst at RBC Capital Markets said in a note to clients Friday.\n\nAhead of the report, some analysts were worried Nvidia would have trouble showing it could sustain growth outside of its graphics division. Cryptocurrency miners contributed about $70 million in sales during the third quarter, and Steves estimates the miners added about $180 million in sales during the fourth quarter.\n\nAMD, Nvidia's main rival in the space, said about one-third of its graphics division growth came from cryptocurrency miners, which led some investors to worry if the company would be growing without the wildly volatile cryptocurrency market. After it's earnings report, it looks like Nvidia isn't facing the same problems.\n\nThe one blip in Nvidia's stellar report came from the sluggish growth in its automotive division. Nvidia's chips for power infotainment systems and self-driving cars are off to a slow start, but the company could just be a bit too far ahead of the curve, Steves said. In a couple years, when autonomous cars become more popular and more advanced, the 3% growth will start to be a bigger problem.\n\nSteves rates Nvidia as an \"outperform\" and has a $280 price target, about 22% higher than the current price.", "Student regrets decision to feed annoying swan through his window Tom HerbertFriday 9 Feb 2018 3:15 pm Share this article with Facebook Share this article with Twitter Share this article with Google Plus Share this article through email Share this article with Whatsapp Share this article through\n\nAn exasperated student got more than he bargained for after he fed a persistent swan some bread through his bedroom window.\n\nShaka, from Enfield, London, threw the annoying bird some food after it woke him up with incessant pecking on the glass as he tried to sleep before lectures at Lancaster University.\n\nGirl, 13, filmed slapping elderly woman across face in street\n\nBut Shaka came to regret that decision after his attempt at distraction merely attracted another swan to his window.\n\nShaka said: 'This hasn't happened to me before and obviously when the flat was sold to us there was no disclaimer about swans trying to wake you up for breakfast.\n\n'At first, I thought it was someone doing construction outside and then I realised that it was a flipping swan trying to get into my room.\n\n'It continued to bite up along the window trying to get in.\n\n'When I tried to send it away its friends arrived, so I had a swan group just outside hindering my sleep, which I value very much.'\n\nEurostar is launching service from London to Amsterdam\n\nHe chronicled the entire day, which began with the animal knocking on his door before lectures.\n\nUnable to ignore the feathered pest, he threw out a few slices of bread to try and distract his unwelcome visitor, only for it to attract another swan.\n\nAfter more than two hours, the swan finally gave up and left Shaka alone only to return once he had come back from his lecture to carry on nipping at the window with his beak.\n\n'When I finished my lectures, the swan saw me go into my room and decided to come back and knock again,' he said.\n\n'Yeah, I tried to get rid of the swans by banging on the window, telling it off and eventually throwing bread but then the seagulls came and robbed the bread so that didn't work in the slightest.\n\n'I hate any type of bird unless it's chicken on a plate.'\n\nMORE: Bitcoin price fears as Hong Kong sets out cryptocurrency crackdown plan\n\nMORE: What are the rules of curling and how much do the stones weigh?", "NVIDIA Corporation (NASDAQ: NVDA) reported a strong earnings beat, but wasn't strong enough for at least one analyst to turn bullish on the stock.\n\nKeyBanc Capital Markets' Michael McConnell maintains a Sector Weight rating on Nvidia's stock with no assigned price target.\n\nNvidia's fourth quarter report consisted of a revenue beat on strong sales of GPUs to the datacenter end market, the gaming end market, and for use in cryptocurrency mining, McConnell said in a note. Gross margin of 61.9 percent came in ahead of the 59.7 percent the analyst expected due to a favorable mix of higher-margin datacenter segment sales, while a lower-than-expected tax rate also helped the company report an earnings beat.\n\nNvidia's report offset the analyst's prior concerns on growth in the gaming segment, but the company's guidance came in flat. Management guided its first quarter revenue to be $2.9 billion, which implies zero growth from the fourth quarter but 50 percent year-over-year.\n\nNvidia's valuation needs to be taken into consideration. The analyst's fair value for Nvidia's stock at $206 is based on a 25 times multiple on his new fiscal 2020 earnings per share estimate of $8.25 and implies the stock has downside potential. A bull-case scenario would value the stock at $265, while a bear-case scenario would see the stock valued at $191.\n\nShares of Nvidia were trading higher by more than 9 percent at $237.50 early Friday morning.\n\nIs Nvidia A Buy? Only If Shares Fall Further, Says Miller Tabak Analyst", "Decatur County General Hospital, a 40-bed facility in Parsons, Tenn., is offering 24,000 patients one year of credit monitoring services after its electronic health record system was hacked.\n\nThe incident appears to be a ransomware attack, although the organization did not use that term in the notification letter it sent to patients.\n\n\"On November 27, 2017, we received a security incident report from our EHR system vendor indicating that unauthorized software had been installed on the server the vendor supports on our behalf,\" the hospital explains. \"The unauthorized software was installed to generate digital currency, more commonly known as 'cryptocurrency,' \" a digital currency such as bitcoin.\n\nThe hospital did not identify the vendor of its EHR system in the notification letter sent to patients. Its patient portal is generically branded, but indicates that the copyright for the technology belongs to CPSI.\n\nAlso See: New sophisticated ransomware carries a high price tag\n\nInvestigation of the attack continues but it is believed that an unauthorized individual remotely accessed the server where the EHR stores patient information to install the malware. The software was installed as early as Sept. 22.\n\nWhile noting there is no evidence that patient information was actually acquired or viewed, the hospital was unable to verify that there was no unauthorized access.\n\nCompromised data included names, addresses, dates of birth, Social Security numbers, diagnoses and treatment information, and insurance billing information. The hospital urged patients to place a fraud alert on their credit files and explained the process in the notification letter.\n\nHospital personnel did not immediately respond to a request for additional information.", "Forbes has released its first ever list of richest people in cryptocurrency, which is topped by Ripple co-founder Chris Larsen, with an estimated crypto net worth of USD 7.5-8 billion.\n\nThere is a huge spike in the value of the unregulated cryptocurrencies, which are mined using secret algorithms based on the blockchain technologies.\n\nAccording to Forbes, the average 2017 price change of Bitcoin, Ethereum and XRP, three of the most common cryptocurrencies, is a whopping 14,409 per cent. As per the publication, there are now nearly 1,500 cryptoassets in existence, valued at an aggregate USD 550 billion, up 31 times since the beginning of 2017.\n\nMeanwhile, in India, cryptocurrencies are not legal tender and the government will take measures on their use as part of payment systems, announced Finance Minister Arun Jaitley in Union Budget 2018-19.", "Bitcoin has gone to its bottom price and will rise back to its peak level and then probably grow from there said digital investor Dan Morehead.\n\nSpeaking with CNBC's Fast Money Dan Morehead from Pantera Capital made some very promising predictions regarding the immediate future of cryptocurrency, and he had the statistics to back them up.\n\n\"Bitcoin is still so underowned by institutional investors that it trades at its own beat,\"\n\nMorehead called for a 50 percent decline in Bitcoin prices before there would be another surge back in December when his fund was up 2,922 percent and had collected $2 Billion in assets under management. The firm became so successful it was forced to raise fees to reduce investor inflow.\n\n\"It's volatile on the upside. It can be volatile on the downside.\"\n\nPantera Capital started its first fund in 2003 and it's first cryptocurrency fund in 2013. Now working only in cryptocurrency Pantera has had returns of over 22,000 percent. In 2017, the firm launched an ICO, or initial coin offering, fund, and a digital asset fund, receiving returns of 549 percent and 188 percent, respectively.\n\nMorehead said that we have experienced a 64% fall from peak to trough which is the average decline for Bitcoin in the last seven bear market cycles. He said the fall in value was the right downdraft.\n\nAdding that bear markets have historically had a 71-day run and that this one is in its 52 day he sees it coming to the end of its cycle.\n\n\"It seems like another couple of weeks and everything will be normal and [bitcoin] can start growing back up again.\"\n\nSince the new year market correction cryptocurrency has started a slow recovery starting mid-week as Bitcoin went back over $8,000.\n\nWhen asked about regulatory measures in the US Morehead said that it has been good for cryptocurrency and even more would be better.\n\nCiting the ruling of Bitcoin as property and the CFTC clearing the way for crypto futures, and the SEC talking a more or less hands-off approach as being helpful to investors.\n\nWhile confirming that his firm is most heavily involved with established cryptocurrencies such as Bitcoin and Ethereum Morehead said that emerging protocol tokens or ICO's are what interests him personally. Calling them the small caps of the industry.", "This also coincides with the 61.8% Fibonacci retracement level, which already appears to have held as a floor.\n\nBitcoin price could be due for a small bounce off these short-term support levels as bullish pressure appears to be slowly returning.\n\nTechnical Indicators Signals\n\nThe 100 SMA is still below the longer-term 200 SMA to indicate that the path of least resistance is to the downside. This means that the selloff is more likely to resume than to reverse.\n\nHowever, the gap between the moving averages is slowly narrowing to indicate that bearish pressure could be fading. The 100 SMA might also hold as dynamic support if this keeps up.\n\nStochastic is turning slightly higher to signal that buyers are returning, but RSI is still on its way south so bitcoin price might follow suit. If the $8,000 level holds as support, price could bounce up to the swing high or the channel resistance closer to $9,000.\n\nRisk aversion returned to the financial markets and these days bitcoin price has been tracking equities and commodities, unlike in the past when the cryptocurrency tends to benefit from safe-haven flows.\n\nHowever, analysts are confident that the market slump is just a mere correction from the overdone rallies earlier in the year. If so, higher-yielding assets including bitcoin could see the longer-term uptrend resume at some point.\n\nFor bitcoin price, it seems that traders are mostly waiting for a strong catalyst that could encourage investors to reopen their long positions. One possible factor could be the Senate hearing that called upon regulators to increase oversight without hampering development, something that could still be overall positive for the cryptocurrency industry.", "NVIDIA is not blind to the current GPU shortage. During an investors conference call, Jen-Hsun Huang, CEO of NVIDIA made it clear that the company is doing its level best to address the shortage, and that its focus is still set on the gamers and not the miners.\n\n\"We're working really hard to get GPUs out in the marketplace for gamers, and we're doing everything we can to advise e-tailers and system builders to serve the gamers,\" Huang had said during the conference call.\n\nNVIDIA disclosed that during the fourth quarter earnings of its 2018 fiscal year, its GPU business brought in a record revenue of US$2.46 billion (~RM9.69 billion), exceeding its initial expectations. The company, however, did hint that it was the strong GPU demand in the cryptocurrency market that contributed to this boom in revenue.\n\n\"Cryptocurrency account for a higher percentage of revenue than the previous quarter,\" Colette Kress, executive vice president and CFO, NVIDIA, mentioned during the call.\n\nTo recap, PC gamers have essentially been left in the lurch looking for an affordable GPU, and it's mainly due to cryptocurrency miners snagging up every available GPU they can get their hands on.\n\nTo make matters worse, there is also a global shortage of memory chips, which in turn has affected the production supply of graphics cards. In light of the shortage, many retailers have increased the price of all graphics cards model. Again, this has left many gamers frustrated, simply because they aren't willing to pay more than what a card is worth.\n\nFor example, a GeForce GTX 1080 Ti from any brand currently sells for RM4,000 on average, while a mid-range GPU such as the GeForce GTX 1060 and Radeon RX 480 can be purchased for an average price of RM2,000.\n\n\"We're doing everything we can, but I think the most important thing is, we just got to catch up with supply,\" Huang said. \"We're just constrained.\"", "Despite their rough entry to 2018, Bitcoin and other cryptocurrencies are here to stay according to cyber security expert-cum-Shark Tank investor, Robert Herjavec. The 55-year-old Croatian-Canadian entrepreneur feels that digital currency is a logical replacement for the paper cash that we as a society are increasingly less dependent upon. Speaking with Time's MONEY show, the TV investor stated:\n\n\"To me, it's the wave of the future... Fast forward 25 years from now, there will be some form of a cryptocurrency that we will pay for electronically, and the concept of cash will go away one day.\"\n\nHe's also particularly optimistic about blockchain technology. For him, the backbone of digital currencies could be a real game changer to the cyber security industry he's so familiar with. He believes that decentralised data storage solutions will revolutionise the verification of business transactions:\n\n\"It's going to have massive benefits for humanity, in all kinds of transactions including cyber security.\"\n\nHowever, Herjavec isn't completely sold just yet. The investor hasn't used any of the $200 million he has behind him to take a position in any cryptocurrency just yet. He still feels its too much like the Wild West at present. He told the news outlet:\n\n\"There's no base for it... When I buy a house and it's overpriced, I can live in it. There's some fundamental value. The challenge with cryptocurrency is, it could go to zero. There's no one exchange that is making them. Exchanges that sell them now can be hacked. We recently saw the largest breach ever -- $500 million in 24 hours. If you had bought that exchange, it's not that you've gone down 20% or 40%, you've actually gone to zero.\"\n\nToday's sentiment from the businessman and investor seems to mirror that expressed to BNN last December. On Bitcoin's insane price run out at the tail end of last year, the Shark Tank personality stated:\n\n\"I really think that cryptocurrency is going to go up. It's definitely a bubble. The underlying technology, Blockchain, is here to stay.\"\n\nHe went on to display a somewhat dated and naive interpretation of the cryptocurrency economy as it exists at present:", "Bitcoin, the world's largest cryptocurrency by market capitalization, is hovering just above the $7,000 mark per coin as the digital currency market suffers one of its most widely covered and harshest sell-offs in recent history. In December, the bitcoin frenzy hit its peak with the cryptocurrency flying to record highs near the $20,000 mark. While investors may be extremely unsettled as bitcoin trades at less than half of its value of a month ago, one early crypto investor suggests that volatility is normal and that the market will stabilize this year after bitcoin regains its value. (See also: Crypto, Cannabis, FOMO Drive New Investor Inflow.)\n\n\"We've seen it go down 50% at a time. It's quite a resilient currency/commodity/asset that just keeps going up afterwards,\" said Ran Neu-Ner, host of CNBC's \"Cryptotrader.\" \"I think 2018 is the year where the mechanisms to allow retail consumers to get into cryptocurrencies start to open themselves up ... The price will become more stable.\"\n\nLast week, Neu-Nur predicted bitcoin bottoming around $7,500, indicating that he couldn't see it going much under that due the big uptake in crypto trading, particularly highlighting \"a lot of retail money that has gone into bitcoin.\" A day after his interview on CNBC, the investor \"pinned a tweet\" forecasting bitcoin to finish this year at $50,000.\n\nNeu-Nur made his bull case based on the idea that in 2018, \"the mechanisms to allow retail consumers to get into cryptocurrencies start to open up.\" For example, he noted that Robinhood, a popular online brokerage used primarily by Millennials, started offering free bitcoin trading last week. As it becomes easier for the retail investor to start trading bitcoin, Neu-Nur expects the price of the digital currency to stabilize. He attributes bitcoin's large price swings to a market with \"not enough buyers and not enough sellers.\"\n\nThe investor also recommended buying ethereum, indicating that \"the smartest people in the world are developing on ethereum.\" While bitcoin has two use cases at max, either serving as a currency or a store of value, Neur-Nur said that ethereum is attractive as a platform for multiple uses, from hedging to betting and sports.\n\nHe sees bitcoin as more of a store of value than a currency, indicating that none of the blockchains are ready for the scale of real-world currency transactions. (See also: Over 1M Join Waitlist for Robinhood Crypto Trading.)"]